{
  "id": "a-revenue-model-for-based-rollups",
  "sourceId": "LEFXQV",
  "title": "A Revenue Model for Based Rollups",
  "description": "We outline the costs that a based rollup has, followed by the paths it has to revenue generation, revenue capture and finally revenue redistribution. We demonstrate that based rollup costs are front-loaded and non-negligible. Based rollups must pay for ZK-provers, app- and user-onboarding, R&D, etc, as well as L1 fees. We consider several continuous and once-off revenue models, and compare the pros and cons of each according to several key properties that based rollups are expected to have.",
  "track": "Layer 2",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Rollups",
    "Fragmentation",
    "Tokenomics",
    "based",
    "Fragmentation",
    "Rollups",
    "Tokenomics"
  ],
  "keywords": [
    "Based",
    "Rollups"
  ],
  "duration": 1495,
  "language": "en",
  "sources_swarmHash": "b63d6fa56a15994cca2cdb01389e1a10844f54ba6e58a9f5e6b70b907db057af",
  "sources_youtubeId": "JFCfnhFL9Mc",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673407ec3a168eb5356f00b8",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673407ec3a168eb5356f00b8.vtt",
  "transcript_text": " Hey everyone. There's a little box here just in case I need to sit down on top of the front row. Okay cool. So yeah my name is Connor. That's not my slide. Perfect. Okay. So yeah, I'm Connor. I'm from Nethermind. And today I'm going to talk about a revenue model for base rollups. Now, I wrote this title before I really sort of had an idea what I was going to talk about. And then I realized that revenue probably just refers to income. But base rollups are not just about when you're thinking about rollups in general, it's not just about income, it's about income and expenditure. And comparing the two, I'm going to talk about revenue, but base rollups are not just about, when you're thinking about rollups in general, it's not just about income, it's about income and expenditure, and comparing those two is how you decide if you want to be a part of the base rollup. And I guess not only are we going to talk about the base rollup as a sort of an entity, but also the entities, the real-life people that are participating in base rollups. So a quick primer on base rollups for anybody who isn't aware but they're lost is a rollup is said to be based or L1 sequenced when its sequencing is driven by the base L1. So basically, the L1 proposers are in charge of proposing the blocks for this rollup. And the rollup derives its state from the sequence of transactions that appear on L1. Now, a lot of rollups might actually, you could squint and say that most rollups are like that already, but I guess the key thing is that the L1 proposers aren't supposed to be sequencing the chain. So the goal of today's talk is introduce the players in base rollups. So we're going to look at each of the players and think about the income and expenditure that they have and should they be playing this game. Identify their income and expenditures. Discuss how likely they are, how these income and expenditures are going to change on the roadmap that's upcoming, the big change that we're expected to see, and then motivate you all to participate in base rollups and be thinking about these income and expenditure problems that exist. And then, yeah, I mentioned fat stacks for all, but really what that means is everybody has positive P&L when they're playing these games. Okay, so who do we have here? So we have the users. They're the most important, right? We're always trying to sort of make, although I was on a panel yesterday where we're talking about who should be gaining the revenue in a system and users were the bottom of the list. But users should be the ones that are gaining something from playing the game. So they're going to be the ones that are going to be driving the revenue for a base roll-up. Proposers and sequencers, I'm putting them in the same bracket. ZK-provers, so we have this proposer over here and this based blockchain that's accepting the blocks. We have ZK-provers, because I guess a stage two roll-up should have ZK-proofs. The DAO, so I guess when maybe some of you are here and you're thinking about the revenue model for base roll-up and you're thinking that it's the DAO that we're trying to create revenue for, but I think there's just too many players in the ecosystem to fully focus on just the DAO or whatever the treasury that exists on a base roll-up. We're going to be thinking about them along with everybody else. And then also we're going to have to think about these other chains and roll-up. We're going to be thinking about them along with everybody else. And then also, we're going to have to think about these other chains and roll-ups because they are actually a big driver of the revenue, the income and expenditure for a roll-up. So I have this, the shark from Finding Nemo. So depending on how you look at it, it could be a friend or it could be a foe, and there will be cases where they are both. Okay, so setting the table. So I guess maybe one of the reasons why I got accepted today was because basically when I submitted this talk, we were around June or July, and we were in a situation where Tyco was losing money by posting blocks to L1, which people were focusing on and people were getting really scared, like base rollups might not have a future, what's happening here. But there was a good reason for this. Tyco wanted to make sure that users were getting a reasonable UX, that they were getting updates every 12 seconds, because base rollups can only confirm blocks when they get posted to L1. Now again, there's this concept of pre-confirmations but they aren't live yet. At the time, Tycho was forcing L2 blocks onto the L1 while they were only half or less. So they weren't actually generating enough fees to compensate for the cost of posting to L1. But again, this was sort of the P&L that Grow the Pi was generating, right? And the P&L that they were looking at was L2 gas fees collected minus the L1 fees that were paid to post data and proofs to the L1. So that's a relatively simplified model of the revenue, the income minus expenditure for a base roll-up. There's actually a lot more components that we need to consider when we're thinking about is this base roll-up viable to run. So if you want to get a bit deeper, Nethermind Research did get a little bit deeper at one point, and I guess we're getting deeper by the day. We had this sort of maybe a little more complex model where we were looking beyond the on-chain costs and looking at the running costs of running a prover, for example. Running a prover is not cheap. Not only do you have to actually pay the electricity costs for running the prover, you actually have to buy the prover in the first place. So most people today aren't actually buying provers. They're outsourcing to AWS or any of these internet cloud providers. So there's additional costs that need to be considered there. There's also additional incomes. I'm going to get to those in a second. So, again, I guess we're in a situation where maybe, okay, someone says your income minus expenditure is bad. Someone else says it's not actually that bad. And really everyone is looking at this in sort of a quite imprecise model. And we're not actually able to consider all of the incomes and all of the expenditures. And I guess you can see that we're shooting from the hip a little bit. But these metrics do provide us with some indication of how things are changing, right? If they're getting bad, if they're getting really bad, or if this really is something unsustainable. And in that sort of early stages for Tyco, that was an unsustainable model, but it is getting better. And that's the key. So again, setting the table. This is the fourth slide that's setting the table. I was struggling for titles. So thanks to roll-up competition, base users can migrate easily between rollups that have similar network effects. Network effects are a key part of why users will stay on a rollup today, or base rollup today. But base rollups, the warm fuzzy feeling that base rollups give us is that they're actually very connected with L1 and other base rollups. This network effect is actually potentially strongest, like shared between all base rollups. So the individual rollups don't actually have much network effect. So base rollups, sorry users on base rollups actually have basically not much switching costs between base rollups. So in this setting the provider profits, so the providers I mentioned were the provers, the sequencers and the DAO. In this setting, the hypothesis that I'm claiming is that these profits of all these people must tend to zero. Because it's easy for another base rollup to come along, replicate all of the functionality that exists in that base rollup and basically just remove some of those overheads that the previous one was that the profits, sorry, the overheads, that base roll-up was trying to generate. But this zero-profit paradigm is far away. There's still a lot, because of all this haziness, because of this wild west that we're in, it's still possible that provers and sequencers can actually be making money. But this is going to be a long road, and we're going to get there incrementally. And again, depending on how you look at the road, like income is tending towards expenditure. You can see that as a bad thing, but you can also see it as a good thing, right? Especially in the case of Tyco. Tyco was when they initially launched where the expenditure was really greater than income. Getting it close to income and maybe even getting it past income is definitely a good thing. So how you look at these things is very important. Okay, so on this path to the endgame, this zero-profit endgame, there is going to be increases in income and there's going to be decreases in expenditure. The format is supposed to be decreases in expenditure. A little bit on a theme with Kevin's talk earlier on, but not like a HD video, so with music. So anyway, as we shed some of the technical debt or shed some of the inefficiencies of early stage based rollups, we're going to decrease the expenditure and we're also going to come up with new ways to increase the income. And yeah, basically that's the summary of the sentence at the bottom. Okay, so here's the list, right? So there's no real model as such, right? It's just a list. You have to basically sum up all of these peak components that you have in your base roll-up and check is the left-hand side greater than the right-hand side. And again, there's multiple players in the system. So when we're thinking of a base roll-up revenue, we have to look at it player by player. So the users have this warm, fuzzy UX or utility that's hard to quantify, but they pay very quantifiable fees. But we just need to make sure that there is still some utility that these users are getting. And if they stop paying fees, then we probably have the question, are we charging too much? Or are we actually generating any benefit to the users? Proposers. The proposers have relatively straightforward costs as well. They collect fees. They generate MEV or they execute MEV. They also potentially collect issuance. Issuance is a contentious debate in terms of who's paying and who's receiving. But L2s can, or base roll-ups can create a token and issue it to the proposers. And the costs are L1 posting and running costs. Provers, again, they can collect fees as well, issuance as well. But they have another cost, which is the setup, which is quite a little bit more significant than a proposer, because ZK-Provers are pretty significant pieces of machinery. The DAO actually does have a unique income source, which is investors. So when Base Rollup launches, you'll see that there might be a seed round or multiple seed rounds. And that revenue, that investment does pay for a lot of the upfront costs, which, again, you see the approvers and potentially the proposers. When you don't know what the fees are going to be, you do need some money in the bank to sort of get things rolling. And that's what sort of Tyco were doing at the start, right? And that makes sense. You need to get the users, create the utility, make sure that the UX isn't too bad, and then you start to generate the fees. And potentially the DAO can recuperate those losses for the investors. But the DAO also has significant... I also mentioned proposal fee. Proposal fee is sort of a more complex topic, but it is possible that the DAO can be collecting money from actually charging proposers on L1 for the right to be a proposer. But that's not going to be a focus today. The DAO is important, though, because the DAO does have to pay for things like R&D. We can't keep depending on the Ethereum Foundation for funding. We have to sort of go beyond that, especially when we're trying to create base roll-ups sort of parallel to the Ethereum ecosystem. So some R&D money does need to be generated and that comes out of the DAO. And there's also governance, running costs of the DAO. And then we have these old chains and roll-ups. So what do they actually mean? When these old roll-ups compose with the base roll-up, that could be seen as income, right? You're creating UX, you're creating improved utility for users. And that can allow you to charge more fees. But similarly, they also create competition. And with competition comes sort of tighter profit margins. So is income greater than expenditure? I've already sort of touched on why it should be. But in general, if it's not, you can pack your suitcase and you can go to some other ecosystem, some other roll-up. The proposers is an expectancy, yes, it should be, right? We can see that there is new technology coming along, and there's probably going to be more, where proposers may not actually be profitable in the short term because they may commit to offering pre-confirmations, for example. And if you offer a pre-confirmation too cheaply, it may be significantly more expensive to renege on that pre-confirmation than just posting it at a small loss on the L1. The prover in expectancy and long term, yes. But again, it may be a substantial cost to pay for proving hardware. So the prover must invest and see that there is a substantial chance of return. And the DAO, again, I mentioned this investment model, long-term is not sustainable. So they need to be investing in, I guess, sustainable infrastructure for these fee mechanisms, these proposer fees, these sequencer fees. And we're yet to see what that's going to look like. But it's definitely going to look like but it's definitely very interesting if the dev can actually recuperate those costs. Okay so the costs right now are relatively straightforward but our hope considering the sort of the type profit margins from Tyco is that these will change right so I quote this sort of ancient philosopher, or alter ego philosopher, who says, based income and expenditure is always in flux. You can't step into the same best based revenue model twice. What that means is that depending on the day, like as obviously today, when I go to the toilet, I hear people talking about what the markets are doing. Like, revenue is changing all the time, right? The fees are changing all the time, but also the technology is changing all the time. So when we think about the base revenue model, we need to have a dynamic framework for thinking about these things. And that's sort of going to be the focus next. So here are some of the big changes to base revenue that I expect to see in the near future. We're going to see cheaper L1 costs. We're going to see proving becoming more efficient. We're going to see prover and builder markets maturing. So a lot of L2s, base rops, will run their own prover. But there's whispers about prover markets and potentially also builder markets, right? So builders and L1 are generating revenue for the proposers, and that's probably going to happen as well on base rollups as well. So that's going to be an income source for proposers. And shared everything, okay? So I mentioned this composition, but it's definitely going to be a significant area for income and reduced expenditure. So with shared resources or shared blog space, shared proving, we're going to get bigger network effects, we're going to get better utilization of the resources that we're using, but we may also have higher costs, right? So how are we going to balance these things is going to be very interesting. So let's go through each one in a little bit of detail. I'm running out of time. Okay, so cheaper L1 costs, right? So EAP-484-4 was relatively straightforward. You just have this sort of temporary data that's being posted to L1 and it makes it cheaper for L2s to post data to L1. And then we're seeing proposals like PeerDAS. I don't really know what it is but I hear it's going to reduce cost significantly. But it uses some pretty significant sampling, or it's pretty high-tech sampling procedures. You can check out Vitalik's recent blog post for more information. Zika proofs becoming more efficient. This is a bet. I can't speak from personal experience with Zika proofs. I don't have any. But, again, we're constantly seeing cheaper proof generation and cheaper proof verification. We're also seeing increasingly bad naming terminology. But again, it looks like they're getting better. So the worse the names get, the better we're going to see these proofs becoming. And we're seeing also more and more investment, more and more teams deploying people to ZK. So I expect this to continue. A market that I saw this morning but again it's been taken down, no one's trading on this thing. So the prover and builder market maturing, I mentioned this already. So Uncle Ben mentions that with great competition comes efficient pricing and innovation. And again, that's just what we're seeing on L1, and we expect to see that on L2 as well. So proof of competition, user and sequencers have to pay less fees. And build a competition, we're going to get better UX through more efficient block building, and the sequencers are going to get higher fees. And then shared everything, right? So with shared sequencing comes more MVV, more users, and we're going to get higher fees. And then shared everything. So with shared sequencing comes more MVV, more users, and we're going to get higher fees. We're going to be able to charge higher fees. So this is again increasing the income of the providers in our system. Shared blobs, so right now Tyco is creating their own blobs. If you can share your blobs you can get approximately 100% blob utilization. So you're no longer paying fixed cost, but you're now getting 100% utilization. You're able to claw back some of the costs that you're paying. Share approving, we're going to get economies of scale and cheaper L1 verification. So again, these are all sort of things that you're trying to do as a provider to increase your bottom line. Also improve your bottom line. And composability. So less risk and complexity for proposers. You no longer have to use someone like a cross. You can just basically sign a transaction that interacts with a shared smart contract. And pre-comps. That's a big area of efficiency. It'll reduce the cost that we'd expect to see. And improved UX. That will definitely improve the revenue model for base rollups. But it's also going to increase expenses, right? So there's definitely a greater cost for sequencing two rollups together than sequencing both of them independently. Just because of the increased search base, the greater amount of MEV opportunities that exist. Shared proving, again, similar concept. As far as I understand, proving two states together is more expensive than proving two individually. But the big question will be, are some of the benefits greater than the increase in proving costs? We're only going to see that when we see what the results of this R&D are. But we definitely are optimistic that we can get these ZK proving costs low and the utility from shared sequencing high. And centralization, I guess that's sort of a tough one to quantify, but it's definitely a significant risk and risks are effects risks or costs in our revenue model So centralization poses a risk and we need to be conscious that all of these shared things will add the centralization risks So conclusion when you're thinking about the revenue model for your best roll-up You want to you want to basically get taught up all of your incomes take away all of your expenditures and ask yourself Why am I playing this if I'm losing, and how can I play more of this if I'm winning? Base heroes assemble. So again, do your own calculations, and innovate on increasing income and reducing expenses. So remember, heretical strike. You can't step into the same base revenue model twice, so we want to see less trickles and more waves crashing, all right? So thanks very much. And yeah, appreciate your time. All right, great talk, Connor. I'm just going to direct you to stand over here for the QA. Yeah, this one will be good. Alright, so we do have a few questions. Let's go from the most voted question. How can we reconciliate revenue models with the decentralization of ZKP roll-ups where multiple sequencers and validators will need to be compensated. Did the person that wrote this question, did they explain what they mean by reconciliate? Yeah. Sorry. Can we get a mic to that person? Okay. We can go to the next question while we're waiting. Maybe I can touch on my interpretation of the question. In the case of current roll-ups where we have a centralized sequencer and a centralized prover, it's still not clear if the incomes are greater than expenditures. Okay, but yeah, we have the mic now. Let's go. Essentially, how do we... As there's a risk of fees increasing with higher number of validators in L2ZK roll-ups. What are the risks of that making the situation more unsustainable and what are ways in which we can address that? Well, the good thing about base roll-ups specifically is that we don't have any validators to pay. It's just the L1 proposer. Now, in terms of the multiple approvers that may exist, we're basically going to be creating a market, right? And it's a bit like Bitcoin and some of the old arguments for Bitcoin where you're like, okay, well, I have my hash rate and I have the expected Bitcoin rewards. And if I'm losing money there, I can go to Bitcoin Cash or I can go to the alternative blockchain. The same applies to any of these approval markets. So if it becomes too expensive, users will stop paying for it and basically you're going to have to spread out your costs or just wait until things become cheap again. So there's definitely a risk in a fully decentralized system. Yes, we're going to be exposed to these things being too expensive. So the only thing we can do is try and make sure that we have fallbacks like maybe cheaper fallbacks in the case that those things we are very exposed to fluctuations but I think pre-confirmations and things like this that allow us to wait maybe 16 blocks or 32 blocks, L1 blocks, where we get to sort of pick and choose where we include things and maybe pick and choose which provers to pay, that can maybe help to reduce the risk to maybe spikes, let's say. But not sure if that answered your question, sorry. We do have around two minutes for another question. Which one would you like to take, Connor? I'll go for the shorter one first. If the base rollup has a sustainable and positive revenue, can it become a de facto design for the layer one? Well, I guess so, right? At some point, if there is one base rollup that is taking up all of the L1 block space, that is a theoretical possibility with base rollups, that all the computation is being done off-chain on the base rollup. So in that sense, it could be doing all of the execution for the L1, but I'm not sure if it can actually replace the L1. Because it is still being sequenced by the L1. All right. Do you want to answer another one? Okay. I'll go for the short one. What is the plan to increase the income, but with the scale the expenditure also increases? Yeah, that is a tricky one. So it's like, again, we have to take a bet, right? And we're looking at the fact that a lot of people like Flashbots, like all of the ZK teams that I mentioned, they're playing ahead with improved mechanism design or improved proving systems, improved mechanism design, regardless of, let's say, any specific endgame that may be likely. They're trying to make things cheaper. And if things do become incredibly expensive with scale, we can always scale back. There will definitely be a limit to the amount of things that we can merge, the amount of state that we can merge. But right now, we can see that single roll-ups can survive. And then it's just a case of how can we actually just scale up the merging of all this state and that's definitely going to be a really interesting question. But we can always scale back, that's the key. Alright, cool. So we're right on time. Thank you so much, Connor.",
  "eventId": "devcon-7",
  "slot_start": 1731402000000,
  "slot_end": 1731403800000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1RyOkM2nzZPnG9r_QZgUBb98ZHMt2VtBlxR0avT7eWHA",
  "resources_slides": "https://drive.google.com/file/d/1QCcwQBW0aLVnC2JVdxUdjx7Bpe55d-XC/view",
  "speakers": [
    "conor-mcmenamin"
  ]
}