{
  "id": "activation-in-crypto-how-crypto-apps-go-mainstream",
  "sourceId": "AER7HZ",
  "title": "Activation in crypto -- how crypto apps go mainstream!",
  "description": "In this talk, I'll break down patterns I am seeing having helped onboard 10M+ users to crypto apps. From natives to newcomers, what are the factors that lead to onchain activity and sticky usage in consumer apps. I'll work through the few things that native apps do to onboard mainstream users onchain and how this impacts protocol development moving forward.",
  "track": "Usability",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Product-market fit",
    "UI/UX",
    "Account Abstraction",
    "Accessibility",
    "application",
    "Accessibility",
    "Account Abstraction",
    "Product-market fit",
    "UI/UX"
  ],
  "keywords": [
    "Applications"
  ],
  "duration": 1312,
  "language": "en",
  "sources_swarmHash": "eafe67bc05d6200b28b44f89b7ea7abeef97f93ac358c751f33a9847713e7fd2",
  "sources_youtubeId": "xXziS8KbI1k",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735e3479dbb7a90e1585aec",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735e3479dbb7a90e1585aec.vtt",
  "transcript_text": " Hello everyone. Thank you for coming to our talk on how crypto goes mainstream. It's a topic that's very near and dear to our heart. I work at Privy. And Privy is an easy and powerful way for crypto products to onboard their users. And Privy powers many of the most popular crypto apps, from trading apps like Hyperliquid and Pumped Up Fun, to restaurant loyalty projects like Blackbird, to social apps like Zora and Frentech. And so from supporting many of the most popular consumer teams, we've gotten a really good lens into what makes a great consumer crypto product. And it's really exciting at this DevCon to hear how many people are talking about consumers and apps. And one of the things I've seen a lot on Twitter is people saying, where are the apps? And how are we going to get more users on chain? And this is a problem we think about a ton. And at Privy, we actually, I'll tell you a little bit about what we're going to talk about first, and then we'll dive into it. So we're going to talk about the changes in our market, like why as an industry we've gone from, you know, not giving much airtime to consumer to it being something that everyone is referencing and talking about. We're going to talk about the crossroads we're in and why we're starting to see a really exciting acceleration in the crypto market. We're going to talk about what great looks like in consumer. So what some of the qualities of the most popular consumer apps will look like. We're going to talk about where we go from here, how we're going to get every consumer product on chain over time. At Privy, we talk a lot about, you know, what will it take for a consumer product to break out? And new tech often needs to power experiences that are orders of magnitude better than the status quo. And so to use an internet analogy, like if you were building a new internet, if you built something that's better than dial-up, you know, that's not going to cut it because now we have fiber. And so with consumer, you know, we need to build something that's, you know, a better experience, a more compelling experience than something like Uber or Facebook or TikTok in order to get, you know, everyone to start using it. And to us, there are three things that we get from building on crypto rails that, you know, are impossible if you're building off-chain. The first is, you know, this idea of ownership. The assets that you're accumulating in your app are yours. You can get kind of shut off from the app, but you still have the assets that you're accumulating in your app are yours. You can get kind of shut off from the app, but you still have the assets that you've earned and you can take them with you, which is related to the second point around interoperability. By building on a blockchain, you can take your assets experiences with you from app to app. So you can mint an NFT on Zora and then go sell it on OpenSea or any other NFT marketplace. And the third is around payment. So crypto offers a digital first instant payment layer, which is a really exciting new capability that's not possible off-chain. Historically getting that combination of attributes in a product required using something like this, MetaMask. It accomplished, you know, everything that crypto enables really well, but it requires you to be very familiar with crypto. And if, you know, you don't care about crypto or you're not willing to go through the hoops to set up, you know, your crypto life, this might be too daunting to you. And it's been a big reason why many crypto apps haven't been able to cater to people who don't know much about crypto. And a lot of the first popular crypto app experiences powered by these external wallets, they looked like this. They were great for discrete one-time user experiences, come in, do a financial transaction, get what you need, leave, and then, you know, come back when you need to do your next financial transaction. But they weren't well set up for multi-session user journeys. And the tech stack has come a very long way to enable these richer consumer experiences. So, you know, a lot of the time we talk about, like, what are the barriers to consumer products really breaking out on crypto rails. And there's sort of like a lot of the UX around making crypto apps easy to use. There's scalability, cheap, fast, reliable blockchains. And then there are kind of elements around the transaction experience and making that easier. And for the first time, we have a tech stack that kind of combining all of these attributes allows us to build great consumer experiences. And as a result, we've seen the market evolve quite a bit. So we've gone from, you know, here we're highlighting, you know, what we see as like kind of the most popular, most visible consumer products, consumer crypto products of the year, starting with, you know, financial one-time DeFi use cases to much kind of broader DeFi use cases to bringing art and culture on chain to gaming, to social interactions, and now having a full social layer. And, you know, now we're starting to see these more kind of rich consumer product experiences. But we're at a crossroads. So we have kind of everything we need to build a great consumer experience. But we're not at the point where every app we're using is on crypto rails. And so the question we ask a lot at Prithee is what will it take for that to happen? And we see two trends that are both very exciting, that are both accelerating a ton right now, that we think will unlock the next wave of crypto products for consumers. The first trend is crypto native apps. So products that are built on crypto rails, the crypto infrastructure is very much core to, you know, the product experience that are going after a mainstream audience that are trying to really hide abstract a lot of the crypto mechanics away from users. But crypto is like fundamental to the product from the outset. So one of the most visible examples of this right now is Polymarket, which is a product built on crypto rails, but has attracted orders of magnitude more users than the kind of core crypto native population. And, you know, OpenSea accomplished this. Blackbird, the restaurant loyalty app is accomplishing this. Pump.fun is accomplishing this. And the number of crypto products, you know, that are crypto native, crypto from the outset that are catering to a broader audience is accelerating a lot. And this is one trend that we think is going to continue accelerating. And we break down kind of like there are four common attributes a lot of these experiences have. The first is that they're engaging. Like they're experiences that people want to use and come back to and participate in. So whether that is something like Zora where you can consume content, you can like content as a creator, you get rewarded for posting content, to games like Friend Pet, to Receipts, which is a fun competitive fitness app on chain, we're seeing the baseline of just a fun experience that people want to engage with again and again as the most common attribute for crypto-native products that are breaking out into a broader audience. The second, and one that's very close to home for us at Prithee, is UX for everyone. Even though it is a crypto experience at its core, it is friendly and familiar to people who know absolutely nothing about crypto. Whether it's what we have on the left with Pirate Nation, which is one of the most popular crypto games, which allows users to sign in with Google login or Discord and get a fully self-custodial powerful wallet under the hood that could do anything you need it to on-chain. To Anime, which is a fun ecosystem of experiences centered around anime where you could sign up and start collecting on-chain assets, but you have no idea that anything you're interacting with is crypto, to B3, who implemented an experience we call guest mode, where you can get a wallet without actually creating an account, which is an experience that's familiar to people who shop online, for example, and aren't going to create an account in order to purchase something. You know, a lot of the UX elements of these apps are accessible for people who don't know anything about crypto. The next is real-world tie-in. So a lot of the most popular apps we see are manifesting in the real world in different ways. So whether that's Blackbird, who has many of the most popular restaurants in New York, there are physical pucks at the restaurant that you can tap your phone to, to earn rewards points that you could redeem to either pay your bill or get a free drink at the restaurant, to seeing on-chain assets in Walmart and Target, as the Pudgy Penguins team is accomplishing. Showing on-chain assets in the real world is another very common element for apps that are breaking out. And then the last piece is around account funding and getting people to transact on chain without taking them through the multi-step journey of getting crypto assets. So we have a video here of one of our customers, Rodeo, who has a really nice Apple Pay funding flow where you can, you know, purchase a balance that allows you to mint NFTs in the Rodeo app using Apple Pay. And, you know, once you have your credits as they're framing it here, you could just go and collect the asset and it feels familiar and leverages, you know, payment methods you're already familiar with. So those are some of the attributes of these crypto native experiences that are targeting mainstream users. And then there's this parallel trend of products that were built without crypto in mind that are leveraging crypto infra to accomplish things that wouldn't have been possible without it. And this is one of the most exciting things we're seeing at Privy right now. And it's accelerating a ton, where many, many fintechs, in particular, are starting to leverage crypto for payment rail benefits. And we'll get into some of the other attributes. But this is this parallel trend, where these products already have a ton of reach. They have tens, hundreds of millions of users. And they're giving them access to crypto rails. And the attributes that a lot of these projects have in common are, one, they're looking to use crypto rails to give users access to USD balance. So this is a product, Dolar. They're one of the most popular neobanks in Latin America. And they're using crypto infra to give people in Mexico and Argentina access to USD balance. But you would never know there's a trace of crypto infra in the app. It just feels like you have a dollar balance. You can earn your paycheck in USD, which is a great store of value, and then spend it with a card attached to the account anywhere. You know, merchants accept card. So that's a really cool trend we're seeing. Another is that mainstream apps are starting to use crypto as just a more efficient payment in rail. So this is an announcement from Deal, the payroll company, which allows any contractor on the platform to accept their payroll in USDC. And so not only are contractors getting faster access to the payment, but they're not dealing with a lot of the big FX hits you take on both sides of the transaction. If you were converting from payment in USD to a foreign currency, you know, take a pretty big fee on the FX conversion. So that's a really exciting trend as well. And then the last trend we're seeing with mainstream products and experiences building on crypto rails is some of the interoperability benefits you get from building on-chain. So earlier this year at Coachella, users who had specific assets that they bought on OpenSea could then go onto the Coachella website and link the same wallet they used to buy the assets on OpenSea and unlock VIP passes. And there was a special section of the Coachella venue where users could go and, you know, get access if they had this NFT in their wallet. And this is like a very early example of some of the cross-app experiences where users can take history or purchases they've made in one crypto app or one thing on chain and unlock things completely elsewhere. So the two trends that we're really excited about that we think will unlock the next wave of crypto usage are one, you know, these very kind of crypto deliberate products that are finding ways to attract mainstream user base with Polymarket as like a great example of this. We think that's going to continue accelerating. And then on the other hand, you have all of these products, fintech and largely fintech, but over time we expect many more that are looking to build on crypto rails to unlock some of the interoperability and payment benefits you get. And in our view, these are moment-in-time distinctions. Eventually, you know, we're just going to talk about crypto as an enabling technology that products build on. And so this, you know, crypto native versus mainstream product is a very moment in time distinction. We think, you know, these two trends will converge and everyone will start building on crypto rails in order to access the things you get that make crypto special. We think kind of as that plays out, it's important to keep your focus on the things we get from crypto and what we're all building toward and not concern ourselves with, okay, I believe crypto needs to evolve in whether it's this chain or this user base or that user base. And just really focus on what are the unique benefits we get from building on crypto rails. And the last thing we'll leave with is we really believe there's never been a better time to be building products on chain. You have all of the infrastructure coming together. You have all of the energy behind crypto, the visibility we're getting as a market. And we're really excited to see the next wave of products that come. So thank you all very much for the time. And if there are any questions, happy to take them. Thanks, Max. I hope everyone took some notes on how to build a popular product. So without further ado, let's go talk about some of the questions. So we can look right here. The first one is, what is an example of a popular feature that drove massive adoption for a project? Yeah. One of the most kind of novel things we saw in a product since starting Privy was how FriendTech really leaned into an existing social graph to make the first time user experience a much richer experience. You had a bootstrapped, so to rewind for a second, FriendTech, when you signed up, asked users to link their Twitter accounts. And then there was a populated social graph and, you know, users that you were familiar with. And that kind of immediately gave the app experience some more life. You had kind of friends and recognizable faces on the app. And I think that is one of the patterns that that team introduced that, you know, we still see everywhere today that made for a much richer experience. Agreed. So the next one would be why is most WebTree adoption focused on speculative platform like PolyMarkets or M or meme coin? Is the trend overshadowed the development of real world utility in the web3 space? Yeah, well because the crypto rails make for easy transaction experiences, you know, facilitating whether it's trades or bets, is like a very kind of easy to stand up use case. We have a framing at Privy where there's sort of, we call it the carrot and the stick. And up until very recently, because the UX around crypto experiences was a bit tougher. It was a bit kind of more hoops to jump through to get up and running in the app. Apps needed to incentivize, you know, why should I use this app with a little bit more of a carrot, whether that's like speculation or yields to get the user to drum through the hoops. And we think as the UX improves, you can have less speculative use cases because it's the same reason why I would get up and start using any product. I can just kind of use the crypto product and enjoy whatever the real world experience is behind it. Okay. So the next one is the trade-offs required to enable UX things. Like Google login wallet seems to stretch the definition of non-custodial. Is it really non-custodial if I need to log in through a specific provider? Yeah. So this one gets a little bit into into the mechanics of how Privy works. But when a user creates a wallet with Privy, we split the user's private key into different shares. And they're assembled in a way that neither Privy nor the customer we're working with has the ability to access the user's private key. The user is the only party that can actually assemble the key on their device and control the wallet. And so even though Google is the sign-in method, the auth link is only one out of the three shares that we split the key into. And so, you know, that doesn't kind of make the wallet experience custodial. Okay. So we have time for one last question. This is a pretty interesting one as well. What's the industry that you think will onboard the most users on chain in the next five years? Yeah. We're really excited about what we're seeing in the fintech and payments market. So seeing, you know, all of these neobanks really starting to lean into crypto payment rails to give users access to USD, faster, cheaper payments, you know, potentially better financial products over time. we think that's a really powerful driver of adoption. And if every banking product over the next five years somehow incorporates a crypto payment rail and gets their users' wallets, that's a really massive tailwind for usage in the market. Thanks, Max. Can we give him a round of applause for the insightful conversation they had? Stay tuned. We'll be right back at 3 p.m. with the next session. All right. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731569400000,
  "slot_end": 1731571200000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1a_SQ9DL-TDG33A44nSJ53matpwEz98lEvSg24o-XKA8",
  "resources_slides": "https://api.devcon.org/data/slides/devcon-7/activation-in-crypto-how-crypto-apps-go-mainstream.pdf",
  "speakers": [
    "max-segall"
  ]
}