{
  "id": "are-l2s-extractive-to-ethereum",
  "sourceId": "ESERNB",
  "title": "Are L2s extractive to Ethereum?",
  "description": "An in depth study of on chain metrics, fee markets, contracts, and wallets to answer if L2s are extractive to Ethereum",
  "track": "Layer 2",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Layer 2s",
    "User Research",
    "Transaction fees mechanisms",
    "debunking",
    "Layer 2s",
    "Transaction fees mechanisms",
    "User Research"
  ],
  "keywords": [
    "debunking"
  ],
  "duration": 1363,
  "language": "en",
  "sources_swarmHash": "b5b977302068601225e40569ffc8d69c685132a70133de755774793111af393f",
  "sources_youtubeId": "TP6roml9JTA",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6733fcc13a168eb53547f781",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6733fcc13a168eb53547f781.vtt",
  "transcript_text": " Cool. Thanks for coming. I know it's been a long day. Today I'll be talking about the topic of RL2s extractive to Ethereum? My talk, I'm going to cover three main areas. The first is on the topic of L2s keeping fees and not paying enough for blobs. This is quite a nuanced topic and I'm going to dive into it. The second, what I think is a more important question is, are L2s generating ETH-denominated activity in terms of ETH being used as a gas token, ETH being used as an asset, and has it generated new holders of ETH? And I think the third topic that I'm going to touch on is, what is the dynamic between L2s and Ethereum? So if you go on crypto Twitter, if you read forums, blog posts, et cetera, one of the most popular narratives is L2s are keeping the fees that they're generating and they're not paying enough for blobs. And you can kind of see this when you look at the margins for layer 2s post-EIP-4844, going from 20% to 30% margin on fees to upwards of 99.99%. But I think the nuance behind this is that blobs are still in the cold start period. And what that means is that it is a byproduct of the mechanism of 4844. And David Krapis predicted the cold start problem actually last year. And he ran a simulation from March 2023 using assumptions from the transaction volume on Arbitrum and Optimism at that time. And it would take roughly 250 kilobytes per block to get into price discovery for block pricing. That's roughly 1.8 gigabytes per day. And in some of the later charts, what I'll show you is that we're basically there on average per day, but not yet on a block-by-block basis. And actually, there have been some notable periods when blob pricing has gone into price discovery. This is an example from earlier this year, which shows the blob fee breakdown between blob space fees and execution fees during the layer zero airdrop. And you can see that for a period of roughly one to two hours, blob fees actually dominated compared to the execution fees. And actually, more recently, blobs have been getting really, really close to the target amount of blobs, past which the blob pricing would go into price discovery, and you would see this drastic increase in the cost of blobs faced by the L2s. But one of the interesting dynamics behind this is that layer twos are fundamentally businesses. And when you see a fee spike for blob pricing, we tend to see that layer twos actually start to slow down the pace that they post blobs in order to dodge these high spike moments. Another way to see this is through the distribution of blobs per block. So the gray color are blocks with no blobs. These blocks serve as a temporary buffer where, for instance, you might have a day where the total amount of data posted might imply that the blob fees should go into price discovery, but that mechanism is actually triggered on a block-by-block basis. But we're going from a world where half of the blocks had no blobs to a world where only 20 to 30% of the blocks have no blobs. And the same is true on a capacity basis. So in the summer of 2024, roughly 20 to 30% of the data capacity in terms of bytes was unused, and now we're approaching a period where only 10% to 20% is unused. And overall, Blob's inflow per day are quite healthy. They're actually well above the 1.8 gigabyte target, through which, if that were true block by block, Blob fee pricing would go into price discovery. So I think we're actually well on our way to that. So now that I covered some of the nuances behind the blob fee market, and that it's not necessarily a byproduct of the L2s not wanting to pay for blob storage. It's more that the way that the mechanism is designed is what is precipitating what we're seeing for the blob fees at the moment. So the you look at L2B and various block explorers, I'm sure everyone has seen a chart that looks something like this, where the L2 activity has grown tremendously over the past year, going from around 50 TPS up to 170, 180 TPS across the L2s. But L2's usage of ETH as a gas token has only grown modestly due to lower L1 settlement fees despite higher activity. That's partially contributing to things like lower burn, a lot of concern from the community. But again, this is more of a byproduct of the mechanism of 4844 and less about any nefarious intention. But I thought this chart was actually pretty interesting. So if you zoom out and you look at the collective fees in terms of ETH being used as a gas token, and you compare that to the gas fees used on mainnet, you can barely see the L2 line, which is great for users in that their transactions are quite cheap, but potentially some concern around the security of mainnet. On the flip side, the L2 usage of ETH as an asset has grown tremendously. So what we see here is a chart of the total value locked, stacked by type. The purple on top is the canonical bridged ETH. And that's just gone pretty much up only since L2's launched. So in summary, to cover the first half of the talk, in terms of the current state, there is not enough L2 blob demand to consistently get blob space into price discovery. That requires consistently block by block L2s consistently posting blobs in order to trigger the price discovery mechanism behind 4844. But I think we're almost there. Blob pricing today is currently in a bootstrapping period. It has shown periods of price discovery. This is known. It's been posted on the ETH research forums in 2023. There's nothing inherently wrong with the network or the way that the pricing is working. And it's actually approaching data inflow levels that would actually start to trigger and begin price discovery. And looking at activity on the L2s, we do see a lot of new usage of ETH as an asset in terms of being used in staking protocols and DeFi and et cetera, but very minor usage of ETH as a gas token relative to mainnet. So the second half of my talk, I'm going to talk about the dynamic between L2s and Ethereum. So, at the limit, L2s and mainnet appear symbiotic. Tim Robinson had a great post and he actually built this really great calculator where he shows that he's showing a scenario under which Ethereum, for Ethereum's blob market post-surge. So what this shows is a simulation for 10,000 TPS across L2s, which is pretty feasible and reasonable, I think. 16 megabytes of blobs per block, and that would imply a 6.5% yield on ETH given some reasonable user price sensitivity assumptions. So what that means is, is when the transaction fees go up, a smaller percentage of the L2 fees are very low, and we're in a period where we're probably most likely going to exit the bootstrapping period of block pricing, and we'll likely see a period where the L2 fees tick up. So, for example, in this scenario here, this uses the current specifications based on 4844. In this scenario, it assumes five roll-ups, 300 TPS per roll-up, the same user price sensitivity assumptions. And what you can see in this chart, and I think the interesting line to call out is the green line, which is the actual TPS. That reflects user sensitivity to higher transaction fees. And in my opinion, five roll-ups and 300 TPS, if you look at the number of projects kind of in the pipeline, that is pretty doable in terms of what we might expect to see over the next year. And what we can actually see in this chart is it implies that the Ethereum blob market could potentially serve as a constraining factor on the ability for these rollups to increase their throughput and increase activity. So in terms of the question, are L2s extractive? I think the question is actually very nuanced and is actually quite complicated. And I think the true answer is that we don't actually know. And I think there are three reasons for that. The first is the L1 settlement fees have never actually been high enough to test Ethereum's network effect. So what that means is we've never actually seen a scenario where L2s have been faced with increasing L1 settlement fees. So we're really uncertain about how the L2s might react in that type of scenario, whether they might look to an alternative DA solution, whether they might be forced to decrease their margins, whether they might potentially even become an L1 on their own. So I think that first scenario, we've never actually really seen that in practice. So we don't really want to impose that judgment upon the layer twos. So the second point is that there's a lot of value for L2s being L2s. And I think beyond just the label of what people might say, oh, like, I'm going to launch an L2 on top of Ethereum, what they actually get is quite a lot. So imagine having to write your own block explorer, your own virtual machine, your own smart contract programming language, recruiting developers to learn your smart contract developing language. And I think the reality is that the L2s are relatively new. And because they are relatively new, they benefit tremendously from being able to bootstrap their virtual machine tooling, developers, users, community assets from Ethereum, and even in terms of applications as well. And I think the third reason why we don't actually know whether L2s are extractive today is that most of the analysis, in terms of even Tim Robinson's dashboard, tends to assume that you have N equal-sized L2s, which one might consider the current state because we're kind of in this moment in time where there isn't a clear breakout L2 winner. And whether you look at TVL, whether you look at transactions, whether you look at number of wallets, whatever metric you look at, generally you tend to see fluctuating periods where you have three dominant L2s and they're all splitting market share at different points in time. And I think that type of analysis and thinking about the current state is probably not likely to hold into the future. So it doesn't really consider the case where you have one or two L2s that take 80 to 90% of activity and economic value, whereas the remainder have marginal economic activity. And I think this is actually a really important case and scenario to think through, because when you look at these financial networks, generally you do tend to see power law effects. And I think the scenario in which you have one or two very dominant L2s, the question about where does the market power and the leverage between the L2s and mainnet, at what point might that flip? And I think probably more work has to be done on that side. So in the final few minutes here, I want to talk about some of the hypothetical conditions where L2s could become more attractive. So the first is about if the L1 has limited transaction processing capability. And I think this is important because I think, first off, the economic situation of ETH, the asset, could become more risky if the amount of fees that are being generated on mainnet are not high enough to ensure that a large portion of the network ends up being staked. I think L2s also tend to benefit from highly developed financial system on the L1. And I think the second scenario, which I talked about a bit earlier, is the case where you have a power law effect for L2. So for example, a dominant L2 would be the majority blob purchaser. And with very clever batching, they could potentially pin blob pricing below price discovery. That's actually happening organically today. So if you look at how the L2s behave in periods where blob pricing does spike, we're already seeing behavior that suggests that they're willing to spread out how quickly they sync their state across time. And the consequence of that is that users who might want to look for a unilateral exit from the L2 might not be able to do that if the L2s are being more cautious and doing more optimization about how frequently they post. The next hypothetical scenario is a case where the incentive structures for L2 tokens or non-ETH gas tokens become more prominent. So if you look at the breakdown of activity on L2s and you look at the split between the L2s that are using ETH as a gas token and the L2s in quotation marks or L3s that aren't using ETH as a gas token, today that split is actually 50-50. So I think the notion that every single roll-up necessarily has to use ETH as a gas token, we're already seeing some scenarios in which that might not necessarily be the case. And I think that's related to one of these other points, which is the notion of a siloed L2 with their own settlement kingdoms for L3s or similar types of roll-ups. That's another scenario in which the L2s might push for an alternative gas token, which again would not benefit ETH as an asset. And I think the final point is potentially incentive structures for L2s in which they start to develop competing security models in terms of being able to use their native governance token for things other than just governance could potentially be a condition in which the L2s could also become more extractive. So that concludes my talk. I think it's still ultimately too early to tell in terms of whether the L2s are extractive or not. The reason for that is we've never actually seen a scenario in which the L2s have been put in a position to make a choice, whether they stay as an L2 or they use an Alt DA layer or they become an L1 or they do something else. But I think that time is actually coming very soon. So probably likely over the next one year, we'll start to see some of these choices being forced just by the nature of the blob fees going into price discovery. Thanks. All right. Thank you, Ren. Feel free to come to the center over here. Yeah, this one will be fine. So let's go over some questions. Let's start from the first one. Do you think the exact copy of EIP-1559 mechanism determining L1 fees is the right approach for determining blob fees? Yeah, I think this is a really tricky question. Yeah. I think this is a really tricky question. So I think where my mind jumps immediately is I look at the amount of execution that has been moved off from the L1 to the L2 and the amount of transactions on the L2 today greatly outweigh the amount of transactions ever in Ethereum's history in terms of like per second or per block. But in terms of ETH being used as a gas token for those transactions, it's actually quite minimal even compared to the earliest periods in Ethereum's history. So I think one of the things to consider is that that ratio might be slightly off. And I think the only way you really see that settle is blob pricing has to go into price discovery, which means there needs to be more L2s, and that will likely happen over the next year. Cool. And another question. Currently, the L2 mainnet seems symbiotic. But what if they started paying fees in their own tokens? They have a fair amount of incentive to keep assets logged in their system without interoperability. Yeah, I talked to this point in the last slide about hypothetical scenarios. So I think some of the highest forms of risk are exactly that. So, for example, L2s in their current state as having their tokens as a governance token, it's highly likely that's, it's probably more likely that changes in the future than stays the same. So I think that is a very real risk. Have you or others been able to isolate the decrease in L1 execution demand due to real transactions from the reduction in call data demand? Will L1 execution demand go to zero? So I don't think L1 execution demand will go to zero. So a chart that I didn't include just because it's a very basic chart, is that the number of transactions on Ethereum has actually not gone down. And the amount of gas, in terms of gas consumed, has not gone down. It's that the nature of the transactions have changed. So historically, the transactions on Ethereum had been transactions that had a lot more right conflict or right contention. And right contention leads to higher fees because people tend to be rushed in terms of those types of transactions. So for example, if people are trading various forms of assets, there's a high degree of urgency that those transactions land. But most of that activity, at the moment at least, has shifted to the L2s. Perfect. And how to prevent a single L2 from eating up all the space or spotlight, aka base, not from the tech perspective, but from the marketing public perspective? Yeah, so I don't necessarily want to call out a single L2, but I think the hypothetical scenario of an L2 becoming the dominant L2, where 80 to 90 percent of the economic activity flows through there, I think that's a very real risk. I don't believe there's been very many payment networks in the past where you haven't seen a monopoly or oligopoly type of structure just due to the nature of network effects in these types of financial systems. So I think that risk is very real. Perfect. And I think this is a great comment to close off the speech. Thank you so much.",
  "eventId": "devcon-7",
  "slot_start": 1731407400000,
  "slot_end": 1731409200000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1vwJxkmHD52YwdthsPLe4BX6pJ2iLQrw9Qqa8nA5c4cI",
  "resources_slides": null,
  "speakers": [
    "ren-crypto-fish"
  ]
}