{
  "id": "austin-griffith-intro-to-scaffold-eth-2-and-speedrunethereum",
  "sourceId": "MCVDPP",
  "title": "Austin Griffith –  Intro to Scaffold-ETH 2 and SpeedRunEthereum!",
  "description": "In this session, we’re going to dive into Scaffold-ETH v2, a toolkit we built to make developing on Ethereum way easier. We’ll take a look at how it works, why it’s super useful for quickly spinning up projects, and how we can use it to tinker with smart contracts and hook up the frontend. \r\n\r\n⚙️ Scaffold-ETH 2 is built using NextJS, RainbowKit, Foundry/Hardhat, Wagmi, Viem, and Typescript.\r\n\r\nWhether you’re new or experienced, we’ll get you to SpeedRunEthereum!",
  "track": "Developer Experience",
  "type": "Workshop",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Open Source Software",
    "Public good",
    "Tooling"
  ],
  "keywords": [
    "Developer",
    "onboarding"
  ],
  "duration": 5979,
  "language": "en",
  "sources_swarmHash": "9f682f049726c2298f59c88f7e57aad30cf83d73869108354243c000485f2aeb",
  "sources_youtubeId": "_VWF2fiXDPQ",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6733f0d63a168eb5353ce195.vtt",
  "transcript_text": " The so um Some small things with that. And then we're going to go through speedrun Ethereum and we're going to kind of just look at this curriculum and kind of talk through each of the like learning moments that you'll go through when you go through Speedrun Ethereum. So let's get started with Scaffold ETH first. Scaffold ETH is a dApp developer tool. It's great for tinkering with your smart contracts and it has this auto-adapting front end that is really nice when you're tinkering with your smart contracts. And it has this auto adapting front end that is really nice when you're tinkering around with your smart contracts. So I'm going to run this. What, DevCon 2? This will be my second demo today. Maybe we'll do Foundry this time. So Scaffold ETH is a DAP building tool, like I said. It uses Next.js, Rainbow Kit, Wagme, TypeScript, and you kind of have the choice between Hardhat or Foundry. It's a great tool for prototyping. You can quickly get something out the door. I think I deployed, earlier I deployed",
  "eventId": "devcon-7",
  "slot_start": 1731398400000,
  "slot_end": 1731405600000,
  "slot_roomId": "classroom-b",
  "resources_presentation": "https://docs.google.com/presentation/d/1obbj2bv-axqq0YxZpjvXmMW2LkNzMztiVyIBfdu3Z6Q",
  "resources_slides": null,
  "speakers": [
    "austin-griffith"
  ]
}