{
  "id": "beyond-technology-ethereum-as-the-philosophy",
  "sourceId": "TZV7RV",
  "title": "Beyond technology: Ethereum as the philosophy",
  "description": "In this talk, we dive into the philosophical foundations of Ethereum, bridging blockchain principles with ideas from ancient Greek philosophy to contemporary thought. We’ll unpack Ethereum's conceptual roots—shaped by cyberpunk, solarpunk, crypto-anarchism, technolibertarianism, and more—to reveal how each contributes to Ethereum’s vision of a reimagined society.",
  "track": "Cypherpunk & Privacy",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Values",
    "Solarpunk",
    "Ethereum for Good",
    "intellectual",
    "engagement",
    "Ethereum for Good",
    "Solarpunk",
    "Values"
  ],
  "keywords": [
    "philosophy",
    "technophilosophy",
    "intellectual engagement"
  ],
  "duration": 496,
  "language": "en",
  "sources_swarmHash": "e19f5fc32d1a5089d8018f712e7d0b670d892704a4a0f3fa9018d3fc5a719c62",
  "sources_youtubeId": "Wan90qeRCxA",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67349ada9dbb7a90e11d7cab",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67349ada9dbb7a90e11d7cab.vtt",
  "transcript_text": " Hello everyone, I'm Sasha and I'm here to talk about Ethereum not just as a technology but as a philosophy. During these few minutes we'll journey through the history of thought, exploring how ancient and modern ideas align with what Ethereum brings to our world today. But before we dive in, a quick disclaimer, as philosophical concepts I'll touch upon have been simplified, and the majority of philosophers will discuss never-before-seen blockchain, and linking their insights to Ethereum is quite an interpretive intellectual exercise. Well, we're all aware of how Ethereum is transforming our economy, society and governance, but its impact goes even deeper as Ethereum also challenges us to think about core philosophical dimensions from the nature of reality and truth to ethics and art. Ethereum Core extends beyond decentralization, programmability, and automation. It embraces resilience, open collaboration. It values inclusivity and sovereignty rooted in a vision of social economic freedom. Ethereum aspires to create a borderless network where innovation thrives and hierarchies dissolve. These fundamental principles resonate deeply with timeless ideas explored by philosophers across the history. Thus, philosophical concepts like decentralization and consensus appeared in Greek city-state or polis. Plato envisions them in his works. Also, trustlessness or parisian was another core idea, as well as privacy, with Aristotle's distinction between public, polis, and private oikos spheres. Furthermore, blockchain's mutability mirrors determinism and the medieval pursuit of eternal truth and decentralization feudal hierarchies. The Renaissance introduces a concept of security, an idea that became central to Ethereum's framework, and, for example, Giordano Bruno's idea about universe as a living organism may match the Ethereum's infinite garden metaphor. Early modern philosophy, spanning the Enlightenment and beyond, emphasizes reason, individual freedom, and skepticism toward traditional authority. Thinkers like Jean-Jacques Rousseau or John Locke championed personal liberty, autonomy and property rights. Also, this era focuses on industrialization, finding its modern reflection in smart contracts. As we progress through history, anarchism seen in Daoist and DeFi celebrates community-driven, intermediary free systems. ProDON's idea of industrial democracy and Kropotkin's mutual aid resonate here. As does libertarian socialism through Daoist that balance egalitarian P2P interactions with social justice initiatives like UBI. Pragmatist thinkers like John Dewey underscore cooperation and practical solutions, action-based outcomes. Contemporary philosophy brings fresh new perspectives. Thus, phenomenology, which emphasizes individual freedom, aligns with Ethereum's focus on personalized interactions. Then, emphasizing freedom, choice, and responsibility, existentialism matches with Ethereum, which enables autonomous decisions and accountability. Analytic philosophy in Wittgenstein's call for clarity echoes in Ethereum's language for secure exchanges. And of course, postmodernism, which critiques fixed hierarchies, resonates with Ethereum ethos. Worth noting that today's thinkers bring diverse perspectives on blockchain. Some like Zizek critique it while others acknowledge its transformative potential. Now I want to briefly talk about Ethereum's philosophy, philosophical DNA as I said. I believe, and I think many of us here believe, that Ethereum embodies a convergence of multiple philosophical movements which form its philosophical DNA, blending in many fascinating ways, starting from cyberpunk and cypherpunk, which sound similar, but each hold unique vision of freedom and autonomy. While cyberpunk imagines rebellion against centralization, cypherpunk provides the cryptographic tools for privacy. Other influences are cyber-utopianism, which sees technology as a path to democracy. It views Ethereum as a path to democracy. It views Ethereum as a tool for open, accessible systems... that empower individuals worldwide. And crypto-anarchism, which emphasizes privacy and autonomy... resisting state control through cryptography. Then, there is... Ethereum also draws on techno-libertarianism and posthumanism. In essence, the first highlights the theorem's role in personal autonomy, while the second envisions it as a transformative medium reshaping identity and community. Next are object-oriented ontology and defensive accelerationism. Object-oriented ontology is a part of a popular speculative realism movement. It views all entities, human and non-human, as equally significant. In this perspective, every block, smart contract, and code line on Ethereum has its own agency, acting within a flat network of relationships. And defensive accelerationism, as many of you know, supported by Vitalik Buterin, it calls for responsible tech progress, balancing innovation with ethical responsibility. Lastly, Solarpunk and Lunarpunk, they represent Ethereum's dual potential, sustainable open future alongside robust privacy-focused protections. Also, to further frame Ethereum as philosophy pluriverse, an ecosystem of diverse interconnected realities where multiple systems, cultures, and values coexist and interact. Then, epistemologically, Ethereum offers trustless knowledge, a paradigm where truth is verified collectively. Then, in terms of ethics, Ethereum introduces technetics. In terms of teleology, one of the goals of Ethereum is a tool for digital liberation. Mainly Ethereum isn't just a technology, it's a living philosophy, an experiment in rethinking trust and freedom, please invite us to ask what happens when the code carries our values and when autonomy, privacy, and decentralization become foundational. Together, we're shaping a new philosophical paradigm. Thank you. Thank you. Thank you so much, Sasha. That was great. I don't think we have time for Q&A, so thank you so much. And we've got about two minutes until our next...",
  "eventId": "devcon-7",
  "slot_start": 1731493200000,
  "slot_end": 1731493800000,
  "slot_roomId": "stage-6",
  "resources_presentation": "https://docs.google.com/presentation/d/1_ySmTRldIj5s-VJNLFK0CcREWHnRA9KeGMc5zS6taAk",
  "resources_slides": null,
  "speakers": [
    "sasha-shilina"
  ]
}