{
  "id": "biomes-mud-day-demo",
  "sourceId": "GGANKV",
  "title": "Biomes - MUD Day Demo",
  "description": "This is a project demo as part of the MUD Day CLS: autonomous worlds, onchain games, and non-financial applications.\r\n\r\nBiomes is growing the virtual world with the largest GDP. As a fully onchain 3D voxel world, every single action in Biomes -- mining, building, crafting, even moving -- is a transaction on the Redstone L2.",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Gaming",
    "Autonomous World",
    "Autonomous World",
    "Gaming"
  ],
  "keywords": [],
  "duration": 330,
  "language": "en",
  "sources_swarmHash": "5ebf0f6f2bdec9c8761b67e000f21af843089ccb91434362289f2ba85d3aca4d",
  "sources_youtubeId": "gp9jYC1tQWQ",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673586cf9dbb7a90e115c97d",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673586cf9dbb7a90e115c97d.vtt",
  "transcript_text": " Okay, it's working. So yeah, hey everyone, I'm Devani from Biomes, and I'll start again. So we believe a crazy new asset class enabled by digital matter and smart items will unlock autonomous worlds. So if you haven't heard about biomes, biomes feels and looks just like Minecraft with everything on chain for the first time ever. So not just assets but items, players, physics, all the actions, even movement is fully on chain and this is not on a testnet, it is live on Redstone, the L2 Ethereum main net, you can try today. So if I just, you know, I can move around in the world, I can WASD around, I can mine, I can build, I can craft. All the things you'd expect from Minecraft we have working, and it feels just like Minecraft. We almost parody UX. Okay, so then what's different? So the main thing that's different inside of the world is smart items. Smart items are basically items that have regular functionality in the game, like a chest where you can store items, take stuff out. But you can augment them with a smart contract. And now that item will behave based on the smart contract. So as a concrete example, we have a Uniswap-like chest, which is basically a chest with a Uniswap smart contract, which makes it so you can only take items in and out if you transfer tokens. And now you have basically like a third-party shop that behaves based on this smart contract. And the design space for these smart contracts is kind of vast because it's a regular smart contract that any player can write. So already since like offer release a couple weeks ago, we've seen a couple of smart items being created inside of the world. So I'll just go around the world and show you a couple. So the first one I mentioned was that Uniswap like smart item. And so this is one of the main bazaars in the game where people are buying and selling items. And as you can see, when I go up to a chest, I can't just take the items out. I still have to interact via this UI, which lets me pick how many wood I want to buy, which is the Sakura wood, which is this new rare wood, rare religion that's forming inside the community. And you can see it's giving me the current dynamic price for this wood. So now I'm going to go into spectator mode so I can fly around and show you a couple of more interesting smart items. So just beside this like main bazaar, one of the gaming guilds who's been playing actively has created their competitor bazaar right beside us. It's kind of like the shoosie swap of biomes. They have their own pricing and fee mechanism but they're doing a similar thing of buying and selling items using a chest. Now, you might ask, well, why can't I just mine this chest and take all the items? And that's because we have another smart items, which is a force field tower. And when you have a force field tower, you can, again, use a smart contract to control permissions for who can build and mine inside of your area. And the main thing to know is that compared to other decentralized projects where they have land sales for NFTs that control permissions, with biomes, you can't control the land forever. To control your land, you have to use this in-game item, which is the force field tower, and you have to charge it using batteries, which is another in-game item. And so all of these smart items function via batteries, and as long as the batteries charge, it will work, but players can rebel by damaging the battery and making the smart item no longer work. So just two other cool, very interesting smart items players have created. One of them is this sakura holy tree. So there's four kinds of wood in Biome, but one of them, which is the sakura wood, has become kind of memed and everyone sort of is rallying around it. And so this player wants to build this giant monument of the biggest sakura tree. But he needs a lot of sakura logs and they're hard to get. They take over a year to grow. And so he's created this chest where you donated 100 like Sakura logs, which he'll use to create this tree, and in return he mints you this like NFT, we call them passes inside of biomes, and this pass gates access to his, like to use all of the, like go inside of his buildings, all the events he's going to run, and so by donating your wood, you're sort of getting access to all of those things he's going to use in the future. In a similar sense, another gaming guild has created their own hotel where they sort of have beds and rent out for people to sleep inside. And to access it, to become a part of their guild, you have to get to their chest, and you have to, again, transfer a couple of items to get to their chest, and you have to, again, transfer a couple of items to get their pass, and once you have their pass, you can now access all of their things. The last thing I'll show is not a, like a pass, it is a pass, but it's not about just transferring items, but it's actually about parkour, because now we have, like, real-time movement, you can actually, oh, it's, the chunk itself is not loading. But over here, we have basically a place where players can play parkour. And when you get to the top of the parkour, you get to, again, mint a pass by interacting with a chest. And only players who get to the top can interact with it because that's where the actual chest is. And yeah, so that's pretty much it. We think smart items can birth an asset class enabled by and on the virtual world's physics. We have a talk later in the afternoon, so come by to hear more about it. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731555000000,
  "slot_end": 1731555300000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1DMxoqy08a2IwA26zMJNDXvac90qjFcdm4KPkNLwWrl0",
  "resources_slides": null,
  "speakers": [
    "dhrumil-shah",
    "dhvani-patel"
  ]
}