{
  "id": "bringing-an-open-music-protocol-into-the-real-world-onboarding-millions",
  "sourceId": "EJXTFL",
  "title": "Bringing an Open Music Protocol into The Real World: Onboarding Millions",
  "description": "Every month Audius serves millions of artists & fans and hundreds of millions of API requests while growing a fully-decentralized and fully-licensed open music protocol. This talk is about how we achieve real world usage where most users are non-crypto native in a complex industry full of legacy software systems, red tape, and multi-party complexity. It boils down to simplicity, choosing the right tech at the right time, and uniting Web2 and Web3 philosophies.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Sufficient decentralization",
    "Product-market fit",
    "User Experience",
    "adoption",
    "mass",
    "Product-market fit",
    "Sufficient decentralization",
    "User Experience"
  ],
  "keywords": [
    "Music",
    "Mass Adoption"
  ],
  "duration": 441,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "G-OP4yxs5VU",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67330a963a168eb535eccc2e.vtt",
  "transcript_text": " He asked me for a fun fact. I really do like mango sticky rice. It's awesome. Anyway, hey, I'm Ray. My talk is called Onboarding Millions. If you were just here for Dave's talk, this is going to be a very different vibe, but we're going to get down to brass tacks, and we're going to talk about how we onboard people into the web 3 ecosystem. My name is Ray. I'm the CTO at Tiki Labs which is one of the contributors to the Audius protocol. Is this on? Different slide. We went too far. Okay. All right. I would assume that most people here have seen these words written before. I certainly have. The Internet certainly has. And I think candidly the jury is a little bit out on like what actually is the killer use case for crypto. And this is my personal favorite. I'll leave it on the slide for a second if you want to read it. So I think that crypto can probably be all of these things, but we really need to focus on consumer. And we need to do it in a way that we really haven't been so far. So my presentation today, I want to talk to you in a few minutes about some of the pretty hot takes I have about the ecosystem and things that everyone who's in the consumer space really should be thinking about. Before I get into that, a little bit of background on what Audius is, just so you know that you can take my words to have some amount of weight. Audius is a decentralized music streaming service that's governed and operated by its community, Web3 music platform. Why are we doing this? We want to help artists and rights holders of music control their destiny online. And how do we do this? We're providing direct access between artists, labels, and their fans with really deep engagement tools and monetization tools to make it happen. At a quick glance, these are some of the stats. I'm really excited every time I show this slide because a lot of these numbers are really big, and I think there's some weight to some of the things that I'm going to share about how we've gotten to this point. So, hot take number one. I'm not going to spend a ton of time here. Let's call them apps. The term dApp is meaningless out there. Most people in the world are still using phones and browsers. I assume most people here are doing that. Until we have some radical new hardware, we should not be using terms that alienate Web2 users. Let's call them apps. Number two, emails are amazing. And I think we should try really hard to not reinvent things that we don't have to reinvent. We have so many hard problems to solve as this industry, but I think decentralized identity is not actually one of them that we need to spend that much more time on. This is our biggest competitor. Probably have seen this logo before. This is their signup form. It has one input field. Pretty much universally across the world, anyone who's using a computer knows what to do here. This is what we seem to have adopted. And if I'm a Web 2 user and I look at this, I have no idea what I'm looking at. I don't know what any of these words mean. I don't know what any of these logos are. And this is almost dead in the water from day one. What I'm proposing in this hot take is that emails are decentralized identity with billions of users and can be used to make really great Web3 native onboarding. And there are a lot of products out there that do this really well. We have our own home-rolled one. There are many people at this conference who are building things like this. So you can make something like this. And we've spent a lot of time trying to make our onboarding process as familiar as possible. Number three, sometimes fiat is okay. We should settle in crypto. We should let people custody their funds. We should provide sometimes fiat UX. Show balances in fiat where we can. We are in a transitionary period as an industry and we should meet users where they're at. So here's a quick case study from Audius. This is an artist named Kato. Kato on the track is what he goes by. He ran this remix competition on Audius where he listed things you can see here. It's in dollars and cents, $49.99. He made $30,000 in revenue in two weeks and not a single person who purchased this track was Web3 native. But behind the scenes, everything was settled in USDC. And the thing that I want to articulate here is that we can still get all of the perks of programmable money without users even knowing that they're on crypto. And that is an incredible use case for us. Number four, we should stop teaching users unnecessary things. Our users don't give a shit if we are an L1, L2 app chain, Kafka, Postgres, like whatever it is. Make the right technical decision weighing all of these things, but make a decision where you can build UX that doesn't have to explain this to your users at all. These are really important problems we should be solving, but they're not marketing copy. And if your signup flow has a user pick a chain, you're starting off on the wrong foot. Number five, and my last one, because I think my lightning talk is almost over. We should lean on some of the financial tools that we can that other people can't. We can do a lot more in Web 3 than in Web 2 because of the way we can do capital formation, the way that Web 2 users already expect many things to be free. We can put that on steroids and give all sorts of access that other people cannot do, this whole concept of the infinite garden. So really, you know, my pitch to you is that, you know, if we're going to onboard millions of users, we should build the best products, forgetting about Web 2, Web 3, whatever, build the best products. We have some of the strongest minds and technical people in all of technology here. If you're in, oh, my emoji didn't go, but if you're in consumer, your target audience is not here today. And we should really, really internalize that and think deeply about it. Thank you. I'll take Q&A. And if you are interested in talking about this more, please seek me out after. We also are running an event on Thursday if you like music and you want to talk to like-minded people too. Thanks. Awesome, Ray. Thank you so much. We have space for one question. Who's going to be the lucky one? There. Hi, my name is Nefertiti. I was signed to Universal for like too long. And I'm wondering, what's your motivation if you're not like rooted in music to create this type of platform for musicians uh rooted in music is my personal background or just in general why do people like you make these types of I want to go against Spotify totally yeah um you know I mean there's there's many stories we have of people that we've worked with who have like yourself signed deals sometimes that don't favor them. And ultimately, we want to give people the opportunity to choose. I myself am a musician. I grew up playing piano from a young age, played in a rock band in high school, never pursued music full time because I ended up liking software more. But I think the creative space is one of the ripe fruits to pick in this new wave of technology where there can be a lot of impact on ownership. And I think that's like the perfect marriage with something like music. Would love to talk more though. And a few folks from our team are here as well. Okay, thank you so much. Please give an applause to Ray. Appreciate it, man. Thank you. Thank you so much.",
  "eventId": "devcon-7",
  "slot_start": 1731392400000,
  "slot_end": 1731393000000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/1y9pSagBtZCT-PX46JT90ABDD2x8ACdZNVrHy2b9NaOQ",
  "resources_slides": null,
  "speakers": [
    "ray-jacobson"
  ]
}