{
  "id": "bringing-web2-users-onchain-picnics-case-study",
  "sourceId": "E7RSG7",
  "title": "Bringing web2 users onchain: Picnic’s case study",
  "description": "Account abstraction had mixed success so far. Some specific purpose apps have been getting great usage, but there is still little economic value being transacted using account abstraction and very low repeat usage.\r\n\r\nBy building Picnic, we discovered that account abstraction is currently much better suited to bring web2 users onchain than to cater for crypto natives. We'll share our learnings from the trenches and offer builders a fresh perspective on how to accelerate adoption.",
  "track": "Usability",
  "type": "Workshop",
  "expertise": "Intermediate",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Use Cases",
    "User Experience",
    "Account Abstraction",
    "adoption",
    "mass",
    "Account Abstraction",
    "Use Cases",
    "User Experience"
  ],
  "keywords": [
    "Onboarding",
    "Mass Adoption"
  ],
  "duration": 4074,
  "language": "en",
  "sources_swarmHash": "6c7a78a70d240767eb04e0e57d5e8c3f7bac563d03d06bef103a2698e8d2d1f8",
  "sources_youtubeId": "aKbsZkxeJNs",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673481849dbb7a90e1d0191d",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673481849dbb7a90e1d0191d.vtt",
  "transcript_text": " Hello everyone, great to be here. My first DevCon talk ever. So super excited you joined me. I'll be talking about a counter-protection. I have been building a DeFi consumer app in Brazil. It's called Picnic. We have been in the front lines trying to get Web2 users to be on-chain and execute transactions on-chain. And the idea here is to share what we learned. So who are we? Like, building consumer DeFi app, very focused in Brazil right now. We are seeing, like, really interesting feedback from users. So, like, when I go to conferences in Brazil and I meet people there, it's really nice to see that people really like the product Connect and see the vision and see the benefit in using day-to-day. And there's two metrics I really like about that. There's something called a Sean Ellis score. That is basically a form you send your users and you ask how disappointed you would be if you could not use the product anymore. 60% of users say they would be very disappointed, which is a compelling thing that people really care about what we're doing, and they're seeing really good repeat usage. So once a user swaps, there's a 57% chance the user will swap next month. So this is really good. We'll put that a bit into context, but it's a real-world use case that we have been seeing repeat usage. And on the DeFi front with account abstraction, we are doing really good volumes. So we're doing close to half the swap volumes using ERC-427 across the main EVM chains. And why did I decide to apply this talk and come here to bring what we have learned? I think we talk a lot about mass adoption, and though everyone needs to be on-chain, but I think that this is very vague and abstract. There is, I mean, at least on the talks I have been participating, there is not a whole lot of depth on how you actually do that like from the point we are at right now how do we evolve this thing to really get people to mass adopt it and use it day to day and as we are building something with like a few thousand users and we have been shipping, iterating and learning I thought it would be valuable to come here and share what we have been shipping, iterating, and learning. I thought it would be valuable to come here and share what we have been seeing. For who this talks, I think it would be valuable if everyone that's interested in mass adoption and getting the nuance on how to get there. It will be mostly focused in strategy and product is talking about what decisions we took, why we took them. So builders, people on ecosystems, VCs, I think everyone can see some value here. It should be pretty open, so if you have any questions at any point in time, just raise your hands. We can make Q&As and talk a bit and explore topics. I think they're very, I'll give a brief overview and we can deep dive on any specific topic we want to. I don't have, I have 50 slides or so, but I don't think it will be enough to cover all the time. So yeah, we have time for a Q&A. I think it will be very valuable. And to give you a sense on what we're covering, I'll start giving you an overview of the account abstraction landscape, kind of what's working, what's not. Then we'll talk a bit which kinds of users see the most value from this piece of technology and how should we approach the tool set we have, what's working best. Then we're going to picnic, trying to give a sense of product decisions, what worked, what didn't, and small tweaks we made that make a difference. We're going through some of our user research and then going after, like, what are problems we see today? How can we solve that? How is the roadmap for the future? Like, I think we learned some cool stuff, but there's a lot of work ahead. So on the account abstraction landscape, if I would summarize account abstraction in one slide, you basically get a bunch of different problems like authentication, gas, like teaching users that you need a specific token for a specific chain to pay for gas. I think that there's no way this thing will be mass adopted just because of that one thing. Seed phrase is another thing that doesn't make sense to have to teach someone about a seed phrase to be able to onboard it, right? People should just be able to use it and the thing should work. Same as chains and transactions, a proof swap, anything that gets a bit more complex is just too much work if you're talking with the average person. So account abstraction, it solves most of these issues or at least give you more options on things you can build. And the result of that, it should be usable by Web2 users. So account abstraction, I think that a fundamental promise is like you can break the bubble and you can make those products usable by a much wider audience. And it's growing. Like if you see the charts, most dashboards, you see things like this. So this is number of deployed smart accounts across the main EVM chains. Trend looks good. Not exponential, but still healthy. And it's kind of obvious it should grow. Like, you're making it easier to use. So if something is easier, people just use it more. But if you do some more detailed analysis and you look at individual projects, the trend is not usually that just make it easier and things will go. This kind of pattern that you see like spikes and things dying down, this is very, very common across this space. Not sure who has seen that, but this is retention rates for the whole account abstraction space. So like this is like 2% retention for the first week. The best one we have here in all ones is like 12%, which is reasonable. But most are four or three. It's really, really low retention. So for every 25 users you get, only one returns next week to do something. So there is this problem with repeat usage. And the main thing here is like, why this thing happening, right? Like why people are not coming back to do transactions next week? Why the value is not being sustained? And just to get a sense, who here is using account abstraction wallets on like a monthly basis? Okay, so five people. And who here is using wallets on a monthly basis? Yeah. And this is kind of my point. I think I don't use... I use Picnic, but it's a different use case. I don't even think about Picnic as a wallet. But account abstraction wallets are not a very good solution for Web3 native users. I think they are worse than YoA wallets for Web3 natives. The first one is you pay more gas. There is gas overhead to be able to use account abstraction wallets. Second thing is limited use cases. So if you want to deploy in a new chain, if the wallet provider you're using doesn't support that chain, like if you want to do that manually, maybe you can't. Maybe you can, but you need to be a developer. So it's this weird thing that you can't do whatever you used to do. You don't have that much freedom. There are steps that won't work with that. If you deploy it on zk-sync, you have a different address. So there's all those weird quirks that, yeah, it is worse in terms of use cases. And you also need to learn it. So like I spend a lot of time around smart contract wallets. I know how it works. I trust it. But if you talk even with the typical Web3 native user, there's a learning curve. Here is probably the most sophisticated piece of that cohort, so people get it, how it works. But a lot of people is, why does it have a different address? Where is the seed phrase of this Mark-Ontrick wallet? And all those questions that come up that you need to educate, and that is a learning curve. And in the end, you pay more gas, you have less stuff to do, but you already learned how to operate a EOA wallet. So why are you going through all the hassle? You don't really need a smart contract wallet. You can do it without. So that's the thing that's like trying to put account abstraction as is in the hands of WebTree natives is not the path. I think 7702 changes a lot of that, but for now it hasn't worked. I don't know of any examples. And the examples I know that are working well are in a different direction. And the question is, okay, so Web3 natives not really working. So for who this technology adds value? And the thing we have been seeing is, like, people that cannot do it otherwise. So if you have someone that wants to do something on-chain, be it because you want a product that's non-custodial or want to buy a token that's not available anywhere, this person doesn't really know how to use an EOA, then you can deliver a lot of value because it's not a matter of being easier than the alternative. It's being a matter of, can I do it or can I not do it? And the person doesn't have the option of the EOA. And getting specific use cases, I think it's an important one as well. Polymarket I would put in that bucket, WorldCoin in that bucket. That's people that just like more... If you abstract the UX and you make a very simple flow very easy, that seems to work much better than trying to do everything. And the thing that you're seeing, like this is the kind of chart I showed, like you get spikes, you get web users, you get a lot of hype, but it's very hard to sustain it. The one on the right is Picnic. That's weekly transactions for the past few months. You don't see necessarily the big spikes, but retention is really good. So people come, they use the product, they like it, and they keep using it. And the idea here now is to give you a sense on what are the product decisions that we made and why the thing is working. But now, like any questions so far? How is that going? Just okay? I'll keep pushing and then we can do Q&A later or because they already went to like 20 slides and yeah let's see how that goes so the things like the idea here is go to the things we I think we did right and what were the key learnings we had in each of the steps so first thing I think one of the ways I describe Picnic is that it's a centralized exchange-like experience or a FinTech-like experience, but everything running on-chain. And I think focusing on that very core use case, it has been... It makes the product much easier to build. It makes the product much easier to build it makes the product much easier to understand for users the simple use case you come to buy and sell tokens basically and it makes it easier to use it's just a single flow and one thing I think we spent a lot of time is just like okay account abstraction is really nice. I think it's a fundamental building block if we want to deliver like DeFi for a wider audience for Web 2 users. But what else beyond that do we need to build? So what other building blocks are key and critical? And I'll give you an overview of the whole product. This we see here is basically like the main pieces of the flow. I'll get a bit more in detail. But basically, you can sign in with Google. You can sign in via email. If you want to connect with an external wallet, you can as well. Once you sign in, one of the critical things we spent a lot of time thinking about is how to integrate on-chain with off-chain. This thing here, this is IBAN. IBAN, que é basicamente um banco de bancos europeu. Então, a segunda linha é um número de banco de bancos. Se você transferir dinheiro para aquele IBAN, isso é vivo na Europa. Nós estamos principalmente no Brasil, mas também estamos presente na Europa, e eu acho que esse é um exemplo melhor, porque é um banco de bancos de sua própria cadeia, essa é a abstracção que eu estou fazendo. Se eu transferir euros to that IBAN, euro stable coins are minted in the wallet as soon as the money arrives. And if you transfer 100 euros, you receive like 100 euros in your wallet and you can spend from there. And this is like the swapful. So let's say I transfer 25 euros to that IBAN. Now I have 25 euros in my wallet. I can buy ARB with that. So that's kind of the flow is very similar to what you would get in a fintech, very similar to what you get in a centralized exchange. But that's all happening on-chain with pretty, pretty abstracted UX, and I'll go by every one of the components of that flow. So it's basically authentication on and off-ramp, gas, chains, transactions, and a few other tricks. On the authentication part, you basically have Google email and external wallet. A very peculiar thing we learned, like we have been iterating with this sort of product for almost two years. We didn't start with connect with the external wallet. That's something we added much later. And it's really interesting, at least on our perception, that just giving the ability for the user to connect with an external wallet, connect with MetaMask or anything else, most users are not using that. That is fairly complicated and not really the point of what we're doing, but it helped increase trust a lot. Maybe not necessarily with the end user, but for example, content creators and YouTubers and people that really helped us grow, they trusted this a lot more when we added the option to connect with MetaMask. Because now it's much easier to understand that things are actually happening on chain. And this is actually non-custodial. So that was a small detail in the user flow that makes a lot of difference in how you market it, and how you access users, and how you can distribute it. Some other thing that I think it's mentioned. Was adding the external wallet layer, was adding the external wallet integration part of your effort to onboard Web3 natives? Because you mentioned somewhere in the beginning of your talk that the user is, he's not a Web3 native when it comes to A. It's somebody who is outside, right? So what made you feel this was important? People ask for it. Like, a few users ask for the external wallet option. So that's why we added it. Like, people are asking quite a few, let's implement that. But it's like 15% of our users use external wallets right now. So it is significant. But in my perception, the biggest gain we got from the external wallet was the trust. That people see you can connect with an external wallet, so they understand quicker it is non-custodial. Yeah. But... If you see Web2 users then switch to this external wallet thing, is there an existing cohort of users who... If we're seeing Web2 users migrate to external wallets after they start using with email, we have not been monitoring that. I don't think it's happening that much. Still, people use email logins still a lot. So we're much more in the path to improving email login and getting a better security. Could you get a microphone there? Can I get some help with the mics? Titus. But yeah, the external wallet, I think, is mostly good for trust. So I'm curious, did you build your own custom auth or did you use something off the shelf? We're using Magic Link. Magic Link. Yes. Yeah, but that's just for the email, right? Or is it also Google authentication? We have custom auth for both. For both. Okay. Gotcha. Gotcha. And the external wallet is a separate thing? Yeah, it's separate. The external wallet, it's directly, I think it's Connecticut connected with Wagme. Oh, Wagme wallet, yeah. All right, thank you. Okay. Yeah, and one interesting learning we had on this auth piece is that getting something that is more centralized but is more reliable is much better than more decentralized and less reliable. If you're having trouble with 0.3% of login cases, which we have with a different provider, that's a really bad thing. This thing cannot break. Never. It's very important to be super, super robust. So now, which I think is probably one of the most interesting pieces, is the integration with Fiat, the off-chain, on-chain integration. We were doing DeFi native stuff before, and we worked with a French protocol with Jarvis. They did a lot of exotic stable coins, so they did Brazilian RAL stable coin, Japanese Yen stable coin. And spending time there with the founder made me realize that stable coins, like local stable coins, are the best possible solution for on and off ramp. That's for mainly two reasons. First is you need it off account. So people in Europe are already used to thinking in euros. So all your balances are in euros. Like Brazil is the same. Everything is in reais. And in many, are in euros, like Brazil is the same, everything is in reals, and in many, many countries it's like that. So if you're funding an account, you're already thinking your currency, better to keep that way, right? It's just easier, less cognitive overload, things just work. And one really cool thing that I don't see a lot of people talking about. Stablecoins make money just sitting on the money. So they get the treasury yield. Like in Brazil, they get paid 10% a year just to hold reais. In Europe, it's like 3% or 4% a year, something on that range. So they have a revenue stream just by holding your euros and give you stablecoins. So they can incentivize on off ramps, so they can subsidize on and off ramps, which is what we have been seeing both in Europe and Brazil. We have free and very fast and very good on and off ramps, and that seems sustainable. We're not subsidizing it. That's the business model for the stable coins so it is both from the UX perspective as well as from the economics perspective the long term way to onboard users and it's free and instant, it's a really really good UX like you can go from bank, money or bank account in Brazil to money or bank account in Europe through Picnic in five minutes. And you can do the inverse as well. If you have a fast bank in Europe, that's usually the bottleneck. One cool thing we did, this was more recent, but across the app, we're not calling stablecoins by their name. So the Euro stablecoin we use is URI from Unirium, but we just call it Euros. For Reis, it's BRLA. We just called it Reis. We had quite a bit of feedback, especially on the less sophisticated side of users. It's like, okay, okay, I deposit and I got this weird thing called BRLA. What is that? So those small details, they matter a lot, especially when you go to less sophisticated users. So I think spending time there and improving small details matter a lot. One other thing that I think is worth mentioning is KYC and UX to be able to on-ramp. We had a different on-ramp provider before the ones we have right now. And it was quite bad KYC process. It was confusing, not very well polished. I think it's worth spending a lot of time in getting KYC works really good. Conversions stay a night. I think that one of the things that made us able to grow and see some repeat usage was getting the flows easy enough for people to onboard and start using and then be able to keep using. Gas abstraction, this is something I think very cool that we did. You can pay gas in whatever token the user has in its wallet. So here is dollars, it's USDT. But even if you have some random meme coin that is listed on Picnic, and our process for listing is basically if it's in CoinGecko, it's in Picnic, we just scrape that and list the tokens. We accept it. So if you have basically among like 5,000 tokens, you can use that to pay for gas. So it is just fees. You don't really need to teach the user that, oh, you need to get a separate token to pay for this transaction. The thing just works. Like you have Pepe or whatever, you pay gas and Pepe and it's all good. Any questions here? So you have Strack in exchange for them then? We actually hold the Pepe and sell it later. And we settle with the Paymaster. Yeah, and connect to the previous slide as well. Did you find that you needed any kind of regulatory approval to realize a product like this? Because it's, like, quite a lot of money handling at, like, 20,000-foot overview. I'm just curious how the regulators saw it. Yeah, we see ourselves as a tech provider, mostly. All the things we do, you could do without us for the most part. Yeah. And so it's still not very clear what we need and what we don't. At some point, I think it will probably get regulated. Now I think there is a lot of grace on. It's still 100% non-custodial. So there's still an opportunity for us, like, being non-custodial and not being regulated. If we were to hold users' money, perhaps we should. Yeah, the regulation applies to the stableholder, to the stablecoin issuer. Yeah, exactly, yeah. Yeah, and is that a barrier to adopt USDC, for example? Is that a barrier to adopt USDC, for example? Is that a barrier to adopt USDC as well? Because I saw you on Euro and Real, but... We could adopt USDC, but the thing is that Circle does not provide a dedicated ramping service like Monerium for end users. They have, as far as I know, they only have like ramping for institutional institutions. So if you want to do like a retail solution, we would need to find another provider that could do the KYC. Yeah, like a Moonpay or something like that on Rampy. Yeah, and they would have a fee on it. It would not be probably one-to-one. Makes sense. Thank you. So, like, the relationship with the stablecoin is directly with the user. So the user transfers money to the stablecoin provider, and the stablecoin provider mints directly in the user wallet. It's not like, yeah. The event that we see over there, who's it from? Like you generate one for each user? The I-band we see here, it's one for each wallet. And that relationship is directly from the user with the stablecoin provider. The stablecoin provider has an e-money license in Europe. And then they provide the I-band to the user with the stablecoin provider. The stablecoin provider has an e-money license in Europe, and then they provide the IPAN to the user. Yeah, sure. It gets created as soon as the KYC is approved. Sometimes it's, like, within a minute to three. Sometimes it takes a bit more. I was curious to know if the KYC was made with some sub or do you use any other third-party provider? KYC is always handled by the partners. So the Brazilian Real stablecoin has its KYC flow. The Euro stablecoin has its KYC flow, the Euro stablecoin has its KYC flow. And one of the problems we're getting is like how to make those people talk together because it's quite bad. UX to make your user KYC for every product, especially with RWAs and things like that, that can be really painful. So yeah, those solutions of like reusing KYC, sharing KYC, that's really valuable. Just want to add one thing there. Because there are so many things that we need to do to improve as a company, as Ethereum and crypto as a whole. And this KYC sharing scheme is one of them. How are we going to manage identity? And if we think, like, this is just one use case of stable coin on off ramping, but then you can plug in, for example, debit cards. And if the debit card provider is different from their own ramping solution, will you need to do another KYC for the debit card? It doesn't make sense. So, we need to find a solution where like KYC shared, it would still decentralize and everything. It's a big problem. Yeah. Just a UX thing that we found has been really irritating is for stablecoins because they always, they're not, they don't't exactly peg do the users get confused as to why they even see that second amount and like what that means and how do you explain that to them? It is indeed a problem. We solved it somehow by the stable coins that have direct on and off ramping we we just packed it to the value. Because they are packed, in fact. Because if you have 100 euroes and you want to withdraw 100 euroes, you're going to get 100 euros. So they are essentially packed. They might not value the same in dollar terms when you swap them into a DEX, for example. But that's another issue. That's another problem that you mix with slippage, we've mixed with liquidity, but we just packed it into the UI and it works. Cool. Thank you. Okay. Nice. Happy to see some questions. Thank you. nice happy to see some questions thank you so it's a two-part question the first part being that can you go yeah okay that's like yeah so now that you see here it's a dollar in USDT on the OP network and the resulting currency is OP on the OP network. Now if I want to change and take it on a different network, so does it act like a swap or a bridge or both? Male Speaker 2 in audience 2nd question That's Male Speaker 2nd question Both, like look there, yeah, it's the same. Okay. So that's one part of the question. And the second part of the question is that can I switch from one currency like the euro to maybe a dollar or to maybe an Indian rupee or whatever is available at that moment? Can I switch between two fiats?",
  "eventId": "devcon-7",
  "slot_start": 1731483000000,
  "slot_end": 1731488400000,
  "slot_roomId": "classroom-d",
  "resources_presentation": "https://docs.google.com/presentation/d/13A9C80P0zlw8I1eLl0T6fZOyBk0YNwjGY4iHKV2trZs",
  "resources_slides": "https://drive.google.com/file/d/1qgQun5VXrikpxicltaIEq4RBCuqWZ2lt/view",
  "speakers": [
    "joao-ferreira"
  ]
}