{
  "id": "buidlguidl-build-your-first-five-apps-on-ethereum",
  "sourceId": "3BCKLQ",
  "title": "BuidlGuidl - Build Your first five apps on Ethereum",
  "description": "**Afternoon Workshop (1:15 - 2:15 pm)**\r\n\r\nAccelerate your Ethereum skills in this rapid-fire workshop! You’ll build five dApp prototypes on Ethereum using Scaffold-ETH 2 and its powerful extension starter kits\r\n\r\nWe’ll cover key concepts in smart contracts, front-end dApp development, and how Scaffold-ETH 2 streamlines the process with ready to use state-of-the-art tools. \r\n\r\nThis session is ideal for beginners looking to gain hands-on experience quickly.",
  "track": "[CLS] Learn How To Build On Ethereum & Capture the Flag Game, by BuidlGuidl",
  "type": "Workshop",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Live Coding",
    "Open Source Software",
    "Public good"
  ],
  "keywords": [],
  "duration": 4305,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673456529dbb7a90e105884c",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673456529dbb7a90e105884c.vtt",
  "transcript_text": " You are a builder, go to speedrun ethereum to learn how to build on ethereum. This will help you with your first five apps. We're going to speedrun the speedrun today. I've written a bunch of code. This will probably be a little less code writing and more just like going through the tutorials and talking about some of the aha moments you have along the way. Just to like zoom all the way out, we are the build guild. We are focused on developer education and tooling. Our main tool of choice is scaffold ETH and we use that to build a bunch of things. But that is also the heart of Speedrun Ethereum, which is our curriculum. And we're going around the world teaching people how to build on Ethereum, and anybody can just go to Speedrun Ethereum and get started today. And we're going to kind of just speedrun the speedrun today. I'm going to go through the challenges and just kind of talk through the kind of the aha moments you'll have. But hopefully you can go home and speed run Ethereum on your own time and really kind of go through this at your own pace. But I'm going to go through it quickly just to kind of cover like, oh, here's the stuff to look out for, basically. Let's do just real quick, if you guys could give me a show of hands, how many of you have deployed a contract on main net before? Oh, yeah, we have five or six main net deploys. How many of you have deployed on an L2? Actually less, I think, right? Less people? Okay, we're going to change that today for sure. We have to get you ready for that. I deployed one to base earlier and someone attacked it and stole my money. It was pretty fun. How many of you are software developers? Okay. Those. Look at those. I would say that was almost all the hands. I just got goosebumps. I'm excited. This is awesome. I'm going to do the speed run. Probably 20, 30 minutes, I'm going to speed run the speed run, and then I'm going to hand it off to Etta and she's going to do I think like an NFT build, right? Cool. Awesome. Okay.",
  "eventId": "devcon-7",
  "slot_start": 1731478500000,
  "slot_end": 1731483000000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1Y7SoCe3qErMg50qHQ7I69ZuGqYs3OYa620D1qj0qI8A",
  "resources_slides": null,
  "speakers": [
    "austin-griffith"
  ]
}