{
  "id": "building-pop-up-villages-that-accelerate-real-world-crypto-adoption",
  "sourceId": "988STX",
  "title": "Building Pop-up Villages that Accelerate Real World Crypto Adoption",
  "description": "Join us to explore the growing trend of popup villages and popup cities, starting with Zuzalu. We'll look at how these short-term communities have helped the crypto world and beyond.\r\n\r\nYou'll hear real stories from Zuzalu, ZuConnect, Edge City, Aleph / Crecimiento, The Mu, MegaZu and ZuThailand. We'll talk about how these villages can speed up new ideas, but discuss where we need to try more things.\r\n\r\nWe'll end by talking about why it's good to step outside the crypto digital world, into the physi",
  "track": "Real World Ethereum",
  "type": "Workshop",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Coordination",
    "Ethereum for Good",
    "Social",
    "Coordination",
    "Ethereum for Good",
    "Social"
  ],
  "keywords": [
    "NA"
  ],
  "duration": 3882,
  "language": "en",
  "sources_swarmHash": "822ddb34e2793469b80389b5b20e3bd12779b9c5cad9df9f473811c19c4a77a0",
  "sources_youtubeId": "uVuE6XwnOAg",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673862f91b0f83434d72e5ca",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673862f91b0f83434d72e5ca.vtt",
  "transcript_text": " All right, everyone. Thank you so much for coming. Thank you for being here. And welcome to this session on Pop-Up Cities. My name is Timur. We have an amazing set of folks here up on stage, and we want to make this a very interactive session. So we'll be passing around the mic for some feedback from the folks here. If you're tuning in on the live stream, welcome as well. It's so wonderful to have you. So just a quick overview of the agenda for today. I'm going to start with a little bit of context on the history of social gatherings, which will ground us in the context and the lineage of what's happening here. We'll talk a little bit about Zuzalu. We'll share some fun stories, and then we'll get into the relevance of this movement for crypto and crypto adoption. Then we'll talk about the design space for pop-ups and then some of the challenges and opportunities. But I'd love to start, just so you know who's up here, just a very quick set of intros. I'll kick off myself. My name is Timur. I'm one of the co-founders of EdgeCity. My background is in building startups, which I did for about eight years in New York. And then I was a partner at a VC fund for two years. I was lucky enough to go to Zuzalu and had a very kind of personally meaningful experience, which pilled me on this concept. And pretty much from that point decided to do this full time. So that's me. Nicole? Hey, I'm Nicole. I'm currently working on Zoo Thailand. But before this, I helped start Zuzalu. And yeah, that's how I met everyone here. Hi, I'm Janine Leger. I'm one of the co-founders of Age City, and I helped with getting Zuzulu off the ground. So got really excited about this movement last year and have been obsessed with communities and what can happen with social dynamics and how we can actually like progress the future in some way because of it. Hey, great to see everyone. My name is DC Posh and I'm a co-founder of Daimo, DaimoPay. And it actually, Daimo started at a pop-up village, started, like, came out of Zuzalu, which was an amazing experience. And I helped build the V0 first prototype of Zupass. We'll talk about that in a bit. And, yeah, great, glad to be here. Yeah, awesome. So we have quite a range of perspectives here, from some of the folks who really started this movement to DC, who's been one of the quickest tech development stories to come out of this space. so yeah that's that's um that's that's that there so okay i think a really good place to start here will be to talk about the lineage and the history of this movement and the point that i really want to come across here is that humans and human societies have had a long history of coming together to talk about new ideas about how society should be structured. Humans have a lot of creativity and collective agency in this process of shaping society. And it often looks like taking some space away from mainstream society to gather in a space that will allow for discussions about new ideas that can then spread and permeate through the rest of society. These movements have, through history, been critical and very important in incubating new ideas and new technology. And I think this gives us a bit of an idea about what is actually happening with pop-up cities. My personal assertion is that pop-up cities are a new surface area for this type of experimentation, especially for a lot of the ideas that we're developing in the crypto space to find actual meaningful ground for tangible in real life experimentation. A lot of the things we're doing are quite heady, they're quite abstract. And so what we've seen already in the last couple of years is that it's a very, it's kind of fertile ground for tangible applications, for how to live, how to build new tech, and how to ultimately improve society. So I went deep down this rabbit hole. I originally had maybe 20 different examples. I picked five just to give us a little bit of a sense for what's happening here. So the first one is the Enlightenment salons in 17th and 18th century France. These were mostly in Paris. They were social gatherings. They were often hosted by, mostly hosted by women. And they were kind of a safe space for new ideas about Philosophy politics and science this was France at the time was a monarchy But it was the the general prevailing sense of the Enlightenment was is there actually a new way to structure society? Right now that feels a little trivial maybe kind of obvious to us, but at the time it was really very, I mean, literally revolutionary to even be talking about ideas of moving beyond a monarchy. And the impact of these environments was huge, right? They spread ideas from the Enlightenment, kind of the classical ideas we think of about liberalism, like individual liberty, freedom, individual rights, human rights, and this is kind of the birthplace of modern democracy. And obviously, if you study the history of the French Revolution, you see that this was critical in making France a constitutional monarchy for a brief moment, and then obviously a full republic. So that's kind of one example that we can harken back to. Another one that's slightly less well-known, but I think is potentially even closer to what's happening here, is what's called the Chautauqua Movement. So this started in late 19th century US in a place called Chautauqua in upstate New York. But it very quickly spread throughout the country. So I think it's actually a really cool model for what's happening here. Essentially, it was an adult and kind of family education movement. So every summer in this town, they would bring university professors, they would bring folks and families to come together and teach each other. It was kind of like a long unconference that happened over the course of one to two months. And it had folks like Henry Ford, who's pictured here, and a bunch of the other kind of big innovators of the time who would come and spend their summers there. And this eventually spread around the country. So pretty much every city in the US had a Chautauqua in the summer. Some of them happen throughout the year. And it actually kind of approximates very closely what's happening with things like Zuzulu, things like Edge City, Zoo Thailand, where we have these one to two month temporary gatherings that are then now starting to pick up steam again. So yeah, it's just a really cool example of a small idea that became a national movement. The next one is Black Mountain College which was a experimental college it was a reaction to kind of the industrial education movement in the early 20th century it had a lot of interesting folks like John Cage Buckminster Fuller actually invented the geodesic dome while he was at Black Mountain College. It was the center of American avant-garde art and poetry. So it influenced a lot of American culture. But again, it was a permanent place. But for most people, their experience of it was that they would go there for one to two months. They would go deep on some ideas. They would collaborate with other folks who were there. And out of that came a lot of interesting philosophy, art, technology, like Buckminster's work. That's actually him pictured here. It's a little bit pixelated on the screen. But yeah, just really interesting history. It's even less than just 100 years ago. Auroville. So Auroville is an interesting example in India. It's actually a permanent new town that's still going. And it was created as an attempt to figure out a place focused on human unity and sustainable living, and especially human flourishing. There are people that live there full-time, but again, for a lot of people, their experience is ephemeral. So they come for a month or two, they stay there, they learn, they develop ideas. At the time, this kind of came out of the 60s, you know, cultural revolution happening in the us so the hippie movement a lot of talk about peace and harmony obviously the vietnam war was happening at the time um it's it's it's big there's you know 3 000 people but uh they i think they've had over a hundred thousand in terms of like folks that have been there and it's a really interesting experiment that shows that these things can have a lot of longevity over time and one oh yeah so the last one here is the Santa Fe Institute which is a little bit of a more contemporary example but I think gives a really good sense of what's possible here when people come together around a particular concept of study. So SFI is focused on the idea of complexity science. It was started by folks that were part of the Manhattan Project. And yeah, it's a space for people to tackle complex problems. It's a very multidisciplinary research space which I think is very interesting they actually incubated a new way of bringing together scientists and tech people and thinkers from a variety of different fields and finding ways to kind of create collaboration points between them huge impact again it has influenced a lot of scientific thinking in modern times, a lot of mathematics, economics, biology, and especially compute science. So, yeah. And there is one honorable mention, which is Burning Man. I wanted to include this because I think when people think of pop-up cities, this is probably the first thing that people think of. It's a literal pop-up city for 10 months of the year. There's nothing but desert in this place. And then people start building, and for a week, there are close to 100,000 people there. It has had a huge cultural impact. It has spawned really a global movement movement of burns there are now burns in most regions around the world it's obviously quite radical in the experience that people have it's quite different from people's traditional lifestyles i think so i've been going for a long time i do think it's a very interesting experiment but i do want to call out that i think it's ultimately very different to what we're trying to do and I think that's important to note because again it's like a it's it's an association that people have and that they come to quite easily but I see the burn as a chance for people to very momentarily kind of LARP or, um, yeah, like role play a completely different lifestyle to the one that they currently live. Whereas I think the thing we're trying to do with pop-up cities, and obviously there's, there's infinite variety of what people will do with this format, but, um, it's much more approximating what does, what could life actually look like if it was thoughtfully designed. Yeah, so that's that. And the question is, so where do we go from here? We, you know, our generation has a whole set of new problems. Some of these old institutions or movements were the answer to a prior set of problems. We have our own. There's a lot going on, I don't need to tell you. But we also have new tools. There are things that have been developed in the last couple of decades that have reached maturity that are now usable. Obvious examples, Internet AI and ultimately blockchains, which we believe are a very foundational tool for this kind of experimentation. And we'll get into some of that later. There are new experiments starting to happen. There's new ideas like the network state, there's Zuzulu, there's Edge City, Zoo Thailand. And so I really see these pop-up cities as a way to prototype new solutions, like I've been saying. And each experiment kind of brings us closer and closer to what a resilient, inclusive, and flourishing community could look like. Yeah, so that's my little bit. Great. Yeah, thank you. Awesome. That was amazing. And I think this is something so important for us to do generally is, like, look at history of movements. And so much of them have been pretty low-tech. And by the way, if you guys want to come over, feel free to. So much of them have been this sort of lower-tech type environments and really focused on just how do we get people together. And I think right now we've got this very interesting opportunity with like technology has progressed substantially and can actually benefit from and connect to a lot of these sort of low-tech environments to bring like low-tech and high-tech together in some magical way that makes some of these movements like actually long-lasting or spread and proliferate in ways that technology is able to help with. That didn't happen previously. So this section, we're going to have to do an exit because I did a whole update of these. Yeah, refresh. This section, we're going to try and make a little bit more interactive with all of you. We'll go through a little bit of the history of Zuzulu. I think Nicole and I haven't really sat and spoke to a lot of people about what that all looked like and why and how we were doing things. So firstly, before we sort of get to that, one thing that I wanted to profile is this was a really great slide that someone put together. Bob Haywood had put together at Edge City Lana this year, which was just last month. And he sort of was like, okay, what am I seeing, you know, these pop-up, where are they fitting in the stack? And this idea of sort of these pop-up villages being between, you know, we've got hours of time together, a few days together, five to ten days together, and that the 30-day onward mark, or at least, you know, a month, maybe it's two months, we don't quite know that right amount it's like it really is where that like irl community and culture actually start to form so there's something interesting you know when you look at the ethereum industry where if you pack up all of the different crypto conferences that we all attend we're starting to get to that amount of time there's like a real culture that has developed as part of Ethereum. And this, what we're almost trying to do in these pop-up villages is like, can we speed run culture building? And what does that actually look like? And how do we, how do you spend this period of 30 to 60 days together and really develop something different culturally? And something that I think we can go through as a group is just how each of these pop-ups in a way are creating their own culture that is slightly different and unique in some capacity. The other is just kind of where Vitalik ended up really spending his time thinking, was like, we've seen the dates and the meetups and the conferences and that structure we've iterated on a lot. But then universities and cities and towns and countries, those are also very ingrained in a specific way. And this was a two by two that, I mean a graph that Bology had originally put together and Vitalik really kind of looked at this and was like, wait a minute, there's sort of this open gap and we should maybe just be experimenting there. So a large part of this was just like cool that's a space for experimentation and that's where that kind of started and sort of the the next piece is like why like why even begin to start experimenting in that space one it's like this dissonance with governments like a lot of people aren't necessarily resonating with the countries that they're living in the network state movement sort of got that kicked off in in a in a major way along with many other things that were happening um just work environments are actually pretty stale like when you actually start to think about just corporate work environments there was sort of this open question that covert really put in the air of like, okay, people working remotely, what does this look like? As well as a shift from closed source type company environments to more open source ecosystems. And how do you actually build spaces for these open source ecosystems versus a company that's a very clear box, let's all go into this space and work in this office. The other piece is that we've seen both ourselves experiment with At Age City and what we experimented with at Zuzulu and some others are working around is just like the chronic health disease crisis is pretty real across the world. And like healthy living environments has not necessarily been a focus, but it has become a real big issue. And then when you actually look at education, it has just gotten progressively more expensive over the years and not necessarily solved more problems or made people smarter and iterate in an interesting way. And lastly, just like innovation in general is expensive. But those were sort of like starts of some of the why to stop building Sid's experiment. And then we got to where it all started. So do you want to go through a little bit of the beginning? Yeah, so when Zizzle came about, I can say it from my perspective of how I got involved. I ran into Vitalik at a little MEV hacker house, and there were like 200 people around him, but no one was talking to him. I walked up and I was like, hey, I read your recent blog on crypto cities. We had a little bit of a discussion and I invited him to a hacker house that I was hosting to which he surprisingly came. And then there we talked, riffed on everything from like Ethereum related, like account abstraction things to what his personal life was going to like how can we potentially do a crypto city so it's actually last DEVCON in Bogota where we sat down and he finally asked me like for 200 do you want to do an experiment that's 200 people for two months so like the rationale there was there's so much theory going around why don't we just try and do something in practice? And that was a very casual start. And from there, we pulled in a lot of different contributors. Milos, who represented Montenegro locally and helped us connect to, for example, the prime minister, who is a very young world leader, I think the youngest at 35 at the time, and had a background in crypto. So that's kind of why we chose Montenegro for the first experiment. We thought we would get a lot of Visa support. And it was also a place where we happened to have a venue ready to go. And we planned the whole thing in two months. So it was not perfect by any means, but scrappy in a fun way. And then from there, we brought on Vincent, who is a very curious guy. So he knew a lot of people in biotech of which Vitalik was very interested, and he helped be an inviter, and he brought in Janine and Lawrence, and they also helped contribute in, like, well, Janine ended up doing a lot of things operationally, but that's sort of like the beginning of the core team. So the core team helped drive this experiment to start, but I think the experiment itself is very co-created by a lot of different people. So we had tech teams. We'll talk about this a little bit more later, but Xerox PARC helped start ZooPass, which is a really interesting tech identity experiment. And then Althea and PSE team helped start the Zuzulu.city permissionless website. So that became a core basis for how we did permissionless culture. And yeah, a lot of other teams helped build this experiment together. So when we look at some of the original thinking, a piece of it was like, okay, can we make this cheaper than living in a San Francisco or New York? What does it actually look like to build a place that is awesome in some capacity with intellectual rigor as well as interesting people? Because ultimately at the end of the day, we all just want to be around interesting people. And there was a sense of like, okay, can we experiment in that area? So we decreased the price of and had some subsidy to make sure that that was the case. We also were like, wow, eight weeks, long time. What do we do with this? And ultimately decided to sort of like bring in all of these different contributors that Nicole was mentioning to help structure different weeks throughout the time that we were together. One learning that we had from that is weeks are, it's a great way to bring people in that are kind of interested in pop-ups generally, but the longevity of some of that learning then sort of like dissipates once that sort of like concentrated week of programming is gone. So figuring out how we can do like extensive learning in some capacity has been something we've iterated on this year but this was kind of the original start and just brought so many different people in um and this was so valuable because it brought in many different leaders and it made sort of how we started susie not about a team that did it all but about how do we empower many leaders in this community to go and do other things themselves to build and contribute and think about like what they would structure and how they would structure it so there's kind of this tension that exists now that's interesting around how much do you let different groups as we learn and figure out like oh this type of program worked or that type of program around how much do you let different groups, as we learn and figure out, like, oh, this type of program worked or that type of program worked, how much do you create structure around that versus allow people to come in and still build their own unique programming that, like, contributes to the culture of the space and the people that bring it in. This is just an early stage. Like, this was the website to begin with and sort of a start of, like, there's different projects and there's different things that we're working on and there's different ways that you can add sessions to the calendar. And this has been iterated on a ton. So everyone in this room who's, like, who here is interested in building like pop-up city tech or kind of social technology in some capacity? There is so much room for experimentation and there is so much room to build. This was the start last year and now we've got things like social layer and everything that Simplify is doing and stuff that Cursive is doing and stuff that Lemonade is doing and there's all these different projects that are now trying to build and I think it's a very interesting space that is going to have a lot more people operating pop-up villages and pop-up cities around the world and like if we can actually just get a lot of technology that helps with that coordination, it'll be super interesting. Yeah. So with that, let's get the story of Zupai started. Yeah, sure. Oh, man. So my... Okay, all right. My story with Zuzalu started just a bit after what Nicole and Janine were just talking about. And it was through some of my friends at Xerox PARC. I was talking to them about this event. So I heard about it through them. And then I was talking to them about this event. So I heard about it through them. And then I was immediately interested. OK, this sounds like something out of Neal Stephenson, right? This is a lot of like Ethereum Core. I was very fascinated with Ethereum at that time. I was working on a Bitcoin-like client that runs on Ethereum. So it was like something I had been building. And a lot of people in core R&D and people who are digital nomads, and they're moving to this post Yugoslav microstate for two months. This is an incredible thing to be happening. And then a bit into this, I also realized that there was a lot of scramble to make it happen. I was talking to Ivan Shub, a good friend of mine over at 0xPark, and he's saying, yeah, we need to build this zero-knowledge proof-based passport for Zuzalu. Okay, when does this start? Three weeks. So I ended up saying, okay, I can help ship this if I can join, if I can come to this. And then we ended up just in the, sort of like lowering ourselves down the mine shaft for those three weeks and doing this. A lot of good memories. That was really fun actually. Actually, I'm curious. So ZooPass has sort of iterated existed for Zulu number one. How many people here have used any of the zero knowledge proof stuff in ZUPASS? The answer is probably everyone here because DevCon is actually using it. Well, DevCon is using it but I think it's, DevCon is using it in like a scan the QR capacity. Exactly. For Zuzalu, we were actually doing things where, so like one of the original things, where the Z and Z, like part of it where it comes from, is, I mean, you could make zero knowledge proofs that you are a Zuzalu resident without revealing which one. And so we ended up doing some really fun experiments at the event that were related to this around anonymous polls, anonymous messaging, but not internet-wide anonymous messaging. You know everyone who's writing on there is people who you're living with. They're one of the two, three people. So, yeah, I think we'll talk about a little bit more about that in just a bit. But I think one of the ways that, you know, we're here at an Ethereum conference. I think one of the ways this really relates is that pop-up cities, pop-up villages are an amazing way to basically bootstrap critical mass for new ideas. And they're an amazing prototyping tool. And you can try things that would be very hard to get it to work on the open internet and would also be very hard to get it to work with just five people. If you need to do something with a thousand people, this is a pretty amazing way to do it. So DC is the founder of an incredible startup called Dymo. You should check it out if you haven't. But I'm curious, DC, if you're open to sharing how you had the idea for Dymo and then the kind of progressive steps of developing it at progressive pop-up cities. Sure, totally. It's funny, actually. You can connect the dots looking backwards more easily than at the time, right? So one of the things, Zsala was an amazing time. One interesting thing is that a lot of the people there, even though they're like, a lot of these people are people who are like dedicating their lives to Ethereum, right? Like that's like, they're deep in it. The amount that people are actually using Ethereum day to day was not very much. And you would see people, you know, and we sort of were, you know, there's a few of us there who are looking at this and saying like, you know, how do we just make this much easier to use? How to make this more useful. And uh, Daimo V1 came out of that, where it's like, alright, let's make something that is like, uh, you know, PayPal, Revolut, like, WePay, whatever it is, but runs on stable coin rails, runs on rollups, like, this was actually, we were kind of leading it off a little bit, you know, so skate where the puck is going. Like at the time, you know, we were saying, okay, like this is going to be like free instant transactions one to one. We were actually sponsoring like 50 cents of gas for each one, but we knew that that was going to come down. And then, you know, like a year later, 48, 44, now it's like one cent, one second transactions. It's like, okay, if this is about to happen, let's build the thing for that world. And then, you know, like what we're doing now, DymoPay, I think it's funny, part of that came out of the subsequent, you know, ZooConnect, right? We spent a couple of weeks in Turkey right before DevConnect. That was sort of the start of it and then we really figured that out and we had conviction about that later when we went to Argentina. You go to places where people use a lot of stablecoins and where people are doing, I think the most widely distributed version of what you could call real world Ethereum or real world crypto, right? It's places like Turkey, it's places like Argentina, it's we talked to a bunch of what you see in like Western crypto world where sort of like, you know, outside of the like core, like sort of intellectually curious R&D audience. There's a lot of people who just like want to buy something they wanted to go up. Right. Like for those people, though, this is like they're using the permissionless nature of the chain to be able to do things they couldn't otherwise do. I thought that was very compelling. The really hard part there was a lot of those people, you know, are not deeply into self-custody. They're like, yeah, we love Lemon, for example, in Argentina. Lemon being a, like, custodial stablecoin app that will give you, you know, certain, like, nice features that rely on it being custodial, actually, people really like. Same in Turkey, same in Argentina. And so what we're doing now is something that's like, okay, if you want to do anything on Ethereum in one transfer, even if it's from a custodial app, how do you facilitate that? Someone wants to place a polymarket bet, how do you let them do it directly from Lemon? So that's what Dymopay is. So we had our whole arc of what we're up to, closely related to things that we learned from these sort of intensive experiments. I think that's an amazing segue into the relevance of this entire movement for crypto adoption and accelerating crypto adoption, which is what this talk is about. It's such a good example of a product that was developed in the context of where people will actually use it, So inside a pop-up city. And then with progressive pop-up cities, you know, you have like four months, five months in between them, you can actually develop the product. And then the next time you go, so between Zuzalu and ZooConnect, you were able to build something for this new market where we were all going to be suddenly. And for the 400 people who were there in the pop-up city to actually use it, iterate it. They had a baklava stand. We had to use Dymo and you'd spend a dollar on some amazing baklava, which was really, really cool. And then actually be able to start to expand your reach and go out to progressively bigger and bigger markets until you get somewhere like Argentina, where it's like wow not just the people in the city but everyone here actually needs something like this now i wish i threw that picture in the slide deck of of nolan and i sitting there with the the red hats with the baklava stand that was a good time yeah and that that goes to sort of some of the recognition here of this building tech, like what does an ecosystem need versus a company, right? Like with Ethereum is an ecosystem with many different projects in it and this push towards open source and kind of like thinking what does that type of way of working need and way of living need that's different to the current constructive of, um, companies where it's like ship in a space and then send it out to, to customers. It's, we're in a spot of like iteration and, you know, getting feedback, getting people to build in one another's ecosystems getting people to build on and use the open source technology that we've got so these pop-up city environments are a space to test and iterate and share what we are doing and what you are working on in a way that we haven't necessarily had previously. And we're just seeing teams come to life with that. Like they are so excited about this idea of like being able to build a thing, have users instantly that are totally captive and excited to support and build on and connect them with other groups. And there's just sort of this network that grows, which is quite similar to what we have seen grow with the Pop-Up City network. So instead of us being a project that, you know, with Zuzulu there was this kind of open question of like, can we actually progressively decentralize but then have a core? What does that look like? Do we run Zuzulus? Do we not? There was sort of this big open question. And after Zuzalus Montenegro, which sort of how we structured it was, you know, that was chaos. It was absolute. This last sort of last minute of six weeks of planning to give you guys context there, it was like, you know, they had found a spot. But when I came onto the team, it was, we had like 10 weeks before Sousa Lou had started. My wedding was the first week of Sousa Lou. I was very excited to, you know, my plan was like, I was planning other events at the time and I was working at Gitcoin and like my, what I really cared about was bringing together folks to think about how can we fund community shared needs, and that was sort of this focus of public goods. It's like public goods are fascinating for communities. Funding people's shared needs should happen in some capacity, and I wanted to bring it IRL. Ethereum was a space that was just doing this in an interesting way online. But I very distinctly remember coming into the space and saying, like, I never really wanted to have a Twitter presence. I was like, I don't understand that world. I understand, like, the in-person and, like, tangible world, and that's what I want to build for, and it's just going to take longer. But then Zoosloo sort of popped up as this thing and I was like, this is definitely exactly aligned with what I've been trying to think about working on. At the time I was building an IRL community in Austin and then looking at how Ethereum could be supporting that type of structure. So when Vitalik and Vincent asked me to join the team, it was like, oh, this is great, but I have my wedding in 10 weeks' time. So my wedding was the first week of Zuzlu. The team really held down the fort with that, and we all just scrambled to make it happen, and I think what was beautiful about Zuzlu was how much we had to rely on the community from the beginning because we had so little planned like I remember when we started you know people were like accepted you know wanting to join for two months we were like wow someone actually wants to come we've we've got people this is amazing then we're like do we open the discord do we not we don't have any plans yet and there was sort of this push towards like build in public, build with everyone. And that building with everyone sort of led to a culture from the beginning that developed around letting many different flowers bloom and letting many different projects sort of come out of this and many different people contribute. So after Zuzulu Montenegro, everyone was like, when's the next Zuzulu, when's the next Zuzulu? And we're like, well, let's try and build something that's not Zuzulu, but it's just using the zoo to have people have attention, but doing, we called it Zoo Connect. Because it was a lot of us from the same team, everyone was like, that's Zoosaloo. And there was this idea of like, okay, well, I want to go to the Zoosaloo thing moving forward versus like allowing many different projects to come out of it. So there was this hard decision that was made around just decentralize in a way that like generally had no, no call to Zuzlu. And it was scary to so many people because it was like this thing that we had built as a community, was it going to disappear forever? Was it going to like become something else? Like there was definitely a lot of fear there for people and for us as a team as well and it was a decision that was like so beautiful because you start looking at this ecosystem and this is a year in and we've gotten here it's like so from Zuzulu Montenegro there was Zoo Connect that happened that spun off. The Moo is kind of connected to being part of the core actually. This should be a line that goes across here. This is still, someone mapped this out for us and they've sort of spun out a whole bunch of different things that also spun out Megazoo that you've got now sort of Metacamp and what's being built there. Seeing Network State, generally, like, the Network State book is kind of like a core that spun off sort of Zuzulu Montenegro. And Network School was something that, in speaking to Balaji earlier this year, he was not sure what he was going to win or how he was going to sort of build network school but because of Zuzulu and because of Edges Merelda that we did earlier this year he was like I've now got two proof points that sort of have me like wanting to test in this sort of way so there's a couple of things that have spread out from this side of it. Then when you start to look at what we said of Zuzulu as a name shouldn't be used, but like use zoo and get people to build zoo villages all over, being something we wanted to see. There's just been so many different projects that have been built and have their own beautiful culture that's like super, super unique. Some kind of different pieces of culture, like some people are diving into the health stuff. Some people are diving into like, we only want Ethereum developers, and they've got to ship, and they've got to ship the whole time. Some are trying to focus on a specific group of diaspora, like 4Cs is really focused on how do we support the chinese diaspora and like making sure that is the core one of the core values that they hold true so recognizing that like new society gets built with so many different like small nuances but having a you know north star in some way way to help rally people around has been beautiful to see. And that collection, I think, will only take many, many years to kind of figure out who's doing what and how do we connect them all together. But that was a bit of backstory over there. I can add a little bit more. I feel like a lot of things that look like happy accidents were small decisions that Vitalik made in a split second, which ended up making a lot of sense. He was always right at the end of the day. So even at the first ever Zuzulu Montenegro opening ceremony and the way that was set up, all of us were just like seated on beanbags. There were like eight people on a stage. And he already welcomed forks. He was like, I want you guys to fork this. I want you guys to take this however you want. I want to see more leaders. And the reason being, the first Zuzulu was very broad and almost by intention, and there was no centrally set vision, and that was very deliberate because we want people to take this in different ways. And that's been, I think, what's most powerful about Pop-Up Cities is what you've seen is like strong leaders people movements and people that rally around certain values have been able to use this as a conduit and as a framework to build community so we've seen that like a city has been able to build a very strong community and do repeat events we've seen Mu do that Mu is a entirely grassroots sort of fork of Zuzulu and they've done like three four events now and they always involve locals so what we've seen is like individual leaders are good at different fork of Zuzulu and they've done three, four events now and they always involve locals. So what we've seen is individual leaders are good at different things, care about different things, and because of that, they can take this in different ways. So when Vitalik decided to decentralize this, I think a lot of people were scared, but it's definitely proven to be the right choice because we've had 20 plus pop-ups just this year. And if it were just one team there's like a 0% chance we could have done 20 pop ups ourselves. So yeah 20 pop ups all Vitalik did was he started this press play on the experiment and he provides funding so he matched a quadratic funding round or two actually for both events and tech teams and that's been a nice little like pool of money that helps people kick off their own pop-ups. But for sure, it definitely is still biased towards people who are high-context who have done these before. But we almost want to welcome more people to come in. We want to grow this bigger. We want more pop-up city organizers. We want more initiatives rallying around different things. And I think the last thing here before we actually shift to more of a workshop type thing is Zuzula was really just like a seed that was planted. And see it like as a seed versus an umbrella. With so many different ideas that we'd love to continue seeing being built. And different groups building technology to support these. Building actual built environments that can host pop-ups, building operational teams that can support pop-ups in different ways, bringing in different community members to actually drive things forward. It truly was the seed that has allowed many different groups and projects and ideas to flourish. And the hope is that there's just so much more that comes out of this over the next couple of years. I think social technology is such a powerful idea and it does take both lo-fi and hi-fi environments to sort of like bring that together so on that note who has laptops because we had a fig jam planned but i'm only seeing a few laptops in the crowd so instead why don't we do a set of questions and just kind of go around and keep it a little bit more informal questions are also folks i mean i guess something brought you here this morning right unless you just stumbled into the wrong room but even then if you have thoughts or curiosities if maybe you haven't been to one of these you want to build technology for one of them, you want to build one yourself. Curious if anyone has anything to share. Yeah, I can come around to the mic as well. So everyone on the stream. Okay, you shout and then we'll repeat what you say. Yeah, that's a good idea. Yeah. So before we're building a network state in Japan, biology is our first factor. If I want to learn from you guys experience building these short-term communities, we're trying to log in. What is it called? Yatase is a new network state in Japan. Yeah, that sounds awesome. What are you guys going to be focused on? What's kind of a core idea? Our core commandment is, well, our moral innovation is that building is moral. And so the core commandment is we build. And so we're bringing together foreign and native entrepreneurs and helping them do cross-cultural learning and communication over a six-month to ten-year period. Long-term, long-term thing. Starting with one site, and then we're going wide instead of tall. So while he's doing Singapore 2.0, we're doing 100, 150 person sites. So all in Japan? All in Japan. Wow. Cool. The shape of that sounds a bit like Crescimento slash Aleph down in Argentina. I'm curious if that's something that you were inspired by, or is it different from that? Honestly, I've heard of them, but I haven't checked with them yet. So I'd love to thank you for the reference. I'll try to link up with them in the next one, please. Totally. Very nice. And they're doing something... So Crescimiento is a movement that was incubated at Edge City, Denver, in the sauna, actually, which is some lore. So that was around 10 months ago, and it very quickly spun, very quickly grew legs. Props to Juan Benet and many, many others who have been pushing that forward. Janine organized a trip to Argentina like a month later, and then they managed to do an incredible pop-up city called Aleph in August. And the only way that that actually happened was because of tapping into this whole group. Like at Edge City, we were literally in the sauna and Juan was like, I want to, I think there's an opportunity in Argentina. And I was like, you are not Argentine. And neither am I. So we need to make sure that this is something that is led by locals. And the son from the Moo was actually at Edge City Denver. And he was just hanging out. And I was like, son, I need you. You're going down to Argentina in, like, two weeks' time, and you're planning to sort of build a pop-up of sorts down there. Can you start, like, thinking about and looping in different folks? And they were incredible with just, like, quickly bringing together people to do a call. And we had a call to share about, like, the sort of opportunity in Argentina that Juan had sort of, like, identified and some people locally had kind of thought through. And we had this call, like, two weeks later with, like, ten different founders and builders and creators that presented from, like like Argentine folks that were just like amazing. And we had like 300 people on that call and we're like, wow, this is just an amazing community. Like we should go down and spend time down there. So we went down while the move was still happening. Petra was someone who was at Zuzulu and, you know, I was able to be like, Petra, can you help in some way? Who should people here meet? Petra is Argentine, right? Okay, yeah, great. And we had sort of a series of breakfasts and workshops and meals, and there were just people in the community there that were really inspired to do something that we could support get off the ground um and that was something that you know then i was like okay august timeline because this new government um in argentina doesn't have a huge window it's like four years is a really short amount of time like we need to do something bigger in august and juan had spent a lot of time um at different edge city environments where he was just like i want to like use this model to kick off some of this like to spark these initiatives and then it was just like a local team and individuals that were so passionate about the project there was was probably 70 people that were working on it. Other people internationally came in and helped as well. So it was really, again, another initiative that just spun up really quickly because of this network getting started. And the people who are now carrying it forward are within the network, but doing it in their own way. There's no top-down leadership that's driving that. Yeah, I'd be interested, you just said they like the model. What is the model? What state continues? Is it, for example, a principle like ornaments? What is the core? And do you have a playbook for different locations to get started? We've got a playbook. We've got an Edge City playbook. We have an old Zuzulu playbook. I think when we say the model, loosely, long amount of time with many people. And I actually, I've seen some people get, you know, model of like they're like it has to be 150 people to be a Zuzulu and I'm like wait what that was just what we had like that was an idea that you know more than Dunbar's number is useful but I think iteration around that is really important but I do just think like loosely it is you know long time frame around some core values. Burning Man took 30 years to, like, come up with their principles. And I think this is another thing of, like, coming up with principles too early can sometimes sort of pigeonhole you into, like, it has to be a specific way when there's still a lot of learning that we have to do. So you can take a look at the playbooks we've tried to like be more operational on those versus like this is the the principles that you need to follow yeah i think like every single pop-up has completely different values and the overall pop-up city movement is just very vaguely empowering people to do their own experiments. And that's why I think I want to see more people go crazier with it. I want people to completely break the current pop-up city model and do something new that takes off. The original format, I think people just enjoy. So I would limit to grow this to something new. I would say hacker houses, if it's smaller than like 100 people, then you're probably not a pop-up city. You're probably a hacker house. If it's shorter than a month, you're probably more of a conference residency. And if you only have like one focus, then maybe that is also considered a residency. Like the core values of the originals is we're sort of playing at intersections and playing like these new novel experiments. So yeah, the experiment itself is to do more novel experiments. Yeah, a few minutes left. Do people have any more questions, comments, roasts? Yes? Yes. Do you have some online element communities so that after you leave Edge City, that you kind of stay connected and you're sort of part of that online community So to the prior point, we're still very much in the process of experimentation around these things. We are very much IRL maxis in the sense that we feel like 99% of the possible kind of connection moments happen in person, but people have spontaneously started to, you know, gather, do little meetups around the world in the cities that they happen to share time in. So that's something that's being cultivated. We don't necessarily want to have, We don't want to fall into the same trap of some of the mistakes that we've seen some communities make of trying to lean too hard into, like, okay, everyone has to be on Discord all the time. You always have to monitor what's happening. There's a lot of cognitive load that happens there. But TLDR, we're experimenting. We're still going to try new things. Yeah, there's not like one sort of shelling point online community where all of the, even just specifically Zuzalo folks are. Yeah, actually, okay. So we have open town halls that people can join. They happen monthly now. And it's a lot of the different pop-ups coming together and having discussions. So that's like a good place. and maybe we should share that link somewhere and I think like a separate thing I actually think this is a big problem of Zulu is it's like very in illegible like and there's no real way of like engaging in long-form contribution so one thing so I'm hosting a pop-up after this called zoo Thailand and one thing we're doing with that is trying to build it entirely in public so So we are going to have an open discourse, so not discord, just like the standard forum for people to talk about pop-up cities if they would like. So that would be a potential starting point. And yeah, something that we've seen is people have tried to go online often. People have tried to go online after like people have tried to build the community between and it's there's still a lot of iteration that is needed in order to sort of like keep the momentum or actually like provide a lot of value in the in-betweens but I think that there's also the side of things happening more often in person something that I've recognized is projects that have tried to get off the ground in like edge city environments that we've had and even, you know, we didn't really have Zoo Connect I think was a good one here or some of the other pop-ups even with Crescimento where they're like, hey, can you use my tool? Like I really want this tool to be used, but actually I don't have the time to come and be there. And, like, there's a tension between wanting to see a lot of people's, like, projects out in the world and used, and a deep recognition that we've had is, like, people that are trying to iterate from afar and build for a pop-up but not being there have not succeeded super well because the value is in the iteration on the ground. So being at these spaces where you can iterate and get feedback and real feedback and are dedicated to that I think is super valuable. Hi, my name is Jason and I think today super valuable. Hi, my name is Jason. And I think today is my first time I genuinely have a touch point with Zuzalu. So I find it a very interesting experiment. I'd like to ask each and every one of you, where was the last Zuzalu? And what is one thing that caught you off guard so there was a moment where i found myself djing with grimes and that definitely caught me off guard at Zuzalu this was a very strange set of occurrences that had to happen for that to be the case but there i was on the montenegrin seaside with that happening and that kind of it's it's a funny story but it illustrates the diversity of experience that's possible in environments like this it was a diversity that led to me having a very personally meaningful experience where I felt like many sides of my personality were activated in the time that I spent in that space and I think that's kind of a core strength of pop-up cities. They really allow for this just like breadth and depth of experience. So yeah. What about you guys? So I think to this point, it's like pop-up cities. I would actually say that Doozaloo again was the seed versus the umbrella, and the umbrella is more pop-up cities. I would actually say that Doozaloo again was the seed versus the umbrella, and the umbrella is more pop-up cities. Okay. I think a moment that caught me off guard recently was we just did Edge City Lana, which was in Chiang Mai, and it was a really awesome experiment. Seeing the progression just even in the past 18 months of community, of the technology, of people that are building, of how people are understanding these spaces was truly amazing. A moment that I had that caught me off guard was an idea from last year. I was like, oh, we should have more families in these spaces because we don't want to create a spot that no one actually wants to get to the next step of life. Like we don't want Peter Pans. We want people that actually like think about building a better society and it was very much so this recognition of like if we don't have kids we will build a lot of peter pan syndrome and we will fall into the trap of like what companies today and what work environments today have almost fallen into which is like many women having to choose between work or family and it's like it doesn't have to be that way. Like, we should be able to participate in the workforce in whatever way that we can contribute versus, like, the stay-at-home mom syndrome. And maybe it's, I just have a personal fear of being a stay-at-home mom and never want to do that. But the moment that sort of, like like really caught me off guard was seeing that idea be seeded at Zuzalu of like I don't want a future of Peter Pan's, I want a future of people building something, building the future together and being at Edge City this year with many families and one moment of a mother with her two daughters being at a workout class, which was also another thing that I really wanted to push at Zuzalu was, like, making sure we did have health and, like, we're broadened longevity folks, but I was like, okay, but, like, we have to, like, stick, if we are going to say that we're a healthy place, we have to stick to that. They'd put sort of a gym, I remember this, wow, they put a gym like a 45-minute walk up a hill in a tent. And they're like, there's your gym. And I was like, no one's going to go there. You need to optimize for the laziest self when it comes to working out. And I was like, probably 2 a.m. And I was like, you know what? Screw it. We need to put the gym in the town. And they wouldn't let us because they were saying like, well, it's going to mess our little pretty marina up and like there's no way you can. So I like mapped out all of the apartments that we had, like rented out for the time. And I was like, which apartment has the largest balcony? And I was like, fine, I'll stay in this apartment so that like I have this, we can use this balcony space. And I was like, move the gym to the balcony because that was private land that they couldn't control. They weren't stoked about it, but like they had to sort of comply. So I had a gym on my balcony and it was truly like, you know, a last ditch effort at like making sure we had a space that at least people could work out. But getting to see the progression this year of having many, many workout classes, like one aspect that we want with Edge City is to focus on like building a healthy city and having, you know classes having gyms having access to you know you can be active at any given time and seeing this moment of like a mom with her two daughters and a workout instructor that we'd brought out that was that had become like this beloved relationship where the mom and daughter were attending every single morning with with this um workout instructor and she was leave the workout instructor was leaving the next day and both daughters and mom were like in absolute tears after two weeks of being able to do workout classes together in a space and i was like this is just a really cool moment where we sort of engineered like a completely different social environment to something that was normal, but it was kind of this like seeds that had become something bigger. Yeah, caught me off guard. A lot of things, but I guess like this time when Bellagio was playing the network school, there was a moment where I was just like answering all the questions and they were like, what else can we do? And I realized that all of this is just so easy, and everyone just needs to do it, and by doing it, you'll have experience. So seeing that someone like him who initiated this coming back and just asking for operational advice is very surreal. Seeing that there was 10-plus pop-ups before DevCon in Chiang Mai, that was surreal. There's just, this movement has really taken off and I really did not think it would do so, so quickly. And yeah, I don't know, very happy about that. This one's maybe a bit further afield, but one, one experience that definitely caught me off guard. So, I mean, we were, just to make it, not make it sound like this was like a big vacation, people were like pretty locked in. We were working for the most part at Zuzalu. But towards the end, there was a group of us that went wakeboarding, wake surfing. And I ended up talking to this Russian wake surfing instructor. And completely unprompted, he was telling us his stories. And he was telling us about how he did a lot of things off of stablecoins, USDT, like paid his kids tuition in USDT because he's locked out of regular banking, right? And he had escaped basically to Montenegro, you know, at the start of the conflict so that he wouldn't get embroiled in that. And that was pretty visceral. I mean, I'm in a small boat with this guy, right? Really friendly guy, and it was pretty amazing, you know, seeing people who are sort of using the, you know, permissionless nature of the system to, permissionless nature of Ethereum to basically escape authoritarianism and claim some freedom for themselves. That was really cool to see. Alright, I think we have to wrap up there, but thank you everyone so much for joining us. This was really wonderful. And... Yeah, we'll be around a little bit outside if anyone has any questions.",
  "eventId": "devcon-7",
  "slot_start": 1731638700000,
  "slot_end": 1731644100000,
  "slot_roomId": "classroom-e",
  "resources_presentation": "https://docs.google.com/presentation/d/1eO1XIDc-q3KrPnErEQR2cd7nQ0SBTvIxhRw2jsJFAFw",
  "resources_slides": null,
  "speakers": [
    "timour-kosters",
    "nicole-sun",
    "dc-posch",
    "janine-leger"
  ]
}