{
  "id": "building-developer-communities-101",
  "sourceId": "JXTVQA",
  "title": "Building developer communities 101",
  "description": "Even though there are a large number of communities in the web3 space, most of them get into the events trap and lose out on building an organic builder community.\r\nIn my lightning talk, I will cover a series of tips and tricks from my experience of building developer communities.",
  "track": "Developer Experience",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DevRel",
    "Best Practices",
    "builder",
    "community",
    "Best Practices",
    "DevRel"
  ],
  "keywords": [
    "community",
    "building"
  ],
  "duration": 464,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "2og2d0Xxc3I",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673315c83a168eb53508c3e4.vtt",
  "transcript_text": " The Hi, welcome back everyone. Hopefully you had a nice break, had some snacks and freshened up because we have another hour of exciting lightning talks today. We'll have six speakers in the next one hour and they will be covering three tracks. The developer experience, layer two and also real world Ethereum. So let's get started. Anyone who's at the door, please come forward and we'll keep the previous throw ball game. Whenever you have a question, please raise your hand. I will throw the ball to you. And remember, it's also a microphone, so please speak towards the black circle on top of the square. Okay. We have next our lightning talk speaker, Guillen. Guillen is a tech geek from Starknet Foundation, and she's going to share her own experience about how to build a vibrant developer community. Let's welcome her. Hi everyone, thank you so much for coming. My name is Gyan and I'm based in Bangalore, India. I'm a developer advocate with the Starknet Foundation and I've also co a potential successful process to build a developer of, you know, empathy, collaboration, and just your willingness to kind of make this community better, right? So how do you start? Where do you start? When you're thinking about building communities or building developer-focused communities, right? The first thing is, and the most important, as you can see, important stuff that comes in your email, right? Find your persona, right? Who is your main developer persona? We have different types of developers at different learning stages. We may have freshers who are just out of college, right? They are complete beginners. They have no development or domain experience. In that case, you're offering them knowledge in bridging that gap of getting into development and then being able to get them into the domain that you're building your community for. Your audience could also be people with basic development experience, but may not have domain experience. So for example, web three is one of the domains where if you're interested in building a developer community, then you want your audience to already have some basic programming experience, right? It would help them become much better web three developers if they already know how you know, if loop if and loops and all of those things work, or maybe you want to build something which is much at a higher level. So they have some domain understanding, but want to build stuff. So maybe your community is just for builders, right? People who want to build interesting projects, interesting businesses. Or maybe you have a niche domain, which is just for experts or based on diversity, etc. Once you identify this persona, half of your work is done. But make sure to be very, very straightforward in terms of who are the people that your community is catering to. If you want to cater to everyone, it will be a huge problem, right? And it will be a very hard path to build anything viable. The second is that the persona that you have chosen, write down a journey that will work for that persona. How will these people learn from your community? And make sure that the journey includes closing the loop, right? I say this to everyone who is planning to build communities or trying to work on building communities, that you need to figure out what will be the end goal for that developer who comes into the community. Will they get jobs from your community? Will they get support to become entrepreneurs? Will they get funding? What will be their goal, right? This is the second thing that you have to crack. And you have to really sit and crack this, right? Are you offering education? Are you offering entrepreneurship support? Are you offering education? Are you offering entrepreneurship support? Are you offering networking? What is going to be a journey of that developer who enters your community and they exit? By exit, I mean they have found something valuable from your community and then they are the ones who are going to give back to your community. So for example, I just put up an example of maybe a community that is catering to builders on Ethereum. So their ideal journey would be getting educated about Ethereum, which is what you could potentially offer, or build their portfolio by working on projects within your community. Maybe a research focused community, right? Or a builder focused community where you have opportunities for people to build businesses. Or, you know, you're a community that is focused on fundraising, supporting entrepreneurs, right? So a mixture of one and two is what you have to crack first. Everything else that comes after is just a bunch of slides with not much wordings, right? So you need to collaborate, right? You may not be able to offer everything. So collaborate with other communities who may offer parts of that cycle for your community members. So their success will also be attributed to your community's success, right? And how will you sustain long term? A lot of communities are springing up every day saying that our mission is this, our vision is this. But have you thought long term? How are you going to pay the people who are working in your community? How are you going to incentivize the volunteers? What is it going to be for them? Is it going to be a sort of incentive that I'm satisfied after volunteering for this community? So you need to really think about what that long term sustainability for your community will look like. And last but not the least, community is all about people. So be empathetic and make sure that you're starting small on a small scale, talking to builders, talking to people who are your ideal community persona and build from there. So you can focus on quality over quantity, which should be your final aim in terms of community building. And yeah, that's me, Gyan, and if you have any questions around community building, Web3 community building, or just developer community building, feel free to reach out to me over my email. That's both my Telegram and Twitter, at Gyan Lakshmi. And yeah, I'm super excited that you're all here to listen. If you have any questions, happy to take that. Thank you, Gyan.",
  "eventId": "devcon-7",
  "slot_start": 1731400200000,
  "slot_end": 1731400800000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1jkv8pKTuI6m3JNnCg4Deeyb6gn7FhIcRIC_N_qPtTsY",
  "resources_slides": null,
  "speakers": [
    "gnana-lakshmi"
  ]
}