{
  "id": "building-experience-insights-from-dapp-learning-how-to-create-a-thriving-ethereum-focused-community",
  "sourceId": "9FPGBW",
  "title": "Building Experience Insights from Dapp-Learning: How to Create a Thriving Ethereum-Focused Community",
  "description": "Building the Dapp-Learning community has been an exciting and insightful journey. It's more than just a collection of developers; it’s about fostering a space where like-minded individuals can grow, collaborate, and innovate in the Ethereum ecosystem. I will share the experience to  build a Ethereum-focused  developer community.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DAO",
    "DevRel",
    "Public good"
  ],
  "keywords": [
    "developer",
    "community"
  ],
  "duration": 527,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "3g60qYUZoa8",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67331e0c3a168eb5353bd91e.vtt",
  "transcript_text": " Good afternoon everyone. I'm Yan He from Deep Learning. It's fantastic to be here to share our journey of building deep learning. And hope our three years of building experience could offer you some inspiration to build your local Ethereum community, especially with limited or even no startup funds. My presentation will cover three areas, the learning introduction and its main components. Then I will work through our community governance, the rules that keep us organized and collaborative. Finally, I will show how we get grants in Web3 ecosystem and how we allocate our funds to support our community groups. Since the last DEF CON in Bogota, I have introduced web learning in detail, so this time I just quickly recap the introduction. On the left side is our community relevant data we are designed for developers to step into blockchain type development where they can learn define mft doll and the crypto projects we help we could not only give junior developers a feasible and easy to use step learning roadmap but also present advanced developers with a plan for communication and cooperation. Yeah, this is our version. Our community is built on four components, GitHub, OSU, translation team, and website team. Let's start with our GitHub. Our initial idea was just to create a GitHub repo to record our learning trace of the development in 2021. To our surprise, it was more popular than we expected. Currently there are 80 basic tasks that help you to learn development step by step along with advanced tasks like NFT, DAO, crypto, etc. Now we have garnered more than 5,000 stars and nearly 200 contributors have submitted their requests to our repo. What's more exciting, our repo frequently appears on the airdrop list of many Web3 projects. Next, we call it DevLearning Open Source University. As many community members can schedule a session to share Web3 knowledge, as long as his presentation doc is reviewed and approved by our core contributor. We reward each session with 160 DAI through OSU. We have produced a wide range of courses including a comprehensive DeFi learning roadmap and a GKE introduction course. Next is translation team. The world of blockchain is full of our source of temptation and scans. So it's essential for newcomers to study structured course from famous universities. So our team have translated MIT open course blockchain and money. We also translated many white paper and research reports into Chinese, too. As a local EtherWing community, we try our best to make high quality content from English word accessible to our core members. Next is our DAO governance. Governance are important to attract developers to build a community trust and to build a community trust. There are three interesting rules of our community. They are working well. Anyone who has submitted PR three times or has shared at least one time can join our developer group. It has a selling of 120 people. We also build a community group for free communication too. If you wanted to make an advertisement in our group, you should share first. The last part is our grant and our fund allocation. As a non-profit organization, our funding primarily comes from grant and donations, like ESP grant and the Gitcoin grant. In the middle term, we also get support from many outstanding project teams, such as Optimism, Scroll, StarNet, CKSync, etc. This year, airdrops from Web3 projects are also a big source of revenue for us. The financial module enables us to remain a technology-neutral stance. We are only focusing on Ethereum and Islayo2 development without any commercial biases. This slide shows a support from... Okay, sorry. This is our fund allocation, you can see. We set up community grants and Web3 use grants to help developers transition from Web2 to Web3. This is our recognition from the industry. This slide shows the support from Layer 2 projects. Lastly, let me show our sponsors. Thanks for their support for our community. Okay thanks for your attention and I'm open to any questions you may have. Feel free if you want to join us. We have a question here. Do you want to throw it? Good catch. Okay. Yeah. Thanks for your sharing. And I think we all know building and maintaining the community is not easy. And that planning definitely is a phenomenal success. Could you tell me or share your experience about what's the biggest problem or challenge during these years? I mean, in terms of education or the management. That's a really good question. Let me think for a while. I think that the most challenging is the same as the most developer came across too, is the ZK technology. As you know, we have produced a course of DeFi learning roadmap. I think it is a good motivator for developers to learn DeFi. But we find it hard for developers to learn ZK or make ZK easy to understand for newcomers. So we still try our best to make it easy, accessible to everyone. Okay. Okay, thanks. Thank you. Any other questions? I actually have a question for you. So for your users, I guess they're all geographically distributed in different places. Do you think there are specific designs that is more attractive to certain group, either age group or geographic locations? Do you find them tend to use the app learning in different ways? Actually, our users are mostly from Chinese-speaking areas. I see. They're mostly Chinese. Yeah. The most of them are developers. Yeah. Because our content is more technical, you see. Most of them are developers. Because our content is more technical. Technical, right. I see. So we try our best to make it accessible to non-developers too. Thank you. Thank you. Thanks, Yanho.",
  "eventId": "devcon-7",
  "slot_start": 1731402600000,
  "slot_end": 1731403200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1V_J6YbuL2ThEQuDEoLf9zCN3vAnn9d3pOrEfEmHUw0E",
  "resources_slides": null,
  "speakers": [
    "yan-ho"
  ]
}