{
  "id": "building-resilient-teams-navigating-the-web3-ecosystem",
  "sourceId": "YDRT7T",
  "title": "Building Resilient Teams: Navigating the Web3 Ecosystem",
  "description": "The panel will consist of Evin McMullen (CEO, Disco), Olivia Smith (COO, Moonsong Labs), Rachel Brissenden (UETH, EDCON), and moderator Bridget Hearst (Director of Marketing, Moonsong Labs) as they explore strategies for building resilient teams across various Web3 sectors. Discuss the importance of resiliency in Web3, its unique challenges, and effective practices for fostering strong, adaptable teams in a decentralized landscape.",
  "track": "Coordination",
  "type": "Panel",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Coordination",
    "Values",
    "Best Practices",
    "adaptability",
    "Best Practices",
    "Coordination",
    "Values"
  ],
  "keywords": [
    "team building",
    "strategy",
    "culture",
    "adaptability"
  ],
  "duration": 3319,
  "language": "en",
  "sources_swarmHash": "445c2341a4f3e783b9f2e569f2f3ffb18ffbb93c1a3fb2263484eee0f0c56eea",
  "sources_youtubeId": "payFlKyZ_tw",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736f8c074749a4b899c4c0f",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736f8c074749a4b899c4c0f.vtt",
  "transcript_text": " Hello, hello. How is everybody doing today? Last day of DevCon. We are super excited to be here talking to you about building resilient teams, navigating the Web3 ecosystem. And we have three incredible speakers today. Our first panelist, we have Evan McMullen. She's a visionary in the Web3 space with such a robust background in both blockchain and enterprise tech. She's the co-founder of Pravado ID, where they're focusing on transforming identity verification across digital and real-world environments. And she was previously the founder of Disco.xyz. With leadership experience at Berkshire Hathaway and ConsenSys, Evan has really been at the forefront of advancing decentralized identity and data solutions. And fun fact, Evan and I met while we were students at Yale University, and here we are years later together. So, and our next guest, we have Rachel. And Rachel's been working in the blockchain space for years as a founder, best-selling author, and global public speaker. She's really passionate about sharing knowledge and building community. She has been very active with the base and Coinbase ecosystems, founding Onchain Media, where she runs a podcast and Twitter spaces. And she's co-founded Incentives with Perlabs with Mr. Miggles on base team. And additionally, she works with the city of Berkeley to promote blockchain use cases at a municipal level. And our final panelist, Olivia Smith, is the COO of Moonsong Labs, where she directs operational strategy and scales a company's impact in Web3 innovation. She was formerly the VP of strategy at PureStake, where she played a key role in launching Moonbeam. And she also has a background in finance finance having spent four years in TradFi prior to blockchain and she also holds a joint JD MBA from Columbia University. So welcome to these panelists. Let's, why don't we kick it off with, you know, let's start simple. To each of you in a sentence, what does resilience mean? To each of you in a sentence, what does resilience mean? I think of resilience both in a very sort of literal technical sense, as well as the human sense, the ability to withstand friction, disruption, to maintain integrity, and to maintain process and success despite shifting conditions around you. When I think of resilience, I don't know, I was doing a Twitter space with this MMA fighter who was talking about, you know, getting knocked down repeatedly over and over. And I feel like in our space, we are really fighting this good fight for the greater good. And after getting knocked down time and time again, I think resilience is, you know, the ability to pick yourself back up and realize, okay, we are working towards a greater good, and this is a fight worth fighting. So I think it's just getting up, you know, and if you get knocked down, just get up and keep trying. I feel like that's resilience. I like that image of just keep getting up. For me, it's like, you know, it's obviously persistence, but it's this like mental fortitude. I think when I think of it, it's like as simple as being able to sustain so you can succeed. And so it's something that's consistent, that's always there that you have to keep cultivating, but is key to success. So looking at these definitions that you all just provided, how do you instill these sort of core values of resilience that you just defined within your teams? So the only thing that is certain about the blockchain industry is that we can guarantee uncertainty. I'm sure that all of you here have experienced various different swings of market cycles, introductions of new political influences, social influences that change the dynamics in which we operate every day, both from our technical resilience and the challenges of new adoption or new capabilities or even errors that we find along the way, as well as the human beings coordinating these systems who need to be able to accommodate themselves. At Privato ID, in our practice, we have an incredibly diverse team. Our teammates represent nations across the world, as well as backgrounds that are incredibly diverse from more traditional to pretty degenerate. And it is through that range of experiences and perspectives that I think we find resiliency and strength. The opportunity to invite points of view that might not occur to you. In fact, the invitation to disagree rigorously and respectfully. You know, raising one's voice because you love your users is never a bad thing on my team. And so I think that through open communication, deep consideration for what success looks like, and a shared understanding that the ground under us will always shift. These principles, you know, this way of being has been working so far. But of course, as I say, with all technologies and all processes, we will work for as long as this serves us. And when we find something else, we will do that instead. Mic drop. Yeah. When we find something else, we will do that instead. Mic drop. Yeah, so I feel like what creates a resilient team in my eyes is, I don't know, I'm a big proponent of really understanding your why and the purpose behind what you're doing. When you have a strong enough why, you figure out the how. And the teams that I've seen make the most waves and make the most progress, they're tapped into this greater mission and greater purpose. progress, they're tapped into this greater mission and greater purpose. And they just do it with such conviction like Evan here, you know, just constantly showing up and realizing, okay, what we're doing is so important for the greater good. What we're doing is, you know, what I'm doing is aligned with my purpose every day. And I think that excitement and that joy to be a part of this positive change globally, I think is what is behind the energy of resilience. Yeah, I agree. And I think, Evan, what you spoke to is like psychological safety in a work environment, being able to speak up, being able to have debate. I think that's crucial to a part of a culture. I think it really comes down to people and purpose. And you talked about that of like you have to have a greater good that you're solving for. And you have to give people purpose for the work that they do day in and day out. And then I think a key part is you've got to invest in people. And investment is not just paying them. I think that's really key. It's recognition and appreciation and not just accepting work, but actually talking about all the work they put into it, talking about what they learned from it. And I think, you know, to add to the psychological safety that you mentioned, Evan, I think there's this aspect that everything should be a learning opportunity, the long-term purpose of what you're building for, but then you also want to have, like, a personal purpose of I am developing myself. And as a leader, you want to invest in that, bringing in outside speakers, investing in them learning stuff that's not even just like related to their direct work, but cross-cutting across the company. I think a lot of times we get really focused and siloed on our direct work, and we don't realize that people can learn a ton from whether it's the marketing department, the business development department. There's just a lot that we can take advantage of. So investing in people, I think, is the key to resilience. Can I add one thing there? Okay, so another big component that I was just thinking of, and I feel like Evan has always understood this, but it's also having fun. I actually, I went to Doge Day in Tokyo recently in Japan, and, you know, they were actually honoring the life of a big community member in member in the community named Julia Love. A quote from her is if it's not fun, it's not sustainable. I feel like we're seeing the rise of all these meme communities and people are realizing, okay, this is fun. We can rally around this and celebrate community. So I feel like fun is a big component, too. Being connected to a greater purpose and having fun. And Evan's always got that. She's got a disco ball on stage with us right now. Head of fun. So, you know, I think that a lot of things like this with, like, resiliency, there's sort of these kind of higher level, almost, like, philosophical questions of how we approach this and discussions about this. But if you were to, like, measure resilience and look at metrics, as we're in a very metric-driven industry, what would you say are some things that you could look at for that? Burnout, attrition, uptime, transactions per second. Mic drop. No, but like, for real though, when we talk about metrics, it's a challenging thing to try to apply across the board, because every team is different, every human experience is different. But what I can tell in terms of measuring the health and resilience of our community is that the number of chairs in this room far exceeds the number of chairs in the room in 2018 in Prague at DevCon when I first learned about the work of my now co-founders, the Iden 3 protocol. The ecosystem around us has scaled significantly such that there are a lot of new faces and many that remain. But whether it's through the difficulty of the work that we do, the pressure of the dynamics and constantly changing ecosystem, it's a challenging place for everyone to build resilience, for every team to persist. And so through the natural emergent progress of Ethereum, I think it is organic that not everything will stay the same. And in fact, the ability to adapt and change and to jettison what no longer serves us I think is part of what makes that resilience possible. I know I am definitely guilty of hanging on to some ideas for a little too long even when it was clear that they may no longer be viable whether that's a signature scheme or a you know particular way like state channels. I thought that was gonna happen turns out we went with layer twos. So, you know, the ability to receive that new information and iterate, I think, is also, you know, important in the ways that we measure who's here and how it's working. So I think team by team, it's gonna be, the metrics are gonna be individual to what the purpose is, but I think kind of a universal metric",
  "eventId": "devcon-7",
  "slot_start": 1731647400000,
  "slot_end": 1731651000000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1mYc9MY0LQHKBFJ4LpR5hSBWXay5VfaXFYGB_2fn3Tk4",
  "resources_slides": null,
  "speakers": [
    "evin-mcmullen",
    "bridget-hearst",
    "olivia-smith",
    "rachel-onchain"
  ]
}