{
  "id": "can-zero-knowledge-and-blockchains-help-humanity-survive",
  "sourceId": "ZCHNUF",
  "title": "Can zero-knowledge and blockchains help humanity survive?",
  "description": "While someone is building one more NFT marketplace rn... I claim that blockchains, privacy, and verifiability can disrupt, heal, and modify the world around us for real: spacetech, agrotech, biotech, AI/ML, neurotech, and many other domains have a fit for our beloved technology.\r\n\r\nBased on dozens of interviews with ppl from other industries, I want to share the most unexpected, exciting, and urgent use cases e.g. satellite coordination, post-nuclear war recovery, and LLMs presumption of innocence",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Developer",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Zero-Knowledge",
    "Use Cases",
    "Product-market fit",
    "privacy-preserving",
    "blockchain",
    "Product-market fit",
    "Use Cases",
    "Zero-Knowledge"
  ],
  "keywords": [
    "Future of humanity",
    "Ethereum prosperity",
    "privacy-preserving blockchain"
  ],
  "duration": 435,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "EyjhtZX_kWE",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673836c71b0f83434de919a3",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673836c71b0f83434de919a3.vtt",
  "transcript_text": " speaker who will talk about how their knowledge and blockchains will help help humanity survive. Please welcome Lisa Akelsrod. Hello everyone. This is a lightning talk meaning we don't really have any time for jokes. sorry for that. We have to start being very serious from the very beginning. So the question I'm going to talk about today, the problem is that we are very small. Like as a blockchain industry, I mean. On this picture you can see how the rest of the world is trying to see what is blockchain. If you want some more specific numbers if we compare our industry to other tech verticals like space tech or biotech we are something like 10 to 40 times smaller. Frankly speaking we are like a small dot. But I think we need to be large. If we want to our industry to prosper and take a meaningful place in the world. And I think we need to learn from mushrooms how to be large. What's the difference between blockchain and mushrooms? Blockchain is a three-mushroom network. And mushrooms are a three-trillion-mushroom network. Three-trillion-mushroom network is a really cool thing. Whenever someone sees it, they want to jump in because if there are 3 trillion mushrooms who joined, it seems to be worth it. But three mushroom networks seems to be a bit a doubtful activity. So we need to become mushrooms. That is to say, it is on us as a blockchain industry to find use cases where blockchain and ZK are a perfect fit for huge world's problem. And furthermore, it's on us to communicate it to right people in right industries and in right countries around the world. Because I can guarantee you, they will not figure it out on their own. First because they don't think about blockchain, then because they don't know about zero knowledge. So today I'm going to, just as an example, give you three real-world use cases that are crucial for humanity's survival. And I'm going to use the formula of ZK for verifiable computations and blockchain for coordination. Think, for example, about the space. Think, for example, about satellite coordination. There are many example, about the space. Think, for example, about satellite coordination. There are many countries operating in the space, and many of them are not friends. But still they have to coordinate their activity in the space. How can China prove the US that their satellite won't clash into some US space facility? What they do today, they ask, you promise? Yes, I promise. But what if they use zero knowledge proofs for proof of proof of proof of hitting the specific coordinate instead of just promising? But how should they coordinate these tons of zero knowledge proofs by hundreds of parties for thousands of satellites 24 to 7 without disclosing any sensitive information? They can use privacy preserving programmable blockchain. I think about agriculture. In many countries, agriculture is run by self-piloting machines like computers with software running on it. If tractors, cultivators and balers are out of operation for the whole country, its economy stops and the country is in deep economic crisis. How can a small human force thousands of machines with different programs running on top to report them what's on their mind using zero knowledge proofs? But what about a network of thousands of machines and thousands humans transmitting zero knowledge proofs in arbitrary directions 24 to 7? With privacy preserving programmable blockchain. I think about nuclear missiles I know this is not the favorite topic for most people but just for 30 seconds if a country a has a concern that the country be launched in nuclear missile towards it is president has several minutes less than five to call their president ask did you do it but and if the president didn't answer they must launch their all their missiles as a prevention. But can we prove that something has not happened? Can one prove that they have not launched a nuclear missile? If they did, can they prove that this particular country is not a destination? I don't have 100% answer for this one, especially if we can prove that something has not happened, but I think it might be doable, and I think it's worth thinking about it. So, can zero-knowledge help humanity survive? Yes, sure. Can blockchain help humanity survive? This is a bit trickier, but yes, but it must be privacy preserving programmable blockchain no privacy no blockchain adoption that simple that's it thank you Thank you for interesting talk. I also strongly believe that blockchains and their pro-knowledge will help humanity to reorganize in the future. Thank you again. We have some time. Okay, then let's try to kind of stay together because the next lightning talk will be started in two minutes. Thank you. May I answer the fourth one? Yeah, if you want. Yeah, about proving to the partner that someone is not cheating. If you are a computer, I think, and she's a computer, I think it is very easy. If one of you is not a computer, it is tricky because when it comes to bridging data from the physical world into the digital world. From my perspective, this is still a very tricky thing. And it wasn't resolved so far. There was a paper in 2013 written by some Princeton guys about utilizing zero-knowledge proofs for monitoring the state of nuclear facility. And they assumed that there is some nice solution to like an a nice solution for a Oracle from physical world to the digital world but up to now there is no such solution as far as I know and that's why all the cases I described they are digital and native from the very beginning so something exists like a piece of code from the very beginning like self-piloting machine or like satellite",
  "eventId": "devcon-7",
  "slot_start": 1731641400000,
  "slot_end": 1731642000000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1lN3h53WUwFynoQ5vR7IcSTB74eoYrpCJWu2YVtIjyTw",
  "resources_slides": null,
  "speakers": [
    "lisa-akselrod"
  ]
}