{
  "id": "common-knowledge-machines",
  "sourceId": "XJPE8K",
  "title": "Common Knowledge Machines",
  "description": "Common knowledge is a precondition for collective action. Yet, increasing polarization in information ecosystems risks undermining common knowledge formation. This talk introduces Community Posts, a mechanism that leverages diversification and zero-knowledge proofs to help people identify divides, bridge them and find common ground, fostering greater common knowledge in social networks.",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": true,
  "doNotRecord": false,
  "tags": [
    "Censorship Resistance",
    "Collective Intelligence",
    "Consensus Mechanisms",
    "Coordination",
    "Identity"
  ],
  "keywords": [
    "Stellar",
    "Punk"
  ],
  "duration": 1057,
  "language": "en",
  "sources_swarmHash": "2fadd824928c32a979645300678ee71dea6d46f238ba5f1acf48e3791e8e8005",
  "sources_youtubeId": "6VJYBNZioHg",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673356d73a168eb5357cf419.vtt",
  "transcript_text": " All right, so let me get this on the right slide here. Common knowledge. So what is common knowledge? Why does it matter? So common knowledge is not just that you know I'm standing here, it's that you know that I know that you know ad infinitum. It's a very different thing than just knowing that I'm here. And a classic example of this is the Romanian Revolution in 1989. For years, everyone knew that this dictator, Chia Ceausescu, was a tyrant, but nothing ever happened. And it wasn't until actually a simple act during one of his public speeches, a live broadcast whistle that cascaded into many whistles, that a revolution began. And the key wasn't just that everybody saw, the key was not just that everybody was unhappy, but they saw that everybody else was unhappy. So we've had similar moments in American history. I'm American, so that's my history. But my contention is actually common knowledge is getting harder to get off the ground. And that's because of increasing political polarization. And while political polarization predates the internet, it certainly has been accelerated in the digital age. And why is it so bad? Well, if we can't find common ground, if we can't have shared beliefs, then collective action becomes really hard, and collective action is the stuff for political movements and also for government and legitimate governance. And so on the international stage this is really important important so unions stay unified and can differentiate their allies from their adversaries and marshal support and not collapse into the chaos of competing narratives which we seem to be trending towards. And also common knowledge lets us solve higher forms of cooperation problem, for example, like climate change that requires consensus and agreement about the facts. So since this is DevCon and an Ethereum conference, it's worth acknowledging actually that Ethereum itself is an example of a common knowledge machine. It produces or it seeks to actually produce an immutable ledger about shared global state. Another obvious example of common knowledge machines are things like blue sky, forecaster, lens, or X. These are the functional equivalent of public squares, but actually online. But of course here, common knowledge rarely ever gets off the ground, and instead we just have divisions and competing narratives about reality and which one is true. So today I want to introduce a quick mechanism and outline on the principles to sort of nudge your thoughts, and you can read more if you want in my writings. So the idea is called community posts, and everybody here who participates in some social media platform has some set of followers. And the idea is instead of blasting a post to all of your followers, you first stress test a post across different groups of followers who don't necessarily talk, listen, or agree with one another to gauge what resonates before it's widely shared. And so here's how it works. If you look at your followers, your set of followers, they actually all have differences in behavior measured by their likes, their reposts, who follows them, and who they follow, their connections. And you can aggregate this information about observed behavior using things like ZK-SNARKs and put people in clusters as represented by circles here. And the idea is that you pick a subset of uncorrelated followers on your social graph, people who behave differently on the platform, balance for reach with a minimum diversification threshold. Now, these polarity subsets aren't an echo chamber. What they are is a sampling or a random sampling of some set of your followers balanced across different perspectives. And there'll be multiple subsets to choose from. For example, you can handpick key anchors or key thought leaders or experts and then diversify against them in different combinations to fill the remaining set. Now, once you pick your subset, you send that post to the subset with a zero-knowledge proof confirming that recipients follow you without revealing your identity. Now some might disagree with the post and send ZK feedback to you, but some might actually take it further and pass it on to subsets, polarity subsets of their followers. And these rounds repeat forming a tree of polarity subsets across the social graph, which essentially pushes your post across very diverse parts of the social graph, allowing you to gauge cross-tribal appeal at every step and every layer through repost rates and feedback. And of course, if people receive this, get a notification, ZK posted by the end people you follow, or end people you follow boosted this post, and so on. Now, the final step is the post goes public. Once it gains enough support across and reaches that diversification threshold, and it's passed its social stress test, then the post goes public, and you can merge into your open feed, and anyone who has reposted it can post it to all their followers, and so on. And then, you know, any remaining divides as represented by red here on these red parts of the social graph, you can use community notes, which we're all familiar with, to bridge and add context. And this is really low-hanging fruit divides. So anyways, this is the summary of the mechanism. I think it works because essentially what you're doing is you're reversing the cycle that happens on social media of context collapse, controversy, cancellation, and capture. And these are things where social media leverages divisions to create more divisions. And you reverse that cycle with diversification, discounts, and bridging to restore common ground. Okay. I think that's it for five minutes. I can take any of your questions. Thank you, Chris. I think that's it for five minutes. I can take any of your questions. . That was kind of a complex mechanism for five minutes. Who wants to ask a question? Who wants to ask a question? Here, please. This is amazing. What do we do next? What's like a next step here? Yeah, so there are a lot of experiments with social graphs right now in Web3. FarCaster and Lens are an example. And so you can leverage like ZK-SNARKs, zero knowledge proofs to actually calculate this information without revealing the identities and participants in a social graph and start leverage like ZKStarks, Zero Knowledge Proofs, to actually calculate this information without revealing the identities and participants in a social graph and start to create a more meaningful parallel attention feed to show, OK, what are posts where there's wide agreement on? And instead of focusing on the attention and the rage bait that comes from a global attention auction, you can focus your attention on, OK, well, what are the things where there's agreement and then build on that agreement? Yeah? We can have one more question. Do you envision this being applicable to, like, more popular social media, like maybe a plug-in for Twitter or whatever? Yeah, it could apply to any social media. It could apply, it's a roadmap for making X a common knowledge machine. I think that actually was always the aspiration around a public square and the Ceausescu example. It's also applicable to TikTok. It's applicable to really any social network. And it's just a more intelligent attention mechanism, right, that gets us, that sort of reverses the cycle of let me, you know, hit my dopamine receptors with division towards, let me see what I can find common ground with and build on that. Okay. Thank you, everybody. Thank you. Thank you. I'm a fool I'm a fool I'm a fool I'm a fool I'm a fool I'm a fool I'm a fool So for this Wasim, he will not He don't want to use the modern leader Yes And you just growing up and then you're all, you know, like, in the state, and then you're going down, and after that, you just wait until it wasn't finished over. You know, just like that. Okay. Okay. Okay. Are you ready? Oh, yes, I am. Okay, everyone. Next, we have The Shane Male Gaze by Wazim Z. Alcindi. Please, give him a warm welcome. Hello, everybody. It's slightly out of place to have such cheerful music introducing this talk perhaps so the title of it is called The Chainmail Gaze and hopefully the reasons for that will become apparent as we go on but I'm sure you've all heard of the mail gaze and the kind of externalities and you know unfavorable things that come with that but what about the chain male gaze well hopefully we'll find out not got very long so i'll try to you know give you a survey of what's actually quite extensive anthropological and philosophical research project okay some pictures of big strong men and their swords looking into the distance, perhaps thinking about lands to conquer. Short poetic refrain, the church and the network, zeal and time, death and money, all sides of the same coin. a phwysig, pob rhan o'r un coin. Rwy'n hoff i siarad â chi am brosiect cymhwysol sy'n arwain at y lle rydyn ni'n mynd i, a'i enw'n enw'n ymwneud â'r ddyfyniadau ar gyfer cyfrif, yn edrych ar y in the technology space that might not be immediately apparent. For as long as there's been financial capital, risk and speculation have orbited, manipulated and harnessed it. As narrative feedback machines, simultaneously reading and rewriting realities, markets exist as a distributed conversation among speculators driven by profit motives and appetite for divination and prophecy. Today, new strains of techno-colonialism are emerging, which are the latest of a series of echoes throughout Western history. An ascendant cabal of technology elites are attempting to reshape the world in their favor whilst hiding in plain sight behind the technologies that have enriched them. Theirs is a Promethean zealotry without faith, affecting an aura of divine sanction for the purposes of elevating the ego, enriching the chosen ones, and creating empires of various stripes. But was it not? Always so. I want to read you a short story, fictional speculation, about where we might be going in the future. It's called Seething Like a State. Decentralization has a cost, the price of anarchy. The price is always due, but the rewards weren't cheap to reap. So solid, CCRU. What most did not expect was that payment would become due at the grandest scales of governance. The West failure state, forged under the fire of peer pressure, was ambushed by upstart modes of power, opening new vistas of communication, commodification and communion. The orientations that nation states had used to enshrine their power only made it easier to undermine them. The bigger they were, the harder they fell. Brextopia, the European Union, NATO's cave, the United State machine, all returned to dust. The decline of the nation state in the roaring 20s became a canon of canonicity for an entire generation of sole traders. It wasn't even just the bit leavers. In those days, there were many networks, many messiahs, many ideologics, all with their own profit motives. So many of you have doubtless heard of this concept of the network state that has emerged in the last few years. Exit fantasies, arguably fueled by the failure or the shortcomings the shortfall of the full promise and the dream of web3 i'm going to read you a short section from belagi's universe self self-titled book from 2022 a network state is a social network with a moral innovation a sense of national consciousness a recognized recognized founder, a capacity for collective action, an in-person level of civility, an integrated cryptocurrency, a consensual government limited by a social smart contract, an archipelago of crowdfunded physical territories, a virtual capital, and an on-chain census that proves a large enough population, income, and real estate footprint to attain a measure of diplomatic recognition. The magic words in here are recognized founder and diplomatic recognition, and territory, I would say. So these projects carry echoes, in my mind at least, of some of the earliest expeditions set out from the West in search of new territories to conquer and subjugate. So many of you have doubtless heard of things like Liberland, Sealand, Seasteading Institutes. This is the Zahidi-designed Metaverse HQ of Liberland on screen here. There's been so many attempts to make like crypto islands, Bitcoin cruise ships, and they've all failed. It's quite interesting. But what seems to be different now is the level of capital on hand as a result of market success of these technologies to the people that want to reshape the map of the world in their own, you know, to their own preferences, into their own cause. We know that leaders of nation states, we even have leaders of nation states that are cheerleading some of these technologies. Nayib Keri, the authoritarian strongman in El Salvador, would like to build a Bitcoin city financed by volcano bonds in his country. He's not done it yet. But meanwhile, he's removed the judiciary, removed term limits, and instituted one-party rule. And most of the Bitcoins are cheering this on. So I ask myself, are we still in this for the freedom? And now, you know, made possible by Ethereum, DAOs, and all the rest of it, we have projects like Aleph, Urbit, and even Praxis. Praxis on the left and Prospera on the right. So these projects are trying to build physical cities, private territories, network states, or at least what may develop into the Bellagio concept of the nation state. And it's at this point I want to introduce the chainmail gaze. Today's tech overlords are the descendants of Europe's crusaders well-financed zealous fanatics wreaking destruction on the planetary other in the name of their greater good the Vatican sponsored waves of Levantine invasions that began in the late 11th century with a midwife of capitalism, colonialism, and technology as we know it today. With the network state organizational concept, a cadre of powerful ideologues blessed with tokenized wealth, a toying with the prospect of reshaping national frontiers, mirroring the desires of Frankish noblemen and their nightly orders in the Levant a thousand years ago. And that's all the time I have. Seven minutes for a thousand years of Western history. Thank you very much.",
  "eventId": "devcon-7",
  "slot_start": 1731409200000,
  "slot_end": 1731409800000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/1a63MEhn5HWzDRARwTVIqwlXGcTuEurRAij2MM5-ACMI",
  "resources_slides": null,
  "speakers": [
    "puja-ohlhaver"
  ]
}