{
  "id": "comparing-slashing-penalties-on-proof-of-stake-networks",
  "sourceId": "YJZT3K",
  "title": "Comparing Slashing Penalties on Proof-of-Stake Networks",
  "description": "With the support of the Ethereum Foundation, we have performed an analysis of slashing penalties on the seventy largest proof-of-stake cryptocurrency networks. Using insights from institutional economics and game theory, we consider variance in slashing penalties in terms of the conditions that trigger slashing, the magnitude of penalties contemplated, and the limited cases where human judgment plays a role in determining such penalties.",
  "track": "Cryptoeconomics",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Governance",
    "Game Theory",
    "Economics",
    "slashing",
    "Economics",
    "Game Theory",
    "Governance"
  ],
  "keywords": [
    "Slashing"
  ],
  "duration": 374,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "frKyGtUTvi0",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67348e1b9dbb7a90e1763ec0",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67348e1b9dbb7a90e1763ec0.vtt",
  "transcript_text": " I'm diving right in because boy do I have a constraint. I mean those of you who know me know some of my thoughts last longer than five minutes let alone articulating them. comparing slashing penalties on stake blockchain networks, an EF-funded project with Bill Lehrer of Massachusetts Institute of Technology, as well as my RA, Bryce Boogie, at CU Boulder. But to me, automated penalties in a comparative institutional context are quite interesting because they're pretty uncommon in private, coordin contexts. Generally you see the threat of discretionary termination as a hanging penalty to which most employees are subject to in traditional employment contexts. Rewards though are also discretionary in those contexts other than the wages or salary that have been contracted for you know there's end of year bonuses things like that but blockchain is meant to eliminate a centralized discretionary intermediary such that this makes the actual ex-ante specification of automated rewards and penalties more important for aligning incentives in the joint productive context that blockchain networks are coordinating in furtherance to. So to me, you see simple rewards for narrowly scoped joint production, such as the Bitcoin network, but our perspective on these things is they're for more complex joint coordinative purposes, such as what the Ethereum network is assembled in furtherance of, a Turing complete system, we think actually you need both rewards and penalties to have more complete incentive alignment. So this is our economic organizational logic for the emergence of slashing penalties. And to a comparative institutional scholar like me, somebody who worked for the Comparative Constitutions Project, tabulating at a very, very fine-grained level, you know, many, many details about constitutions around the world. That was kind of the inspiration for this project, which was before you can even begin to make inferences about outcomes on different, you know, constitutional contexts or blockchain networks, you need to have a fairly fine-grained tabulation of the existing institutional choices. And so to a scholar that does this kind of thing, it's like, wow, looking out at the panoply of stake networks, it's like, you know, my bread and butter, let's analyze what's going on. And so a very initial kind of takeaway is this is our typology of both penalty conditions, predominantly conflicting actions, double signing, double attestation, omitting transactions. Those tend to be potentially signals of malicious intent. Not certainly, because most of the time they're honest errors, and we view the intent of these networks is to drive the probability of success of a malicious action down to zero. But the problem is, given pseudonymity, given the automated context, you can't distinguish between honest errors and malicious intent, so you've got to punish both. Non-participation, downtime also results in much more minor penalties, but it's quite common as well. What do the economic penalties look like? Either a percentage of stake, a fixed penalty, as well as the foregone rewards from being offline, either temporarily or permanently. Networks like Ethereum also have enhanced penalties as a function during a specific time period in which other validators might be performing potentially malicious actions as well because of the higher likelihood that that could be collusive. Validator removal is either permanent or temporary, and then there's also the possibility that you're foregoing governance. Penalty application can be automatic, conditional, as well as in a few limited cases, including the Q network, discretionary in certain ways. These are our summary statistics. You know, 46 of the 69 stake blockchain networks in the top 100 by market cap have penalty regimes, and these range from, in economic magnitude, at current prices today, between $1.62 to $375,000 for double signing, as well as less than a single penny, up to $36K for downtime. Eight of 46 penalty regime networks have an original code base. The majority are either just based on EVM or Cosmos SDK. Withdrawal queues range from instantaneous to 28 days, with a rough average among 54 stake networks of 11.5 days of waiting. Temporary removal from the validator set is more common than permanent removal, perhaps due to the inability to bar from re-entry with a different network identity due to the pseudonymity of these contexts in the first place. Offline penalties range from foregone rewards to a small fraction of pledged stake. We think this variance reflects these four mechanisms and ultimately in my final moments you might say, why should Ethereum care what's going on in these other contexts? And we think one, Ethereum's strength is their ability to adapt. It's shown the willingness to choose from available design choices in the perspective of wanting to improve. Furthermore, we also think in context where we're increasingly seeing AI agents having both, you know, rewards and penalties to align the incentives of AI agents is actually going to be incredibly important, such that we think the lessons learned on these stake networks are likely important in that context as well. Thank you very much. Holy smokes. Well, that was extremely impressive. If you're uninitiated, Eric has removed all full stops from that presentation. That was fast. That was amazing. Really, really well done. Thank you very much. So I don't think we actually have any questions. So I'd say given the fact that it seemed like you were covering everything very quickly, is there any sort of one key takeaway that you'd like us to... So just to go back to this point is, what does the...",
  "eventId": "devcon-7",
  "slot_start": 1731496800000,
  "slot_end": 1731497400000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1U1W0kONT5CqQY5olh7ieFlQWhiN9s7HXZjQqM1AuBzg",
  "resources_slides": null,
  "speakers": [
    "eric-alston"
  ]
}