{
  "id": "conditional-recall",
  "sourceId": "XTQUDR",
  "title": "Conditional Recall",
  "description": "In the neon-lit nights of 2025, Johnson & Johnson unveiled X. A pill, not larger than a snowflake, but it promised a tempest of change. This miraculous drug didn't just allow people to cherry-pick memories to erase from their minds, it also can credibly leave a reminder in people's minds that those memories has been vanished, forever.\r\nWe explore the game theoretic implications of a technology (such as TEEs) that allows players to commit to forget information and discuss several applications.",
  "track": "Cryptoeconomics",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Mechanism design",
    "Game Theory",
    "Economics",
    "commitment",
    "Economics",
    "Game Theory",
    "Mechanism design"
  ],
  "keywords": [
    "TEE",
    "Commitment"
  ],
  "duration": 1513,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736f9bf1b0f83434ddf1bf6",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736f9bf1b0f83434ddf1bf6.vtt",
  "transcript_text": " Tanya Cushman Reviewer:\"Petra Petrovic' Hello. I didn't know that I was famous. I doubt that very much. Chin is famous. Ooh, yes. So, we will talk first about X. Here's a story, Anon. So, in the neon-lit nights of 2025, Johnson & Johnson unveiled X. A pill not larger than a snowflake, but it promised a tempest of change. The miraculous drug didn't just allow people to cherry epic memories to erase from their minds, it also can credibly leave a reminder in people's minds that those memories have been vanished forever. Amidst the iconic red-bricked walls of Harvard Law School, you with books in one hand and dreams in the other are on a mission. You're not just another student, You carry the hope of revolutionizing the archaic chambers of the legal world. Each night, as you pour over the terms of law, you wonder what greatness society could have achieved. On a cold evening, your phone buzzes. It's Dax, your old college friend, turned underground dealer. His message is simple. Got X? Special price for you. The temptation swirls around you. Would you trade the lessons of the past for a clearer yet incomplete future? The decision rests in your hands and on. Okay. What is conditional recall? First, let me tell you about perfect recall. So perfect recall is the assumption that we usually make in human cognition and game theory and all kinds of strategic interactions, right? We assume that we remember what we have experienced and we cannot choose what we remember or what we don't remember. So we assume that humans just remember. Or at least don't have control what we remember. All of that will change in 2025. But then you have a technology that allows you to conditionally recall information. And in particular to credibly forget. And that is the exploration we do in this project which will be a paper soon we want to understand what are the strategic implications or social implications of a technology that would allow you to credibly forget information and you can do that in such a way that you forget information you commit to forgetting information, if certain kind of conditions are met in the environment. So Johnson & Johnson Expo will be 2025. Before that, we already have artificial agents who have access to conditional recall. So we are very bullish on TEEs sort of as a commitment device because that is a technology where you can use an artificial agent put it inside of a TE and then you can generate attestations or proofs that that agent has erased a certain kind of memory or has sent some send a request to remove memory from an external storage device. And so if you have these artificial agents having access to conditionally called information, then we can do magical things with it. And we want to present some magical things that you can do with that. I talk more about philosophical ideas, but in all of them, I think there is the potential for an actual application in them. And then Shin will talk about already existing applications that use the power of conditionally forgetting information. Okay. First application. that use the power of conditionally forgetting information. Okay, first application. That's a classical problem from this guy, Ken Arrow. And he described for the first time this very famous Arrow information paradox, which is a very basic but fundamental idea. So you want to sell a piece of intellectual property. You have an idea. You want to sell it to somebody. But in order to sell it to somebody, you need to convince somebody that that is actually a good idea. And so if you start telling that person about the idea more and more and more and more and more, at some point, that other party has learned the idea. And then contracting breaks down down because he already knows the idea and then he doesn't need to pay you for it. Conventional workarounds for this contracting problem usually is IP law like you hire some lawyers and they protect your intellectual property. You have patent law and you need to rely on the legal system. Or you can do the classical contracting stuff. You can contract only on the outputs of the technology, but not actually on the actual technology. Then you have all the problems of asymmetric information and contracting. So that's no good. But if you have X, then you can conditionally recall information. You can solve this transacting problem. You commit before the actual selling of the idea that if you don't like it as a buyer, you commit to forgetting the content of that idea. And then the only thing that after the negotiation you remember in case you don't buy the content of that idea. And then the only thing that after the negotiation you remember, in case you don't buy the information, is that you didn't like it, but nothing else. Here's another broad class of ideas that you can do with this technology. One-time use of information. So previously I was telling about selling information. Now we can also think about renting out information, using it only once or twice or conditionally or five times, six times. And Shin has beautiful examples of that as well. Another quote. I don't believe that this story is true, but I would like it to be true. So one of my favorite writers, Jorge Luis Borges, wrote this about 15th century Italian warfare. So in 15th century Italy, he claims war has reached a perfection that many would call ridiculous. Once the armies were assembled, the generals compared the numbers, strength, and position of the troops and decided who among them must suffer defeat, they decided on the outcome of that war. Chance and bloodshed were eliminated. That is an instance of the power of reducing asymmetric information and bargaining. If we are perfectly informed about each other's capabilities",
  "eventId": "devcon-7",
  "slot_start": 1731648600000,
  "slot_end": 1731650400000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/1jXv2kbSefJjmF8zhC0ibw1x1paaVWwuDjrd37N_Nzj8",
  "resources_slides": null,
  "speakers": [
    "christoph-schlegel",
    "sxysun"
  ]
}