{
  "id": "crypto-is-the-real-world-understanding-the-cryptonative-economy",
  "sourceId": "UCZ83J",
  "title": "Crypto is the Real World: Understanding the Cryptonative Economy",
  "description": "Ethereum has often been viewed as a separate, speculative space detached from the \"real world.\" However, recent developments and analyses reveal that the cryptonative economy is not only substantial but also comparable to traditional economies in its scope and dynamics. This talk will delve into the findings of the Cryptonative Economy Reports, highlighting the significant economic demand for Ethereum and showcasing where has Ethereum become the real world already.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Digital Sovereignty",
    "Use Cases",
    "Economics",
    "cryptonative",
    "Digital Sovereignty",
    "Economics",
    "Use Cases"
  ],
  "keywords": [
    "Real world",
    "Ecosystem",
    "Cryptonativism"
  ],
  "duration": 991,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "Y0u6J1OmPXc",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6732f3dccacabd9035b773c0.vtt",
  "transcript_text": " Hey everybody. So crypto is the real world. Today I'm going to try to convince you that crypto isn't a niche anymore, but that in fact it's a blueprint to the future of economy. And one thing that triggered me to pick this topic is that, like, increasingly we started using the term RWAs, the real world assets, which kind of implies that, well, all of the other stuff that we've been using so far isn't the real world. And I actually would like to protest today and make a case about this actually not being the reality. So my name is Joseph. I got into crypto in 2011 thanks to Socroat. Then thanks to Ethereum, I started organizing meetups and started getting my hands dirty. I used to work as a Solidity Dev and Auditor. And then since 2018, I helped the Ethereum Foundation with organizing operations around the R&D teams. And finally, since the beginning of 2022, I started Pondow and started hosting conferences on my own. As mentioned, I used to help with DEF CONs before, so I'm thrilled to see how they've grown. And well, thanks to the team organizing this. I know you can't see the talks, but maybe later this will make you happy. I'll take you to several steps first I'll look at into the terminology what is an economy or what is the crypto native economy and how does it compare to the real world and finally I'll finish out with a quick retrospect of the past few years so what is an economy I'll borrow a definition from the Austrian economics of basically two long-distance reads from Mises and Hayek. An economy is the result of individual actions and choices driven by human purpose and subjective preferences. It is a network of voluntary exchanges and cooperative activities where resources are allocated through the spontaneous interactions of individuals in the market. So we could say it's it's a living organism and here during the talk I'll try to try to describe that living organism very imperfectly because it's very hard to give you the up-to-date numbers so what you see here what you what you're going to see are basically best attempts and estimates and therefore would like to ask you to challenge those numbers and later on reach out or publish articles on your own trying to get those numbers right. Because that's the only way we can actually describe the reality in the best way. So what is the crypto-native economy? With Pond, we've been publishing these crypto-native economy reports for the past several years. And what we attempt is to look into the on-chain revenue. So all of the stuff that happens on-chain as a measurement of that economic interaction, of the demand for using the stuff that all of us are working on. So for the purpose of the reports, we picked L1 fees, L2 fees, and protocol fees. But there is a lot more. So the stuff that's not included in our numbers but could be considered as the measure of the crypto-native economy or the crypto economy would be revenues from centralized exchanges, mining and staking rewards, crypto services, etc., etc. So quick, too long, didn't read. You can find all of the reports under the QR code or under cryptonative.com.xyz. But in 2020, the on-chain revenues were somewhere around 1.4 billion. 2021, the peak of the bull market, 20 billion and going down from there. Now in 2024, we finally started seeing a pickup in the demand and our estimate based on the numbers from the end of October is that it will result in something like $12 to $15 billion. And this is, again, just the on-chain part. So as I said, well, this is going to be imperfect. So there is some napkin math to give you a glimpse into how does the ecosystem actually look like. So how many people do work in crypto? If you take some examples of the roughly known numbers, this is an estimate of figuring out how many people get paid in crypto. This isn't all of the ones that somehow make a living on crypto, but the ones that we could say are employed in a way. So if we take the examples of the biggest companies such as Coinbase. I think they report somewhere around 3.6 thousand people. Binance, roughly 2,500. We take 10 of those companies, 50 companies of the size of roughly EF or Netamind, having 250, 100 small projects, L1s, L2s, you name it, at like 50 people a team, 500 of startups of the size of Pondau, thousands of early stage projects, and tens of thousands of team-ups. That's roughly 100,000 people that we can say are employed in crypto, which isn't a lot, obviously. What's the total market cap? This should be the up-to-date number from this morning. So the tokens and coins only result in 3.2 trillion dollars There is also the market cap which we didn't include in the crypto native economy report, but it's the the crypto economy itself There would be companies like Binance like MicroStrategy. Maybe even Robinhood We would be somewhere below 200 billion dollars. I think coinbase is at like $85 billion of market cap. Plus, there is a ton of companies that are privately owned. They're like Binance, Chain Analysis, OpenSea. All of those would rank in billions. Obviously, Binance is very likely much higher than that. So how does this reflect on the rest of the economy, the so-called real world? To compare these two, we basically picked these three metrics, the market caps, revenues, and the people. And I hope this will give you some perspective about where we stand today. So comparing the market caps, basically to the stock market cap, we take the stock market caps as, again, the imperfect metric. You can take that as demands to somehow participate on those assets that either can act as a store of value or act as a promise of future value in form of revenues. So the entire tech stock market, by the way, there are overlaps between these, would be today valued at $33 trillion, the banking sector, the publicly traded banks, $10 trillion. Energy sector, likewise, pharma, $6 trillion. Gaming, 4.2. And then there's crypto at like 3.8. Then there is automotive. So basically all of the car manufacturers. And this is very real, right? Like we would all agree that that's the real world and crypto is actually already valued more than this part of the real world. Then you have entertainment, a 2 trillion food industry. That's basically the large corporations. We definitely don't go deeper into the entire economy behind the food industry or any of these, just the publicly traded companies. And finally, airlines. There's one thing I want to focus on, which is the gaming and entertainment comparism. Here are the revenue estimates. Let's just do a quick read-through, but let's focus on the entertainment and gaming. So the entertainment, even though it's valued lower than the gaming industry, and there is some partial overlap, is nearing $900 billion, and the gaming is at like $600 billion in revenues. Crypto, including the crypto native part, including the stake and rewards, including the revenues of like Binance and Coinbase and Kraken and so on, I would argue it's like still below like $100 billion. Now, following up on the people metric, this is the rough estimate of how many people are employed by these sectors. And obviously, there's over 3 billion people who are employed somewhere or are making a living. So this is, again, just zoomed in on the stock companies. But there is an interesting and important fact here. Look at entertainment and gaming, where gaming is, like, valued higher than entertainment. Entertainment still makes the bigger revenue, but also employs more than twice as many people as the entertainment as such. I would argue that the gaming industry is essentially a more effective form of entertainment, where the value per an individual in the segment is much higher than the overall entertainment, because they just create something more efficiently. They create content that can scale better, and people can stay with the content for much longer. My argument would be crypto does very similar thing for finance. And we are still in this very early stages of just few hundred or few hundred thousand people working in the ecosystem and we're yet to see basically the full scope of where crypto can actually compete with the rest of the financial ecosystem and economy. So that's a rough comparison in numbers. I think we are still very early. I mean, we're obviously like Bitcoin, it was started in 2009. The World Wide Web was started in 1989. And look where it has led us. Multiple companies from the internet era being in the top 10. This actually isn't the up-to-date slide. I had to update it this morning because Bitcoin, again, popped up into being the ninth most valuable asset in the world. This is from the infinite market cap. Ethereum is quite close it's the it's a number it's actually 32 now and i would say within a year would actually again see ethereum to uh get pass over like the the giants like mastercard or visa um as a contender in this like globalized ecosystem and if you look at all of these companies, I think it's like very hard to argue against crypto being the real thing. Like this, this is very real. This is very tangible. And it already competes with like companies like Home Depot or Costco or like whatever, or ExxonMobil. So it's definitely nowhere, nowhere near kind of just like a gimmick for a few individuals. So a quick summary. You are the crypto-native economy. Since you're here, I guess like you somehow participate in this ecosystem. You all paid like fees on L1s, L2s. I would definitely encourage you to read the reports and give us some feedback. I'm wearing a t-shirt, Banks Hate Us. It's usually my final slide, but I'm not using it today. But banks hate us because we are winning. And I had multiple talks on the crypto-native economy and the crypto-native generation, where I argued that, especially in the big inevitable market, we are at this stage of, like, now they are fighting us. And I think we are now finally in the stage of actually getting the recognition and being considered real from the rest of the world. Before I depart, this is a slide that I used in 2022, exactly like in the bear market, which basically looked at the crypto native economy numbers and just like concluded was actually super small, despite the valuations. And there was peanuts back then, it's still peanuts today. But there is another peanut. It's an inside joke, I'm not a Trump supporter, but I just think a peanut is hilarious. And I would just say, crypto is very real today already. Today, we're past the first day they'll ignore us, then they will ridicule us, and then they will fight us. I think today we're at the stage where crypto started winning, finally. And I can't wait to see what happens in the next few years. Thank you all for coming. Well, I think we have a couple of minutes for questions. That was awesome. Thank you so much, Joseph. You can scan this QR code and write questions. We have a couple minutes to answer your questions. But please, we need to do it through the, through the QR code. You just, you just take the code and then you can place your question and I will help you with that. So I'll give you one minute to do that. Meanwhile, I wanted to say it's fantastic to have you all here. This DEF CON 7 is going to be epic. It's going to be amazing and all of us and all of you being part of this is really fantastic. So I want you to give yourself an applause for being here today, please. No questions yet. I saw someone raising a hand. Should we just do the questions from people that raised a hand? There's a gentleman right here we can try that meanwhile sure we can come on sure we can so so anyone wants to shout a question? Please. Yes, I'll go. So, where you say we are in the first they ignore you, then they laugh at you, then they fight you, then you win, you're assuming that we're right now in the middle of their fighting us or that we've passed that they're fighting us? That seems very naive. Don't you think there's much more, much harder fights? Probably in the near future. I mean, there will be. But I think at this stage, we basically are past their fighting us. There is a lot of embracement in crypto. You see it like... Take Switzerland as an example um even like us first starting company switzerland we got rejected by multiple banks including like the two and like suricantel banks and so on um and last year they started providing the same crypto services to their regular customers and it's just like that's the that's the early birds right and i would say like we are going to see more and more even banks that will start custodial services for crypto users because the economic demand is there and like more and more even traditional fintechs are embracing that and they just see it as a revenue stream. So I say like now we're winning in the sense of getting the recognition and actually like getting them integrated into our own ecosystem. Maybe naive, but I'm like being in the ecosystem for quite a bit. I'm quite optimistic about this being the stage right now. Perfect. So now we have questions on the QR. So Joseph, could you please talk a bit about consumer payments in crypto stables as a real world usage of tech? That I mean, I'm not sure how much time we have, but I think it's actually becoming like real or with the L2s, with the providers that, like, pay your gas fees. Like, three years ago, that would be very hard. I used to collaborate with this, like, group that was running a crypto-only cafe, and it was a burden, like, actually paying for gas fees and, like, teaching people, like, how it works. Many people used it, but definitely wasn't a real world use case. I would say now with like gas being paid for you on L2s, it's like very, very possible. And I mean, I'm sure we are going to see more businesses just like accepting crypto regularly. And it's been happening for a decade now, especially in the past like few years. Fantastic. Thank you so much, Joseph. Please give a big applause for Joseph and this great talk. Appreciate it. Thank you so much, Joseph. Please give a big applause for Joseph and this great talk. Appreciate it. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731389400000,
  "slot_end": 1731390600000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/1I8L_RL8n3RI4PQDkpmQfboZc2IVdS6GLh-psdPM4k5s",
  "resources_slides": null,
  "speakers": [
    "josef-je"
  ]
}