{
  "id": "cults-truth-values-and-the-bubble",
  "sourceId": "CCVGE8",
  "title": "Cults, truth, values and the bubble",
  "description": "Our space can sometimes be challenging to navigate, with many hidden layers of truth and tribal factions. This is a quick journey about how to navigate yourself and what you care about in an increasingly complex environment. How to deal with all the political games, be human in such a fast-moving ecosystem and generally just thrive as human being in a very tech and protocol-focused world.",
  "track": "Coordination",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Governance",
    "Decentralization",
    "MEV",
    "fairness",
    "Coordination",
    "Governance",
    "Social"
  ],
  "keywords": [
    "Personal",
    "Human",
    "Purpose"
  ],
  "duration": 523,
  "language": "en",
  "sources_swarmHash": "35519fcb0aaec0942033d5bff43ce07da73b5937a89fe29203a667f68781e906",
  "sources_youtubeId": "iuQLIvQ5E-w",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735defb9dbb7a90e1b24d41",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735defb9dbb7a90e1b24d41.vtt",
  "transcript_text": " Well, all right, that's not the actual title, but that is the actual title. So yeah, originally this presentation was intended at something more technical, but now I found it actually more interesting to bring something more humanistic here to the stage. And this title might sound confusing, and I'll try to cover a lot of ground here, and I'm very excited to do that with you together today. So a bit of a preface. So yeah, my background here is quite diverse. So I used to be a software engineer for a while. I used to work in research, and now I'm a bit more in a coordinative perspective, but I'll actually get right into it to give you a bit more of that. So values. I'll start with talking about values of individuals in the ecosystem and how I perceive different people here and where I allocate myself as well, and then give you a bit more of a landscape of different companies, different parts of the ecosystem in this value framework. Then I'll talk a bit about economical and political games, truth, cults, the bubble, and I'll try to tie it all together at the end, even though it might sound confusing now. It'll make a lot more sense when I go into it. So I like to ask myself the question a lot is, why? What's actually my motivation why I'm here? And what is the motivation why other people are here? And so to put it in a very simple framework, I realized most people can be described in this kind of triangle. So either people care a lot about decentralization in the space, people enjoy fun in the community, or people care a lot about monetary gain. And often that gets a bit disguised or it's not very clear. And so it's really nice to have very direct conversations with people about that. And for me personally, it has been a bit like that. So I started with a lot of idealism. I realized at some point there's also a lot of money to be made here, which is often not directly talked about that much. But in the end, I stayed because of the people and the community, and I'm slowly going back towards more idealism and impact. But if we look at the space overall, actually, it makes sense to extend this framework a bit and add one more intellectual challenge, which is very interesting for a lot of us here. And so if we do that, and we try to map the space a bit, so then we get to a landscape which looks a bit like this. And for me, that was pretty interesting to just allocate different parts of the ecosystem and also see like, where does it fit? Where could I personally fit with my values? And this is not the full truth, but I found it really interesting to map the landscape a bit like that. And maybe that's helpful or interesting to one of you. Yeah, continuing here towards the games we're playing, the economic games in the ecosystem. So there was a really good talk recently this week by Christoph Schlegel from Flashbots. We're actually in a market structure where there's a lot of private value, for example, private order flow. The stable equilibrium is actually a full monopoly, which is the opposite of decentralization. Do we want that? Let's look at what the market actually looks like. For example, here, the builder market. Some of you might know it's a duopoly, basically, at the moment, but in an equilibrium, actually, it would be a full-on monopoly. And why is that like that? Or, for example, looking at how order flow works. Also here, it would be basically a equilibrium of one party controlling all of order flow, but actually it looks more like this, like a very complex structure. So that means in the background, there's a lot more political games happening than we are aware of. And it's very interesting to observe those once you're a bit deeper into the space. And the question is, how do we not devour ourselves in this internal political warfare, but actually focus on the issues we care about? Open question for now. I might get back to that. So another angle to look at this is, what do we trust in this space? So here we can put it under another framework. So I feel like the space emerged a lot from losing trust in government institutions, then trusting more in protocol and code, or do we actually just trust ourselves? Because often we have this overemphasis on just wanting to trust the protocol, the code, something predictable, but maybe there's something else. And so I kind of ended up with this nice mid-width diagram. I really like those. So some of us really work hard. I used to really work hard and want to save the world, but in the end also, let's have some fun. Let's not be too serious in this space, but also really just enjoy ourselves once in a while. And so one question that arose in my reflections there is, if we just have fun, sometimes crypto feels like a big, big playground of technology. And do we then still actually care about issues? Or do we just become chill and have, yeah, just have fun, do nothing to change the world? For me, actually, it's more the way, if we can relax a bit, if we don't have to have these political warfares, for example, like like this then we can actually be more united and aligned in the ecosystem or wall and so to continue from here what are actually if we look at ourselves really reflect deeply on emotional space our needs as humans here like what do we actually care about why are we here and what makes us happy? For me, actually, it's really mostly about the people. And to be more seen as like a whole human being, to be sometimes confidently insecure and not know things, that's something which really fulfills me. And that's also a reason why things like this place here as a conference, but for me, it feels more than a conference with the cozy spaces, the smaller groups, or pop-up cities have been thriving where you actually get a feeling of community. But then also there's other dangers there. If we become such a closed ecosystem of like community really close to each other, but then there can also be, you see myself there at SuperLyn, for example, it can sometimes become almost cult-like. We're like a bubble in ourselves. So what about this vibe that the whole ecosystem feels a bit like a bubble with its own language and we don't actually know how to talk anymore with the outside world? Is that a danger as well? And so I realized in a very interesting conversation with Phil Dayan that the world is actually watching us a lot more closely than we think. For example, the New York Fed recently published a paper in August where they were looking at tornado cash sanctions. And I was astonished by the amount of detail, how they actually understand the builder landscape and the graphs I showed you before. So I think it's also time to start talking to this world and not only see them as the enemy but maybe find a more collaborative approach there. To conclude, based on all of this, we're in a fucking complex space here but sometimes there are bits too much stuck in your head because we try to build protocols which predict every single edge case but by evaluating things we can also trust more our intuition, be humans, be vulnerable, be stupid. Like, I often also have this imposter syndrome, even though we work really closely with Ethereum researchers and be, like, very deep in the ecosystem, that, like, I know nothing, but all of us sometimes feel like that. And even though we can still create things, we can dare to also be on stage once in a while like myself here and sometimes peek outside of the bubble talk to people outside of the space try to speak their language and put things in like simple words and simple frameworks like I tried to do it here today. Thank you. Thank you. Hi. Good to have you here. Any questions? I do have one. Like, what do you think is the way for us to break out of the bubble? Because it's, like, language is so different, you know. How do we start? Like, understand where other people come from. Like, start from the other person's starting point. Bring things into really simple words, simple language. Find analogies from other person's starting point. Bring things into really simple words, simple language, find analogies from other people's world, and to describe it from there, and then bring them closer in. Is that how you umpire your mom? Yeah, I'm still struggling with that, but I'm making some progress slowly. My dad is easier. Cool. Do we have any questions from the audience? Any questions? I guess we can have discussion privately after this. Cool. Happy to talk later. Thank you so much. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731582600000,
  "slot_end": 1731583800000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/12xOmjbuWiCGoJo_Bx-KMT5zB8_88W6kmYHfhx1CzVcA",
  "resources_slides": "https://drive.google.com/file/d/1vSfQ-yqKGV-B-5P-B-kc9FYQU0rulYcC/view",
  "speakers": [
    "chris",
    "davide-rezzoli"
  ]
}