{
  "id": "dacc-social-tech-from-a-swiss-perspective",
  "sourceId": "QXJYLY",
  "title": "d/acc social tech from a swiss perspective",
  "description": "Zuitzerland‘s thesis on how a permanent network state sandbox can serve as a „free social space“ and aid in scaling d/acc governance models beyond Swiss borders. Zuitzerland aims to build on the social technology developed over 700 years of decentralized governance in Switzerland, a thriving nation state, that’s no. 1 in innovation per capita, and one of the world’s only direct democracies.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Decentralization",
    "Economics",
    "Governance"
  ],
  "keywords": [
    "D/acc",
    "Network states"
  ],
  "duration": 604,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "BRjAO-5s2MA",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735ccb29dbb7a90e1c4d953",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735ccb29dbb7a90e1c4d953.vtt",
  "transcript_text": " Thank you. Hi everybody. I'm really excited to be here talking about DIAC. So we want to tell you about DIAC the Swiss way. Una and I are working on Zwitserland, which is a network state and society sandbox that has come out of all of this Zuzulu madness. Yeah, so how did all of this begin? We were at Zuzulu in Montenegro and had just an incredible time, literally life-changing experience. If you haven't been to a Zuzulu pop-up city yet, it's definitely a very different experience to a conference experience and really meaningful. And it's led to us actually really coming up with a concept of how we want to launch a permanent network state sandbox in Switzerland. And we're working on a joint venture now to create a livable living lab in Switzerland in a beautiful Alpine region. So I'm going to tell you a little bit about that. Why a permanent sandbox? When Vitalik made the call to decentralize the Zuzulu movement, I was very honestly slightly upset. decentralized the Zulu movement I was very honestly slightly upset the experience in Montenegro had been so amazing and I Couldn't really imagine a space like this being created again in the same way by a random bunch of people in a decentralized manner And I wrote a big post on the agora forum about how free social spaces were so important and that this, what was created with Zuzulu and Montenegro was kind of like a social technology that had been created and a free social space that had been created where radical social innovation and technological innovation, but personally most interestingly social innovation can happen. And a place where we can work with existing models and new models and experiment and iterate in really interesting ways. And I was worried that we wouldn't keep that free social space alive and that sandbox alive if we decentralized. But interestingly, we took the challenge on and we said like, well, Switzerland is the home of the Ethereum Foundation and it's home to many, many early crypto companies. And if not in Switzerland, then where should there be a pop-up city? So we went a bit deeper and we really started looking at Switzerland and what can we actually do in Switzerland as a pop-up city that's very meaningful and you may know this quote from Vitalik Stiak or defensive accelerationism essay where he says actually Switzerland is often considered to be the closest thing the real world has to a classical liberal governance utopia and it's very much true you You know, values back and forth, and everyone's going to have their favorite thing. Switzerland is an incredible country. I've lived there now, both of us have lived there around 10 years, and it's incredibly successful. So number one for innovation per capita in the world for the last 13 years running. It's a direct democracy, and it's still working. And I think that that's what makes it fascinating. It's one of the only direct democracies and I think a lot of people are scared that democracies don't work, especially direct ones and Switzerland has made it work in a way that we think is very, very interesting and they've actually been working on decentralization and democracy for the past 700 years and they've been very much a part of the humanism movement and they have this incredible social technology that's developed over literally 700 years of iterating and working together and we realized as we started thinking about this more that this is a social technology that we should be building on top of rather than starting from scratch. And we realized also as we looked into it more that the secret sauce that a lot of scholars actually write about why Switzerland is successful is actually defensive accelerationism in other words. So they define their mentality as having a very good balance between caution and progress. They manage to innovate, but they do it in a way where they move reasonably fast, but they don't tend to break things. And so Switzerland has managed to become not only fast and a great innovator, but also a very stable and strong economy. And actually even has, for example, a kind of a UBI. If you become unemployed for whatever reason in Switzerland, you have up to two years your income covered by an insurance. So instead of leaving people on their own, when something happens, they reinvest in the people and in their human capital. And it's quite an interesting model because it's based on sort of insurance rather than a purely social support. So it's an incredible place and there's a lot that we can learn and we believe that it's a great place for network states to iterate and to build a sandbox where we can build our own kind of network state and society but also iterate and to build a sandbox where we can build our own kind of network state and society but also iterate and build other network states and societies and have them build with us. And core piece here is the balance of the state between the individual interests and collective interests and this is really what we think that Switzerland does well, is they balance the cypherpunk values with the solarpunk values and when in doubt they protect individual freedoms and things like privacy. Interesting example of kind of some of the weird stuff in Switzerland. So when you first move to Switzerland, they actually they give you your residence and your address and then they say, and by the way, here are some iodine weird stuff in Switzerland. So when you first move to Switzerland, they actually, they give you your residence and your address, and then they say, and by the way, here are some iodine tablets just in case there's nuclear war. And it's funny because it's like Switzerland is probably the last place in the world that actually expects to have nuclear war. But there you go, you get your iodine tablets. They also have bunkers, for example, that could house the entire population in the case of war. And so even though they do everything in their power to actually protect against that situation, they have ways that they can be protected from the worst possible outcome. So, yeah, I would hand over here to Una. Based on all of this, we've decided to do an eight-week event in May and June 2025, and have a bunch of you amazing people over for a really long sleepover, and to nerd on AI, privacy, ZK, rationality, DAOs, X-Risk, governance, and in particular, really learn from Swiss democracy. But there's actually more to this, and in particular, really learn from Swiss democracy. But there's actually more to this, and Una is going to tell you about that. So, instead of, not only conceptually, Ayla mentioned a lot about how we're conceptualizing Switzerland as a perfect DX sandbox place, and also for fast iteration bridging web 2 to web 3 through governance and what we can learn from Switzerland But at the same time we want to build it into a permanent living lab And Ayla has talked about how important it is to create a this social space as part of social technology For social for creating this safe social space as part of social technology. For creating this safe social space, we think that we want to build this permanent place at this potential park that we can have residents to come in and different people come in and have fast iterations and different products that we can test in a scale that matters, which means that we can actually accommodate 6,000 to 10,000 people on site and have testing all different kinds of social technologies on site. And one thing that we firmly believe is that why we need a sandbox in Switzerland is also change within the regime tends to be incremental and path dependent. We need a little safe space that we want to create and carve out from existing good society to have a path-breaking innovation. And this is where we see half the potential with a permanent location. And as for Switzerland, we believe we have the best ingredients to make it happen. We have really great people, all the Zuza people, I think I see half of you are probably Zuza-liens, and we're great. And then we have the culture and philosophy as Ayla explained, the D-AC and solar lunar punk integration. And also we want to have space and infrastructure to make rapid iteration happen with all of this we think that we can make meaningful radical social technical social technology happen and our rough plan from 2025 and to 2030 is that with 2025 the first two three years we want to have pop-up villages and pioneer residency and have a basic renovation at the physical location. And from 2026 to 2029, we want to have experimental villages and scale up a little bit and with living labs and sandbox and have deep tech on the park. And with 2030 onwards, we want to have a real high tech civilisation accelerator village on site. I was meaningful of being careful with the time. I think that's our slot. Thank you for your attention. I hope you are as excited as us about this. And welcome to connect with us and the community. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731580200000,
  "slot_end": 1731580800000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1f6N0D4m-xFEHIkJO7OzkhfJlUtBWAno5sr5jRV3Q5kk",
  "resources_slides": null,
  "speakers": [
    "isla-munro",
    "una-wang"
  ]
}