{
  "id": "dacc-eth-defensive-accelerating-ethereum",
  "sourceId": "HTNYKL",
  "title": "d/acc-eth: Defensive Accelerating Ethereum",
  "description": "Ethereum is accelerating and it is thrilling! However, what existential risks does Ethereum face? How can we reduce Ethereum's x-risks? What novel challenges do we face tackling this issue? Why do we need a new entity focusing on Ethereum x-risk mitigation?",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Regenative Ethereum",
    "Ethereum for Good",
    "e/acc",
    "technology",
    "defense",
    "e/acc",
    "Ethereum for Good",
    "Regenative Ethereum"
  ],
  "keywords": [
    "d/acc",
    "defensive technologies"
  ],
  "duration": 527,
  "language": "en",
  "sources_swarmHash": "76bd2634e5d453bfa2824fcabc6fbef5805676a8b463305dcfc383fc83a61af1",
  "sources_youtubeId": "5DY0rpnu3pg",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67374a741b0f83434d940cae",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67374a741b0f83434d940cae.vtt",
  "transcript_text": " Ilze Garda Reviewer:\"Petra Petrovic' Defensive, accelerating Ethereum. Ethereum is accelerating at a thrilling pace and scope. Ethereum is even innovating on how to innovate. We have invented decentralized innovation at scale. There are hundreds of entities in the Ethereum ecosystem, building, researching, creating clients, tooling, and like so many building blocks and ecosystem companies, layer 2s, cross chains, bridges, liquid staking, risk staking, and even more. And we are learning how to innovate like this. Ethereum has been pushing for this decentralized way of innovation and building, and we have just started learning how, and the pace of Ethereum... It's not working. Should I start from again or no? And the pace of Ethereum's innovation has been increasing every passing year. Every year, the core protocol has more EIPs, and the scope of these EIPs are larger. And we have amazing futures to look forward to. Just check out Vitalik's recent book. And we have had the Beam like the beamchain proposal recently. The future is amazing for Ethereum. However, Ethereum has existential risks. Just to remind, eight years ago at DEVCON Shanghai, Ethereum suffered an attack. There is no guarantee that Ethereum will exist tomorrow or the next year or or 10 years later, or 100 years later. For instance, Ethereum would fail if the global internet network would have a catastrophic failure due to World War 3 or a solar event or anything else. Another issue is protocol bugs. Protocol bugs could lead to huge issues. Any self-respecting e-commerce website has production-like staging environments, but at Ethereum, the devnets, the testnets, and the simulations we have are nowhere close to replicating the complexity of Ethereum's mainnet. It is a huge ecosystem with so many different parties and conflicts of interest and billions of dollars at scale. Sure, we can revert most protocol issues, but what if there are conflicts of interest between these ecosystem participants? What if there is an issue at the protocol where optimistic roll-ups are okay, but ZK roll-ups are screwed? What if there are like billions of dollars at stake at each party and like what if Vitalik and Ethereum Foundation may not be able to steer the direction again? There could be a lot of disaster scenarios like this. We can like talk about these forever but what should we do about this? I suggest we need a new entity focusing on reducing Ethereum's existential risks. What exactly should we do? We need to research these existential risks. We need to quantify these existential risks. We need to raise funds to mitigate these existential risks. And then we should fund this research and development of these defensive technologies against Ethereum's existential risks. But why a new entity? Because Ethereum's existential risks are very important for humanity. These issues need a lot more attention and funding. At Ethereum there is this protocol security group and other DevOps groups but like they are not getting enough like, funding, and headcount. And in the ecosystem, we have an amazing ecosystem supporting the application layer and beyond, but the research and funding for this protocol layer are severely lacking. And in addition, there are a lot of novel research problems on tackling these existential issues. For instance, we don't know how to quantify or incentivize defensive technologies. Public good funding mechanisms are applicable here. However, defensive technologies have novel problems. Any defense deters attacks. Just because a defense exists, some attacks may not materialize and won't materialize. For this reason, we don't know even how to evaluate defensive technologies in retrospect. We also don't know how to evaluate a defensive technology proposal and its impact in the future. OpenAI failed for this reason. Like OpenAI as this defensive technology AI company. This like nonprofit no longer exists because we as humanity like these like mechanisms to fund and incentivize defensive technologies. There are like many novel issues on this like existential risk aspect as well. For instance we cannot have prediction markets and fund these defensive technologies through that. Because say you bet on Ethereum that Ethereum will fail and you will never get your money back. At Deocon, we are interested in the long game, especially in this room. Ethereum will provide immense value to humanity over a very long time horizon. But if it fails, we may never get a second chance of creating a decentralized world computer like Ethereum. For this, we should take its existential risks very seriously. Please join me in this new Telegram group and discuss how these existential risks could be mitigated, and let's defensively extradite Ethereum forward. Thank you for listening. Thank you, Han. Thank you, Han. And yes, please, everyone, join us and try to build better solutions to help humanity. So, please, questions for Han. Hello. Really great presentation, Han. Thank you so much. When it comes to the different risks that you see would be worked on in this organization, what would be the ratio between the technical risks and maybe the social and regulatory risks in order to get the work done? Maybe even some priorities, prioritization. It would be interesting to understand what your thought process is around that. First of all, I'm just advocating and bringing attention to this lack of research on this aspect. To begin with, in my opinion, we are lacking a higher level risk analysis on what are these risks for Ethereum. So we don't know, for instance, if these layer zero social issues are the biggest threat or if this lack of good simulation of the protocol and technical aspects are the biggest issue. So if I were to run such an initiative, I would start by classifying these issues and roughly looking at where are these biggest risks. And lots of these risks also depend on other research. For instance, risk of global internet network disruption is studied in other aspects, but how it applies to Ethereum and how can we as effectively mitigate that as possible for Ethereum. We could also make use of other research in existential risks research and other distributed network and other blockchain research. Sounds really amazing. Once again, really great presentation. Thank you so much. Thank you for the question. While we are there, are you aware of some initiatives? I mean, I know that you are advocating, but are you aware, is there any initiatives that you can share with people? Apart from the Telegram group, of course, that you shared. Between Ethereum, there's Protocol Security Group working on this. And it's PandaOp, is the DevOps running the simulations. There are other companies working on tooling, but not directly on this. So such an organization could fund this. But what I would really like to have is something like the Red Guild or SEAL, but for protocol focus and focusing on mitigating these existential risks. These people will support you in that. Okay, let's see if we have time for one more question. No? Okay, well, please, round of applause again for Han. Thank you. Thanks so much.",
  "eventId": "devcon-7",
  "slot_start": 1731658200000,
  "slot_end": 1731658800000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1fuSrN9JQHv91E6bFCwDtFCGMP2T4Sg6pk3Mhh_y-ZYg",
  "resources_slides": null,
  "speakers": [
    "han-tuzun"
  ]
}