{
  "id": "daos-and-borgs-blending-the-best-trust-minimization-techniques-of-the-onchain-and-offchain-worlds",
  "sourceId": "3E7R7G",
  "title": "DAOs and BORGs: blending the best trust-minimization techniques of the onchain and offchain worlds",
  "description": "In his talk, Gabriel will give an overview of the legal challenges faced by DAOs and how ‘making DAOs modular’ with specialized legal wrappers and smart contracts known as ‘cybernetic orgs” (BORGs) can solve these problems. The talk will tie the evolution of DAOs to the modular revolution in blockchain infrastructure and a detailed walk-through of how modified Gnosis SAFEs can be combined with legal entity bylaws to blend the best trust-minimization techniques of the onchain and offchain worlds.",
  "track": "Coordination",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DAO",
    "Governance",
    "Decentralization",
    "cybernetics",
    "DAO",
    "Decentralization",
    "Governance"
  ],
  "keywords": [
    "Cryptolaw",
    "cybernetics"
  ],
  "duration": 1641,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "2pYy07uUG4c",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673324013a168eb5355d6509.vtt",
  "transcript_text": " . This way you do this, probably like that. Okay, cool. So this is going to be very informationally dense. The talk was labeled as intermediate, but I am going to speed run through the basics, like super speed run through them. So don't get mad that I'm going to kind of like speed run through the basics, like super speed run through them. So don't get mad that I'm going fast. Basically, yeah, it's to get to the good stuff faster, right? And then I'll slow down and take my time on the detailed interesting stuff. Yeah, as I go through, I will be saying some very opinionated and potentially controversial things as if they are fairly simple, obvious truisms. The reason why I'm doing that is just because it makes for a better talk, not because I'm like a fascist who doesn't understand all the nuances. So you can always feel free to like challenge me later on these various assertions, but it just kind of simplifies, simplifies the discussion, simplifies the presentation, et cetera. So with all that being said, I'm Gabriel Shapiro. I am what they call a crypto lawyer. I'm also more recently a founder of a company called Metalex that researches and develops certain, what we call cybernetic law solutions that include governance issues for DAOs. Covered that. So first question is, like, what is a DAO? I'm sure you guys have heard this question ad nauseum today. I will just say that, like, basically no one agrees, so the DAO that can be defined is not the true DAO, thus spake DAOzu. There are kind of like two basic answers you can give to this question, right? Oh, and let me start my timer here so I don't take too long. One is like basically if you just looked at everything that is called a DAO and tried to honor that nominal essence, so to speak, that everyone gives, it's just way too many things, right? It's like venture capital funds that use smart contracts. It's art collectives. It's protocol DAOs, things that are governing, you know, DeFi protocol parameters. Just like some people even call like Bitcoin itself a DAO as a network. Just many, many, many things. And about the best you could say is that, like, it's some type of group of people who use blockchain for at least some of their governance or, like, storing their assets or something, right? That's not a very satisfactory or precise thing. Just to give, like, an example there, yeah, like Metacartel VenturesDAO, which I actually helped found and I'll be mentioning throughout. You know, it's really a venture capital fund. It's an LLC. But it uses, like, tokenized voting, right, and uses smart contracts to hold the assets. But, you know, at the end of the day, it's just a venture capital fund, right? So that's an example of, like, how diverse these things called DAOs can be, right? My answer is, like, I have a much more opinionated answer, which is I go for like a purist definition of DAOs, right? And I just look at the word, right? The acronym DAO, right? So at a minimum, DAOs must be decentralized and autonomous and some kind of organization, right? What does decentralized mean? It means that whatever like the human discretion is in running this thing, like it's dispersed over a large agile and potentially anonymous group of incentive aligned persons. And we prefer that it's like a permissionless or relatively lightly permissioned like entry into that group so that it can be very broad and so that there are no like unfair hoardings of power, so to speak. And autonomous to me means that it's self-governing, self-governing, trust-minimized, and resistant to extrinsic exercises of power. So the intrinsic power is decentralized, and the extrinsic power is hopefully close to eliminated. And you can actually go back to the original thing that inspired DAOs, which is an article by Stan Larimer, not Dan Larimer, although I think they might be cousins, arguing that Bitcoin is a decentralized autonomous corporation. And he had three rules for what he called DAX, what we now call DAOs. They basically have three laws of robotics, or what we call three laws of DAObotics. Law number one is that a DAO must run under the control of an incorruptible set of rules that are implemented as publicly auditable open source software. Law number two, a DAO must not be able to change its rules without the consent of its stakeholders, and such consent must not violate law number one. And law number three, a DAO must seek to protect its own existence as long as that does not violate law number one or law number two. Now what is a Borg? You may have heard this term, maybe not all of you have heard of it, but it is a cybernetic organization, hence Borg. And what that means is it's some kind of like real legal entity, could be incorporated or unincorporated, could be a partnership, but most likely is going to be incorporated, where the rules of that entity, the legal rules of that entity mandate the use of certain smart contract or blockchain systems, right? So this represents a blend of legal and on-chain technology, right? There are two main varieties. One is DAO adjacent, right? So if you've ever heard of any type of multi-sig that can freeze a DeFi protocol or some type of grants multisig that is funded by a DAO. That's basically a DAO-adjacent Borg. An example would be like Curves Emergency Multisig. It can freeze pools that are 30 days or younger, and it can stop Curve rewards to a pool, and it can't really do anything else. And the other would be like BizBorg. So this would be something like Meta Cartel Ventures DAO, which I mentioned earlier, or like a corporation that like tokenizes all of its shares and lets them vote on chain and distributes funds on chain. Why is a Borg not a DAO? Well, it lacks autonomy and it lacks decentralization. Basically, it violates those rules I mentioned earlier, right? I won't dwell on that, but it's there in the slides if you want to see exactly why. Also, side note, why Borgs and not sub DAOs? You may have heard of the sub DAO model. Well, sub DAOs are usually not DAOs. They are usually small groups of multi-sig holders, again, that for some reason people call sub DAOs. So, again, they violate those rules. They're not decentralized. They're not autonomous. From a legal perspective, you really don't want, if these things are like some small group of people who may incur liabilities or do bad things, you don't really want them to be sub DAOs because then the DAO may have legal liability for them. You want them to be more separate and autonomous. Securities law is also, you know, if like the DAO token holders are basically like electing, like just fully electing these people and it's more of an agency type relationship, you might be turning your DAO tokens into shares and securities. So these things, these like, we have various trust problems with DAOs and with multisigs. And the ethos of crypto is verified, don't trust, right? So the point of this talk, the point of this entire track is coordination, right? How to solve these problems. And Borgs are basically a technique for doing this. The first trust problem that is faced by these like multisigs in relation to DAOs is member management, right? Oftentimes when a multi-sig is, a DAO adjacent multi-sig is proposed, it's with like a very specific membership set. It might be people who are doxed, it might be people who are pseudonyms like the well-known Bantag who's like very high reputation as a NIM, right? But nonetheless it is a specific set. But how do you accommodate over time membership changes? Who decides that? And the default is that these things are just a standard safe, and therefore those people decide the membership changes. But the DAO seems to care who the members are, yet the people who were appointed, they can change their membership willy-nilly, and they never have to go back to the DAO. That's a problem, right? Particularly a problem if there is no other recourse against these people, as is typically the case, other than, quote-unquote, reputation slashing, right? If they do something bad, they will lose their reputation, and they will never be appointed to one of these things again. Okay, but that's great for the initial set of potentially high-reputation people who are appointed, but what if it changes over time to like lower reputation people? Or what if the people who like claim to be on it, like immediately actually just like assign the keys to someone else or something and you could never know, right? The other trust problem is asset management, right? Often these things, I mean, I think like Arbitrum recently approved like a hundred, over a hundred million to some like gaming grant support type of thing, right? And they're putting in place trust mitigation measures, but this thing happens all the time, right? These multi-sigs get, these DAO adjacent entities get large amounts of money from a DAO, right? And this presents various issues. Number one, like transparency of asset management, right? And like one thing to notice is that if you just like, you may think that the fact that these funds initially go to a multi-sig means, oh, it will be transparent. But actually, in the default case, the multi-sig can just immediately send them to a centralized exchange or to a custodian or sell them for fiat and put it into a bank account and all that transparency would be lost. And there's typically nothing that can be done about that. There's no legal rule against it. There's also no on-chain mechanism that typically prevents it. So the transparency isn't really there, actually. And asset management accountability, they're supposed to do specific things with these assets, but there's often no way to enforce that either, again, other than this sort of idea of reputation slashing. The other issue is permissions management, right? So I mentioned Curve Emergency DAO, or Curve Emergency Board earlier, that has certain specific permissions over the Curve smart contract system, but it's only supposed to use them for specific reasons, right? Like basically if there's some sort of security emergency. So it would be like very bad if someone is on that multisig and let's just say, well, let's just say it's someone from Curve and let's just say like Uniswap community tried to do like a Uni stablecoin pool on Curve and just because there are competing protocols, the Curve people didn't like it and they shut off Curve rewards to that pool or they killed that pool, right? That would be bad because it's not for a security reason, right? But actually there's, like, no way to really, like, enforce that or even make clear that that is an actual rule. An example here from real life is that Kujira, basically the devs had a highly levered position themselves in their own borrowing protocol, and they used their multisig authorities to change the parameters in their favor and just kick the can down the road over and over again, and eventually resulted in a protocol insolvency that could have lost people a lot of money if they were not bailed out by 14 people. The other thing is that, like, you can actually have bad mitigations to all the problems I mentioned, right? One is that you, like, basically you just put the DAO in complete control of everything. And, again, that lapses into the sub-DAO model. And it also may really result in, like, an adverse selection effect in terms of who can contribute to the community so to speak right because if like you can get rugged at any time by a DAO well really valuable serious people are not going to operate under that they want either employment law protections or they want some kind of deal where like if I produce x you will pay me y and if you don't pay me y I can come and sue you right and that is not really possible with that type of just make the DAO supreme type of mitigation. So it will lead to adverse selection. And, in fact, I know of quality teams that just have a rule of, you know, we will not work with DAOs. We will not do projects for DAOs. A concrete example here is JunoDAO had set up a very complicated and I thought somewhat promising looking sub-DAO structure earlier this year. And I think it took like months. I don't know all the details. And the DAO just kind of changed its mind and rugged all those people before it even really got rolling. Now, maybe they were doing some stuff wrong. I don't know. But, you know, it shows how things could be bad, right? And how people could be reluctant to do these. There also are trust issues faced by, like, extrinsic counterparties, right? Like, many law firms will not represent DAOs, cannot represent DAOs, right, because they're not legal entities. Basically, some of the things that I mentioned, like, during the last slide, like, third parties can get screwed and will often not want to do deals with DAOs. So to address these with Borgs, there are basically two sets of techniques. One is on-chain techniques and one is off-chain techniques. And we try to blend the best of both, right? I often say, like, a lot of on-chain stuff currently that's, like, decentralized in name only is actually the worst of both worlds, right? It has none of the protections of law and it actually has, like, none of the protections of true decentralization either. And so we actually tried to do the opposite. We tried to do the best of both worlds with Borgs. Some of the on-chain techniques is, like, okay, so almost all multi-sigs are what's called a safe. It's a very standard, very battle-tested, very trusted set of smart contracts, originally by the Gnosis team, now it's an independent team, and the genius thing that they did is they built hooks into these. Hooks for guards and hooks for modules. So without ever altering the core code, you can come in and you can modify the way that a safe functions. And we actually use this, right? We use this to limit the discretion of the safe, and also to enable third parties to do things to the safe. And this results in a can't be evil philosophy instead of a don't be evil philosophy. So guards basically constrain safes, right? Like they basically can check, you know, they could literally limit it to only sending money to a certain account or something like that. And then modules expand safes. Like, they could allow a DAO to come in and send money out of the safe somewhere without the multisig signer signing that transaction, right? So we call both these things implants, keeping with the cybernetic law type of theme, right? It's like cyborgs. So like basically we can, like at a very high level, the guards can make the Borg a whitelist style, a blacklist style, or a freestyle, right? Whitelist means everything is prohibited by default except what we specifically allow, right? So this could be like, let's just say it's a Borg that is only supposed to move liquidity among specific Uniswap pools, you could just whitelist those pools and nothing, and they can't do anything else. They could just shuffle liquidity between these certain pools, right? So it tends to be good for Borgs that have a lot of money in them. You could also do, we'll talk about grants Borgs, but you can like rate limit the speed at which money comes out or like add transaction size thresholds or things like this. Blacklist is like everything is permitted except certain things. So an example of this would be like a Borg. Let's just say it's a token that retains a mintable function, so it doesn't have a cap supply. And there's a trust issue there, right, because people don't want to get infinitely diluted for no reason. So you could blacklist this Borg, you could give it the permission to do, to sort of, basically it could like partially own the mint function, right? So in order to exercise the mint function you would need the approval both of this safe or this Borg and the DAO, for example, right? And that would be an example of a blacklist. And then free is like basically the safe can do anything, but maybe you want some of the other functions that we're going to talk about, like member management functions. So how do we address like the asset management trust issues I mentioned, right? So basically, let's just take like a grants bargain as an example. We can add like rate limitations, right? So let's just say the idea that the DAO approved is like this should be a fire starter board. Like it should give out lots and lots of 50K to 100K grants and no bigger, right? And it should do this like several times a quarter for three years or something like that. Well, we can actually program that in to the safe, right? And then they have to do that. They can't do anything different, right? And you still want to retain flexibility. So the nice thing is you can either allow, like, the caps and the rate limits to be crossed if the DAO co-approves that along with the safe, or you can put, like like a potential violation of a cap or a rate limit subject to a time lock and allow a DAO veto within that time period, right? Depends whether you want to be optimistic or pessimistic, right? So, you know, we can implement that veto functionality and that co-approval functionality. You can also throw in like anti-DOS measures, right? If you're worried about that. You're worried about the board will just spam the DAO and overwhelm its monitoring capabilities. You can impose cool downs between proposals. Member management issues. So this is the beauty of having a legal entity, which we'll talk about in a minute. But you can have one legal entity that owns this multisig forever and its assets, and it doesn't matter how much turnover there is in the members, right? It still has the same rules and the same set of smart contracts and all these things, right? So, but what we want to do is we may just not want to allow infinite discretion to the safe members to change their own membership. So you could, for example, require like a DAO co-approval or subject it to a DAO veto when a new member is added. You could potentially say, hey, these guys might all collude and there's no way to get them off. So maybe you allow the DAO to like unilaterally remove members, even though it can't unilaterally appoint members. There's all kinds of things you can do, right? But the point is to de-risk and trust minimize this member management function. This could be very important for an entity that owns IP, for example. If, like, let's just say the entity's rules say this particular safe, everyone who's on it is a director of this entity, and then the entity owns the IP. Well, now the DAO basically has, like, permanent check and balance style influence over the IP, and there's, like, no risk of disruption, right? Things like that. You can also put in like fail-safe measures so that if like too many, like you can allow people to resign. That helps basically with like trust minimize it for the contributors, right? Because like typically someone can resign from a company, but you can't actually do that in a default safe. You have to be voted off. You can also do like in a default safe. You have to be voted off. You can also do asset reversion measures, like if too many people resign or whatever, all the money goes back to the DAO, whatever you want to do. And then there are off-chain techniques for managing these issues, right? So the first thing is have a legal wrapper for your DAO-adjacent BORG. We could sit here and debate a legal wrapper for your DAO itself. I think this is very, very debatable, and there are significant cons to it. But there are almost no cons to wrapping your multisig, your DAO adjacent multisig in a legal entity. As far as I can tell, it's like pure upside, other than maybe some added expense, right? So, you know, it gets limited liability for the workers. It gets continuity for the DAO that we discussed. And then like entities are much, much like legal entities and corporate entities are much, much better counterparties for third parties than like a general partnership with unclear rules is, right? So there's all kinds of benefits. Basically, you say in the legal docs of the entity that the entity owns this particular safe and all the assets in the safe. And you also can say something like everyone who's who's in this safe is a signer in the safe is automatically a director of this entity, and vice versa. Anyone who's a director needs to be on the safe. Things like that, right? You need to choose the type of legal wrapper wisely. I'll kind of skip through this quickly because we're running out of time, but corporations are not very good legal wrappers for DAO-adjacent multisigs. They have very rigid rules. LLCs are more flexible, but they still have the problem that, like, they're geared for, like, to be owned by people, right? And we actually don't want these entities to be owned. We want them to basically be as close as possible to, like, the idea of a legal smart contract, right? There's a set of rules and there's people who have to follow them, but there's no owner, there's no specific beneficiary, et cetera. The best for that, as far as I've ever been able to tell with all my research, is Cayman Foundation. It's the only one that kind of checks all the boxes. Some other foundations can work, but they have like more rigid like founder structures or beneficiary structures or reporting things. It just came in as the best, right? And so here's how we actually do this in, like, the legal documents, right? So one, you really want to define, like, the purposes of what this entity is supposed to do, right? If it's a security multisig, its purpose is to defend against security threats, right? You want to say that in the documents. Therefore, it cannot use the assets for anything else. It cannot use the permissions for anything else, right? So we literally spell that out. We define security threats. In this case, it means any actual or reasonably expected threat into imminent pending or ongoing frauds, threats, misappropriations, extortions, abuses, hacks, attacks, et cetera, et cetera, against these specific systems. And those systems will also be defined with like specific contract addresses and things like that um like of course you could always debate these things and then of course like you may end up in court but it's still better than having like no standard or no rule at all um you can also we already discussed like making your safe members the same as your board of directors um you can basically you can be much more parsimonious in your legal drafting than you could ordinarily, because instead of like spelling out pages and pages of rules, you could just say, whatever the rules are embedded in that smart contract, we have agreed to them. We've diligenced these smart contracts, and they embed our rules, and we just accept their outcomes, right? Another one is, this is very handy with the foundations, you can have an emergency supervisor role. So you can basically say, hey, if the DAO, the whole point here is that this board was set, authorized by the DAO, given some resources with a very specific set of rules. Who is going to enforce those rules? Because remember, there are no owners, there are no beneficiaries, there are only rules and people who follow them. So what happens if they don't follow them, right? We try to make sure that they have to follow them with the on-chain stuff as much as possible, but it's not going to cover everything, right? For example, it's not going to cover, it's not going to prevent them from transferring IP, right? So we need legal rules for that. rules, it can appoint an emergency supervisor and this person is authorized under both statute and contract to come in, sue in the name of the DAO, investigate, hold people responsible, remove people who broke the rules, that sort of thing. It's kind of like a nuclear option on the off-chain legal side. Amendments, right? This would be a way that everything could be rubbed, right? If the board of directors has the authority to amend the bylaws and the bylaws are the things that say, hey, use the IP to the benefit of LidoDAO or whatever, well, that's a potential big end run, right? They could just amend it and expand it or whatever. So you need a rule that says any amendment also requires like a DAO vote. Or it could be the vote of some other multi-sig or some other foundation entity or whatever, right? But the point is you trust minimize it. And kind of like the last technique is like people, if these boards are going to be entering into legal agreements with people, the broader community probably wants transparency on that. So one thing we're doing is what we call Ricardian triplers. This has a technical definition, which I don't have time to give you right now, but the basic idea is, like, you can have a standard agreement, and if someone is signing up to the multisig, well, they would just sign this on-chain, and the variables are literally instantiated on-chain, right? So anyone could look at the chain and reconstruct. They could look at the chain plus the IPFS hash of this agreement, which would have been in the function call, and they can know exactly what agreements this has and who agreed to them and who signed it. So that's really it. One kind of like big meme I will just give you guys that I wasn't able to fit into this very short presentation is like think about the modular trend in blockchains generally, right? You have these big, highly decentralized, highly autonomous L1s. And then you have L2s that are more centralized, but also sort of like more expendable, right? And they have feedback loops with the L1. What have we just described with Borgs and DAOs? Same thing, right? It's the same exact trend. We now have modular designs. You can have a DAO that's surrounded by a bunch of Borgs, just like you could have Ethereum that's surrounded by a bunch of L2s, right? So there's this nice parallelism there. And that's really it. Awesome, Gabriel. Thank you so much. We have time for one question. So who wants to go and be the lucky person? One question for Gabriel. Here, please. The microphone. It's coming to you. It's coming to you. Gabriel, thank you very much for the presentation. I would love to have it because there is lots of valuable stuff. My question is that do you think if there will be a market for the Borgs, for instance, like if the different organizations could like shop for different Borgs that provide certain functions to it? Yeah, absolutely. I think there could be like even a market for like the implants, right? Like you can just add and remove implants as you need them as your organization evolves. And we talked about the DAO adjacent ones here, but actually I think the same approach makes sense for any type of entity, right? Your ordinary corporation, well, the board of directors could be a safe, the stockholders can be like a tokenized dow with like tokenized shares that vote and everything could be much more transparent and in my opinion efficient right because right now if you do um like a like a board of directors resolution let's it's called an action by written consent in delaware well that's saying something should be done or it's authorizing something to happen, but it doesn't in one and the same moment actually cause the transaction to happen. But if your written consents are safe signatures, and it's authorizing sending the money somewhere, in one and the same action of approving it, you're also doing it, right? So it's just obvious to me that it's much more efficient and much more powerful, much more composable, all those things. And I think we will have, yeah, marketplaces that have these implants, marketplaces that have Borgs. And if they're all on the same standard, it actually makes them much easier to do deals with each other. Like imagine a merger of two Borg-ed up corporations where the tokenized shares are on the same standard so that literally you could just call a function and one one set of shares merges into the other right on chain so that's the kind of stuff we're trying to build at my company metal x thank you so much please giving a great applause i appreciate that gabriel",
  "eventId": "devcon-7",
  "slot_start": 1731402000000,
  "slot_end": 1731403800000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/1Pq-UfROf_3nVsy2VhJLpxOcTmyPsVPQsHMIH4SZRIfY",
  "resources_slides": null,
  "speakers": [
    "gabriel-shapiro"
  ]
}