{
  "id": "dare-to-be-solo-staking",
  "sourceId": "ZMSNHW",
  "title": "Dare to be Solo Staking",
  "description": "I have been solo staking on my home computer since the very first day of the beacon chain. It's been a challenging journey, and I anticipate it will remain so in the coming years. This talk will delve into the time, financial, and technical commitments required for solo staking. It aims to provide a practical overview of the solo staker experience from an Ethereum enthusiast's perspective. I will highlight what is keeping us from a wider solo staking community.",
  "track": "Core Protocol",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Staking",
    "Home staking",
    "Best Practices",
    "Public good",
    "Best Practices",
    "Home staking",
    "Public good"
  ],
  "keywords": [
    "staking"
  ],
  "duration": 549,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736d6cf74749a4b89309278",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736d6cf74749a4b89309278.vtt",
  "transcript_text": " There should be solo staking because it's important because the networks need your help. So I've been solo staking for four years. This is one of my validator 145. I got very lucky this week because not only I am in DEF CON enjoying the community, but also I mined the block. I proposed the block on Tuesday. If you're looking for me, I have the same model everywhere. And I have a personal history with staking because my firstborn was born actually the day we did the merge. So I had to take the wife to the hospital and also monitor my node, like, is it going to be okay? And the core devs did an amazing job, and the community did an amazing job. Everything went right, and also the surgeon did an amazing job. The kid is super healthy. Anyway, a little throwback to when Ethereum France was born. We were hosting meetups every month. We're now hosting ECC as well as meetup and so on. We're translating technical papers in French. If you're looking for a good tutorial on how to stake in French, go to ethereumfrance.com. And before that, we were hosting mining meetup. It was keeping Ethereum weird. We were convincing people to run their mining node, to run a node, to discover smart contracting and so on. And now we have a good mission, is to make people stake at home. Because it ain't much, but it's honest work. It's because we have individual stakers at home that we are keeping Ethereum from being a glorified centralized database. The censorship resistance starts with you all in this room. If you care about Ethereum, you should stake. Ethereum is an unstoppable machine because we have a lot of nodes. But don't look up too much. It's hard to say from the network topology on how many nodes exactly there is going on. If you look at Ethereum nodes or if you look at Etherscan and different scanners like, yeah, well, 6K, give or take. If you look at the beacon chain and the different staking node alive, validating node on the beacon chain, you're like, well, give or take maybe 11,000. Yeah, so that's the branch, like between 6K and 11K probably. And there's a lot of validators that have multiple times 32 ETH on their nodes. So there's a lot of room for solo staker. We need to get this number down. Like, go, go out and solo stake. And I'm here to convince you to solo stake. So there are different stages of staking. Who here is staking? Woo! A lot of solo stakers. Like, go out there. You already know this presentation. And talk to your fellow Ethereum people. Get them to solo stake. Get them to solo stake until the state of illumination, home staking, where it can be home staking. You can stake your ETH on a centralized exchange, sure. You can use a managed staking provider. You can be a liquid staker. You can be a remote staker. And you can even be a home staker. You enter the fellowship of the home staking. But not everybody is home staking, unfortunately. And the best data on why people are not solo staking are probably coming from Vitalik's polls. You have cool numbers, like running a node is too hard. I don't have 32 ETH. I need to take ETH instantly. I'm not a solo staker, but I'm staking still. I want DeFi yield and so on. Well, okay. If you want auto DeFi yield, I cannot blame you. Getting richer is better than getting poorer. But still, if you're solo staking, you're going to be getting a lot of airdrops. So this is not a good reason to not solo stake. If you have less than 32 ETH, that's understandable. It's expensive now to get 32 ETH, but we have an EIP coming up to let you stake less than 32 ETH. Not being able to take out ETH instantly is a good reason as well, but still, we can be better than that. We can be able to withdraw the ETH faster. There are EIP coming up for that. If you are concerned about private key risk, come on. You've been handling your private key if you're sitting in this room. And there are good things to manage your private key as well. It's getting better and better. So running a validator is too hard? Well, if you're picking the most common way to solo stake, you have GIF and Lighthouse. If you're running on Ubuntu, that's like seven lines of code. So it's not that hard.stand tutorial on how to do it. Ethereum France has one in French, so check it out. But even more, there is thousands of giga-friendly chat to help you on solo staking. Here are a few of them. Eve Staker, Heroglyph, there is even a community hub here. Eve Pillar, Stereom, they are here as well. The Dappnode guys, like everybody is here to help. We want you to solo stake. So go out there and talk to your friends about solo staking. If you're solo staking, you're also helping up the diversity of the network, which is making us even more resilient. You have five flavors of execution nodes and five layers of consensus nodes. So you get to bring the diversity to the network and more resilience to the network. Okay, maybe you're still not convinced and you're not ready to make the move. Well, get yourself a Dapp node. It's $1,000 or something and get yourself one Gnosis Chain token and you'll be able to solo stake with your Gnosis Chain token. And I couldn't finish this presentation without an unsolicited note picks. This is my node. It's running and kicking. And this is also my Gnosis Chain node, a little DAP node. You can do it. If I can do it, you can do it. And if you want to chat about solo staking, I'll be hanging around next to the red room in the 114 room. And you can ask me anything about solo staking. And we have two minutes for questions. So fire up. Yeah. I wish I had this 32-if to stake. Now, but you can also stake with less than 32-if. I don't know. Not solo staking pool, but you have staking pools that you can participate in, and there is an EIP coming up to let you stake one-if. I think that's the objective. Yeah, it would be definitely interesting. Are there any questions for Jerome? But if there is no question, you can talk to me outside if you're too shy to ask. Of course. Come on, it's a room full of solo stakers, I know. Well, it's okay. You know how hard it is. Yeah, you. Won't I get slashed if I solo stake? You won't get slashed if you're solo staking and just running one execution node and one validating node. As long as you follow the principle of I'm running a node on the beacon chain and I'm running one node on the execution layer, you won't be slashed. It won't happen. The slashing happens when you are trying to do weird things. Like I'm trying to have replication of my execution node, I'm running multiple validating nodes around the thing. It can end up with you being slashed, but if you're just solo staking with one machine, one node for the execution layer, one node for the validating layer, there's no way you're getting slashed. Absolutely not. It's not a good reason not to solo stake. Anyone else? And what about power outages or like... Oh, yeah. So that happens. Indeed. If you look at my statistics on node 145, validating node 145, it happened to me a couple of times that my power went down and I was inactive for a few days. Or it also happened to me that I didn't take the whole SSD, lots of memory thing seriously. So I got like five days of outage. So when you're not validating, you are not earning. And you are losing what you're not earning. So typically, if you're earning like 0.001 ETH per day, you are losing 0.001 ETH per day. So if you've been out for five days, which can happen, you have to be in for 10 days to compensate the thing that you lost. Well, what you don't earn, you lost it. Thanks. But that you lost. Well, what you don't earn, you lost it. Thanks. But that's okay. In the meantime, you are solo staking, and you are making more than what you usually get on the mining pools. Okay, we have time for one last question. Can it run on old hardware? It can run on old hardware. The main limitation is that you need an SSD. Like you need a really good hard drive, like a SSD hard drive and four terabytes. That's the main blockers that you need a lot of memory and super fast memory. So your motherboard needs to be able to handle SSD, of course. And now in terms of processor and RAM, it's not that expensive. it's not that expensive. It's not that much. So if you have an old desktop from like 2018, that's fine. As long as it can take an SSD, that's fine. And you can see at that node, it's a very efficient node, and it's a super small nuke, so it's fine. Okay, thank you very much, Jerome. Thank you, guys. Enjoy DEF CON.",
  "eventId": "devcon-7",
  "slot_start": 1731642000000,
  "slot_end": 1731642600000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1YmHz7J7_ErPzoGv9lX-paIBhxZrCFEk_NqqiRA-wNk8",
  "resources_slides": null,
  "speakers": [
    "jerome-de-tychey"
  ]
}