{
  "id": "darkfi-kills-glowies-intro-to-the-worlds-first-anon-dao-anon-markets-anon-chat-the-coming-regfi-vs-darkfi-split-the-dark-forest-and-secure-freedom-for-sovereign-society",
  "sourceId": "FKED87",
  "title": "DarkFi kills glowies: intro to the world's first anon DAO, anon markets, anon chat, the coming RegFi vs DarkFi split, the dark forest and secure freedom for sovereign society.",
  "description": "The FBI director gave a speech on the \"Going Dark problem\" saying that mass usage of crypto threatens to create dark zones online where law enforcement cannot enter.\r\n\r\nDarkFi created the world's first anon DAO, after our experience on AssangeDAO which raised 55 million and bankrolled Assange's freedom.\r\n\r\nWe have also made the world's strongest anon chat, and the only p2p chat which is actually used. As well as task managers and anon markets. DarkFi delivers.\r\n\r\nFight back and lets gain our freedom!",
  "track": "Cypherpunk & Privacy",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Privacy",
    "Anonymity",
    "ZKP",
    "agorism",
    "Anonymity",
    "Privacy",
    "ZKP"
  ],
  "keywords": [
    "crypto-anarchy",
    "agorism"
  ],
  "duration": 1209,
  "language": "en",
  "sources_swarmHash": "35935a9b46ad253cf227167671ae96624ef153e85cf54b1f0fd1a02dbfb710a5",
  "sources_youtubeId": "0xEaNNSEk8A",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673477539dbb7a90e13b9365",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673477539dbb7a90e13b9365.vtt",
  "transcript_text": " Okay, I will start now. So, my name is Amir Taki. I'm a free software developer for 20 years and a core Bitcoin developer from 2010 to 2015. I wrote the BIP1. I made the first UK Bitcoin exchange. I'm 10 years plus working on privacy technology. I made the first privacy implementations in Bitcoin, CoinJoin, Stealth Addresses. In 2015, I joined the YPG, and I fought on the front line against ISIS. I was three years working in Syria for the local revolutionary government. And in this talk, I'm going to talk about DarkFi. So DarkFi is an L1 for anonymous smart contracts. It's like, in the same way Monero is the anonymous version of Bitcoin, DarkFi is the anonymous version of Ethereum. So I will also today also talk about the app that we're building for users. Like, what are we putting into users' hands. So let's begin. Let's have a look. So okay, that was actually, let's just go back here. So let's start with the name, DarkFi. DarkFi's name actually comes from 2013, where there was a project that we founded called DarkWallet. It was founded by me and Cody Wilson, who invented the 3D-printed gun, by Vitalik and a group of Spanish hackers. You can actually go on YouTube and you can find the initial video, which is an important piece of Bitcoin history. But the name itself comes from a speech by the director of the FBI. And the director of the FBI said that if people begin using cryptography widely, if everybody starts adopting cryptography wildly widely if the everybody starts adopting cryptography it threatens to create these dark zones in the internet where law enforcement cannot penetrate the going dark problem and the court is he goes you know the law has not kept pace with technology and this has created a public safety problem. So you might go okay well why do we need the cypherpunk values? Cypherpunk values, what are they? Number one is anonymity and I'm not talking about when I say people go oh our project is private, like oh we provide user, no I mean strong anonymity in the sense that if they come for you they cannot find out who you are you are completely protected and there is no gray zone there there is only the project your project is either anonymous or it's not anonymous also censorship resistance what that means is a 100% pure free speech. You can say whatever you want and nobody can shut you down. There is no compromises with free speech. It is absolute. Third property, sovereignty. What that means is we run the infrastructure. We own the infrastructure. They cannot shut it down. It's like in our hands, in the hands of the community. So why do you need these things? Well, imagine a scenario where an authoritarian government comes into power and they begin oppressing your friends and putting them in jail. And you need to mobilize to create a parallel free society. What do you do? nhw mewn gaeaf ac mae angen i chi ddyfodolu i greu cymdeithas llaw ar gyfer cyflawni. Beth ydych chi'n ei wneud? Rydych chi'n creu DAO anonynus, rydych chi'n cyfathrebu anonynus, rydych chi'n cyflawni arian resources to people for different projects. You coordinate the work using anonymous infrastructure, anonymous task managers, and then people get paid a salary. They get paid money. They need to cash out. They need to do OTC. They need to trade it so they can pay for stuff. And people using this infrastructure are able to mobilize. And, you know, what I'm talking about is not a theoretical thing. It's a real thing. The time is coming. And we all feel that within the next five years or so, there is going to be some major event of huge macro, you know, economic or political significance. Right now, they are putting devs in jail for making anonymous software. And when they are doing that, they're trying to frighten people into compliance. And it's like, you know, if I say something and, you know, I'm just saying, you know, commenting about something and you suddenly go, I suddenly go, or someone says to me something, I suddenly go, oh yeah, blah, no. And I react really aggressively and you go, or someone says to me something, I suddenly go, oh yeah, blah, no, blah, blah, blah. And I react really aggressively. And you go, whoa, why is he reacting so aggressively? That is not a sign of strength. That is not a sign of power. So when they are oppressing people and putting people in jail for making anonymous software, that is not, we are not meant to back off from that. That is a signal of where they're weak we're meant to hit them harder we're meant to push further and you know people always go to us oh you know what about this project what about this other project you know Darkfire has no competition because you know there's all these projects go oh yeah I'm a privacy project but I'll join our discord you know check out our Google Docs they are putting people in jail they're putting people in jail and if you are using discord then you are obviously not afraid and if you're not afraid you're probably not doing anything important dydw i ddim yn ffurfio eich bod chi ddim yn gwneud unrhyw beth o bwysig. Yn Lloegr, fe wnes i weld y diwrnod diwethaf, un mhobwys, aeth i brotest ac es i ar y sain a dweud bod y gwleidyddion yn corwpt, for three years. I even read now that they are reducing the time served for criminals in jail from 80% to 60% to make more space in jail because they expect more people to go to jail now, more higher capacity because of these new speech laws. How crazy is that? They're putting people in jail. And people are really suffering right now. The elites are trying to divide society, separate people from each other. They're actively hostile to the interests of the people. fee and we have not in in after billions of dollars of VC money you know the VCs they get the money from central banks you know they get it from their their friends in Wall Street and you know they're not going to they don't put it into disrupting the status quo but then this industry which was meant to change things to have an impact goes to those same guys ends up you know kowtowing before them trying to ask ask, oh, please, sir, give me some funds. And that's why we haven't been able to deliver. That's why projects are going, join our Discord, check out our Google Docs. We haven't even built a chat app after so many years. And now you're going on Twitter and you're seeing a project going, oh, I think the future is AI, conscious agents, communicating, allocating research. It's like, have you built any of that? No. You haven't built anything. It's just talking rubbish. We haven't built the basics that people need. And then people go, okay, you know, Dark Five, what you're building, what about criminals? What about the criminals you know everybody all the movies is is always is all about like you know mafias and criminals and gangsters there's no miss that's not there is a the reason why people are you know like watching this stuff and they're going oh you know I actually sympathize more with the criminals",
  "eventId": "devcon-7",
  "slot_start": 1731490200000,
  "slot_end": 1731491400000,
  "slot_roomId": "stage-6",
  "resources_presentation": "https://docs.google.com/presentation/d/1p6CtJjA99UENn3f3VpXSbI_lYWQj6O34OdWgb8FUKiE",
  "resources_slides": "https://api.devcon.org/data/slides/devcon-7/darkfi-kills-glowies-intro-to-the-worlds-first-anon-dao-anon-markets-anon-chat-the-coming-regfi-vs-darkfi-split-the-dark-forest-and-secure-freedom-for-sovereign-society.pdf",
  "speakers": [
    "amir-taaki"
  ]
}