{
  "id": "dark-winter-why-the-risk-of-unnatural-pandemics-is-an-existential-threat",
  "sourceId": "7QAKPP",
  "title": "Dark winter: why the risk of unnatural pandemics is an existential threat",
  "description": "The past history of pandemics and biological attacks, lab accidents and epidemics show a recurrent theme of denial, silence and cover-up around unnatural epidemics and the powerful vested interests at play. Quantum advances in genetic engineering and synthetic biology may lead to a future where resurrection of extinct viruses are the norm. The risk of unnatural pandemics is greater than ever and poses an existential threat. Early warnings of epidemics through OSINT can help mitigate the risk.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Collective Intelligence",
    "Public good",
    "Security"
  ],
  "keywords": [
    "Biosafety"
  ],
  "duration": 864,
  "language": "en",
  "sources_swarmHash": "fc62999de5279d4c4492e7e5c95b848c48598b366808d9e9a2db619a01a4f630",
  "sources_youtubeId": "D7vo7P_bz0g",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735ac4c9dbb7a90e1a8d049",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735ac4c9dbb7a90e1a8d049.vtt",
  "transcript_text": " To tell you about what we've done with funding from Balvi, but first I want to explain the context and why I'm so concerned about the risk of unnatural pandemics. These are just my declarations. I'm a physician and infectious disease researcher from Australia. So we hear about epidemics all the time, right? We hear in the news about avian flu, about mpox. We know that these things are never-ending. And actually, the data shows the risk of new emerging infections is increasing. Really important to understand the past and the present in order to look at what the risk is in the future. And this case is a really good one because it illustrates all the problems with the medical community accepting the possibility of unnatural epidemics. And this is Bhagwan Sri Rajneesh, whose cult perpetrated the biggest documented bioterrorism attack in the US in 1984. The public health authorities, including the CDC, judged that it was a natural outbreak. And there was a politician who said, no, I think the Rajneeshis did it. And he was ridiculed and shouted down. And even six months later, when Rajneesh confessed that they'd done it, he wasn't believed. So even a confession isn't enough to identify an unnatural outbreak. Where does that leave us? And then a full 12 months later, the FBI was doing a raid on the ranch of the Rajneeshis and came across their illegal bio lab, which had far more dangerous pathogens in it than the one they used for this attack. There's just so many examples that I don't have time to give you about the inability of the medical and public health community to ask the question even about what is the origin of this epidemic, let alone identify unnatural ones. San Francisco in the 1950s, the US military sprayed bacteria over from a ship in the ocean over the San Francisco to see how far they could disperse a biological weapon. And people did get, they thought the bacteria was harmless, but people did get sick and one person died. No one knew anything about this until 30 years later when a journalist uncovered the truth. And the medical community did not recognise that it was an unnatural outbreak. Then in the 60s, the US military dropped light bulbs into the subway system filled with trillions of bacteria that were a proxy for anthrax. It wasn't actual anthrax, but a similar related bacteria to see how the spores would disperse in the tunnels. In the Soviet Union, an island called Vozrozdenya was used as a biological weapons testing facility, and in 1979, they exploded a smallpox bomb on this island. There was a ship passing by 15 kilometers away, where someone got infected, and it set off a big outbreak of smallpox, a highly fatal outbreak in the town of Aralsk. And there's numerous other examples, including a pandemic of flu that occurred in the 70s, which was traced back to an improperly inactivated vaccine strain of the virus. And for 30 years, scientists kept denying that it was an unnatural outbreak. This man, Ken Alibek, was the deputy director of the Soviet Union's bioweapons program, Biopreparat, and he defected to the US and he wrote this book which really details some of the pretty mind-blowing things they were trying to do in the 60s and the 70s when the tools were much more clumsy than what we have today. So they were trying to engineer even more fatal versions of smallpox, shorten the incubation period, and to combine genes from smallpox with other deadly viruses like Lassa fever. And if they were doing that today, it's just so easy to do it, whereas back then, fortunately, it was much more difficult. Basically, anything with DNA can be edited, whether it's a virus, a plant, a human being. And, of course, human genome editing started in 2016. In 2018, a Chinese scientist caused an uproar by not only editing two embryos but bringing those children being born. He presented the results at a conference, and there was this enormous faux outrage by the whole global community. But very soon afterwards, all the superpowers jumped on board into what I think is the new arms race, which is engineering of human beings. In the UK, and of course the objective is to engineer super soldiers, in the UK you can't even request a freedom of information, you can never find out what they're doing. So you can bypass Mendelian inheritance, you can insert heritable characteristics, you can prime a whole population in the type of attack that could be done today includes releasing something that would prime a population to make them more vulnerable and then a second attack with a biological weapon. So like every type of technology, whether it's robotics or AI, biological research has dual use potential. So mostly it's used for good, but it can also be used for harm. And we could be living in a Jurassic Park of viruses and not even know it. The first synthetic virus was made in 2020, and it was in 2002, sorry, 25 years ago, about 25 years ago, by some American scientists who created a synthetic version of polio. And then some Australian scientists created a version of a virus related to smallpox that was 100% resistant to the vaccine and universally fatal. And all that research is open source, which means someone else can read it and copy those methods. In 2018, Canadian scientists created a pox virus very closely related to smallpox called horsepox. And if you can make one, you can make any of those orthopox viruses. And there's been a range of other quite scary research, including synthetic Ebola. And ever since the SARS outbreak in 2003, scientists have been fascinated with creating a SARS version 2, and there's numerous publications prior to the COVID pandemic detailing this research. So the guys who developed the... Can you put the slide forward for me? My pointer isn't working. The scientists who developed the synthetic horsepox virus, they... So the two ways in which unnatural pandemics can occur are error or terror, and the picture on the left is the Sverdlovsk anthrax outbreak. That was a town in which the Soviet Union had a bioweapons facility. Someone forgot to replace the filter on an air vent one night, and all night long they were pumping weaponised anthrax into the town next door, and at least 100 people died. But the Soviets said it was a natural outbreak they said it was due to the wet markets they made a big show of killing dogs in the markets to prove that it and they interestingly at the height of the Cold War the Americans agreed with them completely that it was a natural outbreak so from the medical and scientific community the consensus was it was a natural outbreak and it wasn't until the fall of the Soviet Union that Boris Yeltsin confessed that it had been a lab leak. And in the case of Terra, one of the other examples of an anthrax outbreak is the one after 9-11 where it was pretty obvious because the anthrax was mailed in envelopes with threatening letters. Today, anyone can create a biolab in their home, just as you can make a meth lab in your kitchen, so too can you do it yourself, biolab, and the possibilities are really endless. The scientists that made the synthetic pox virus said the advance of technology means that no disease-causing organism can forever be eradicated because you can always make it in a lab. And that's the sticking out of a warehouse in Reedley, California, and very, very slow and inadequate response from US authorities. It took them three months to get a warrant. By the time they searched it, they found about 1,000 humanised mice, vials labelled Ebola, HIV, SARS-CoV-2, etc. And it was a biotech company that was supposedly making COVID rapid antigen tests for which you do not need animals or live virus. And that's still being investigated as to how that happened but it just shows you how wide open the risk is. In terms of current epidemics the clade one mpox in Democratic Republic of Congo is a huge problem. 70% of the cases are in children, 80% of the deaths are in children. This is much more highly lethal than the MPOCs that caused the Clade 2 epidemic in high-income countries in 2022. There's a long sting in the tail of SARS-CoV-2. It's still causing substantial excess mortality. And our research showed that long COVID has major economic impacts. In 2022 alone, we estimated long COVID cost $9 billion of losses in the Australian economy from people being unable to work at full capacity or only at partial capacity. And then H5N1, bird flu in the US, 30% of commercial milk samples on the supermarket shelves are contaminated with the virus. If it's pasteurised milk, it's probably not live virus, but if you're into drinking raw milk, it probably is. And it's just a matter of this virus switching its preference from birds to humans, which have different receptors in the upper respiratory tract, and then we've got a pandemic. Now, how do we detect these pandemics when they're arising? The risk is there. How do we detect them? The traditional methods we use, like lab diagnosis, that depends on having a test. If it's a brand new disease, there is no test. These are the graphs showing, these are data from WHO showing on the top the date of symptom onset. So that's the day people got sick. And on the bottom, the date of reporting. So you can see there's a substantial delay. So by the time you get official notifications, it's usually spread, which is exactly what happened in COVID. So we've got evidence from blood tests showing that COVID had spread through Europe and the US in November, December 2019. So we developed an early warning AI system using open source intelligence called EpiWatch. Now a true epidemic disease grows exponentially and that's why you go from zero to a hundred in a short period of time and why health systems collapse and why critical infrastructure collapses because of this exponential growth. So time is critical and we're trying to find the signals very early before governments are aware of it. And literally the COVID response did occur in the red zone. So we use three different AI systems and we search in over 50 languages. In fact, 70% of all the intelligence we get is in non-English languages, which tells you how important that multilingual intelligence is. We visualize the data in a number of different ways and we do a pandemic watch looking for undiagnosed pneumonia we've published quite a bit of research on it including looking at epidemic signals in Ukraine that in 2022 all formal surveillance ceased so there were no more reporting of COVID cases of TB of HIV nothing so we were able to give a very comprehensive picture of what was going on epidemic-wise from open source data. We also looked at radiation signals in Ukraine using the same methodology. But ultimately, a tool like this, like EpiWatch, and this is where Balvi has helped us as well with the philosophy of Balvi as well, is that it's no good having a tool like EpiWatch being used by an elite few in some building in Geneva or wherever. It really has to be used at the grassroots by local health workers on their mobile phones so that they're aware of what's going on and they can connect the intelligence with what they're seeing on the ground. And so we launched an app in Hindi in 2023, working with the National Institute of Epidemiology, which is a government agency in India. And we're continuing that work now, looking at evaluating the use of this app, hopefully next year. So thank you very much.",
  "eventId": "devcon-7",
  "slot_start": 1731568800000,
  "slot_end": 1731569700000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/16BGl6R_AIgh1Fz7_yHfLOgt8VeqXZacUFlcwQz9qvOU",
  "resources_slides": "https://api.devcon.org/data/slides/devcon-7/dark-winter-why-the-risk-of-unnatural-pandemics-is-an-existential-threat.pdf",
  "speakers": [
    "raina-macintyre"
  ]
}