{
  "id": "debunking-myths-about-building-out-of-sea",
  "sourceId": "CDVQ7R",
  "title": "Debunking Myths about Building out of SEA",
  "description": "South East Asia is home to a burgeoning community of builders and some of the most influential projects in Ethereum. Listen in as SEA founders share their experiences and answer your questions about building out of this corner of the world.",
  "track": "Real World Ethereum",
  "type": "Panel",
  "expertise": "Beginner",
  "audience": "Local/SEA",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Local Impact",
    "SEA",
    "myths",
    "SEA"
  ],
  "keywords": [
    "Build",
    "Myth",
    "Local"
  ],
  "duration": 3997,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736e6a41b0f83434d0fc5ad",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736e6a41b0f83434d0fc5ad.vtt",
  "transcript_text": " We've got Harith Kamarol, Loy Lu, Matthew Tan and Tian Li. Let's welcome them on stage. Alright, good afternoon everybody. Can I get a show of hands how many people here are not from Southeast Asia? Alright, and the rest of you are all locals? Semuanya? Boleh saya dapatkan tanggungjawab bagaimana banyak orang di sini tidak dari Asia Tenggara? Baiklah, dan yang lainnya semua lokasi. Terima kasih atas sokongan. Jadi kita ada TN, Matthew dan Loy. Sebelum kita mula bercakap tentang membangun di Asia Tenggara, saya rasa penting untuk orang-orang untuk memahami kisah anda untuk ruang ini. Jadi jika anda terserah for people to understand your stories for this space so if you mind giving a quick introduction about how you got into this space and more importantly where you were in your life like geographically career-wise like where were you in that phase of life so you can start with tian yeah hi i'm tian um ceo co-founder of pendle i got started in crypto as a hobbyist back in 2014 when I was doing a research for a professor on fintech. At that point in time, I think fintech was still very heavily tied to... Sorry. The entire crypto sector was very heavily tied to fintech. And, you know, just looking through various business models and ideas, and I thought like Bitcoin was very interesting. Was involved in the space as volunteers in a couple of projects, but I became professionally involved in crypto more seriously when I joined Kyber in 2017. So yeah, Loy here, former boss. But it was a fantastic opportunity because it opened a lot of doors. I got to see the evolution of DeFi, crypto as a whole at the front row seat. And I would attribute everything that I know about crypto today to the experience. It all started from the Kyber days. Yeah, I've always been in Southeast Asia, traveled a lot, but primarily been based out of Southeast Asia my entire life. And maybe I'll skip Matt just because Tien mentioned Lloyd. How was your introduction to this space and then how did you introduce Tien as well? I was a PhD student at National University of Singapore. Very early in my PhD career I was given the opportunity to explore whatever that I want to do with my life so that was the best part about NUS. Yeah, so I stumbled on a couple of articles about Bitcoin and I was like, okay, this sounds interesting. I decided to basically dive a little bit further into it. And I think a few months after that, the white people of Ethereum was introduced, and everyone was talking about Ethereum everywhere. And basically, it opens a lot more opportunities for people to do",
  "eventId": "devcon-7",
  "slot_start": 1731646800000,
  "slot_end": 1731650400000,
  "slot_roomId": "stage-6",
  "resources_presentation": "https://docs.google.com/presentation/d/1SpHoMINj55MzEUWqqO7ToaiDbowMedsSM9tKnMWMaSY",
  "resources_slides": null,
  "speakers": [
    "harith-kamarul",
    "loi-luu",
    "matthew-tan",
    "tn-lee"
  ]
}