{
  "id": "decentralizing-economic-opportunity-communities-using-crypto-and-decentralized-protocols-to-make-local-economic-impact-in-brazil-nigeria-and-kenya",
  "sourceId": "SRYTXY",
  "title": "Decentralizing economic opportunity: Communities using crypto & decentralized protocols to make local economic impact in Brazil, Nigeria & Kenya",
  "description": "In communities facing economic scarcity, decentralized currencies are seen as a transformative solution. But what is their real-world impact? This talk explores the stories of three communities using crypto to drive local economic opportunities. It examines what brought them to crypto, the pros and cons of adopting tokens and focuses on diverse use cases like UBI, credit, and community currencies. Features video, data, and impact metrics of the people on the ground in underserved economies.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Use Cases",
    "Ethereum for Good",
    "Local Impact",
    "market",
    "emerging",
    "Ethereum for Good",
    "Local Impact",
    "Use Cases"
  ],
  "keywords": [
    "ReFi",
    "Emerging Markets"
  ],
  "duration": 1644,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "VduhOSI-CxQ",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6733f6d03a168eb535426732",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6733f6d03a168eb535426732.vtt",
  "transcript_text": " Hello everyone. Hi everyone. Stick around because that was really the perfect introduction for our talk. In a wider framing for how decentralized currencies are actually being put to work in different emerging economies. I'm really excited to talk to you about how we're using the free permissionless distribution of money to really impact people on the ground in last mile communities that are currently underserved by traditional financial systems. I am here as the executive director of a project called GoodDollar. GoodDollar is a universal basic income protocol whose mission is actually to enable anyone with access to a smartphone, with a cell phone, to be able to access decentralized currencies and actually onboard into crypto. We do this through distributing a digital universal basic income every day, and that's helped us onboard nearly a million people. I am thrilled to be joined here today with Jambi Jorge, who is the director of grassroots economics, which is, I would say, probably one of the leading projects, if not the leading project, that's actually innovating with decentralized currencies and really breaking the monopoly on money in terms of helping communities to create more credit, more commerce bottom-up through using decentralized tooling. And it's a great example of Ethereum in the real world. I will say that I've been building in this space for a long time, and it makes me very excited to see the talk that came before, if you will, that really shows that this progress is happening at scale. And Jambi is, I'd say, the zoom in, the double click in, as to the framing that we just saw. So some of you guys might have seen, crypto is useless. Some of you guys might have seen this tuk-tuk yesterday or seen some people walking around with a crypto is useless hat. And the idea here is actually a very clever campaign out of Celo, which is that crypto is useless unless you've had a real need to use it. And the meta-framing for all of this is that there are still 1.7 billion people around the world who are living in countries where inflation outpages wages. If the past few years have been any indication, that's going to continue to increase. There are 1.4 billion adults around the world that remain unbanked. That means people who have no access to any of the financial services that Joseph just mentioned in terms of savings, payments, credit, etc. Most of this 1.4 billion people have access to a very magic computer that they carry around in their phones, which is a smartphone. And that's what enables them to access the same Ethereum virtual machine that we all use. And so there's the 6.17 million crypto owners today represents a big gap to close in terms of where crypto still has its biggest potential to make a real impact on the financial lives of billions around the globe. We're here to talk about decentralized economic opportunities. So what are some of the principles that we're looking at? The first is permissionless access. So how are we actually removing gatekeepers? Crypto is the most obvious example of that. Anyone can sign up for a Web3 wallet. Anyone can send or receive currency. It is this permissionlessness that actually enables local empowerment to happen bottom up, where communities are able to grow in their own super cycle, if you will. And ultimately, this is designed to drive resiliency and adaptability for economies that, where it doesn't really make sense that the global macroeconomic shocks of, say, the U.S. presidential election have such a big effect on last mile farmers or communities all around the world. And so this is designed to actually increase resilience so that there's less of a single point of failure for individuals and communities. The reality is that still today, it's places where capital is needed the most, that capital is the most expensive. This comes as no surprise to anyone here from the real-world Ethereum track. But in Nigeria, just for context, for a $100 to $1,000 loan, you're looking at an annualized interest rate from anywhere from 30% to 50%, right? So if you're actually looking to start a small business, it means that money is more expensive for you than it is for many of us from the United States or from Europe. And the user experience has also kept crypto adoption from happening for a number of reasons, right? So up until very, very recently, it's been very hard to access Web3 in terms of the sign-up process for a wallet. Certainly, if you don't have access to a bank account, it's not that simple to go online and buy $100 of Bitcoin on Binance. All of this results in there being a very high cost of experimentation for individuals. And this is what creates this narrative around crypto being useless, right? Is that with all these challenges facing the space, it's hard to build products that seem like they're of real use. However, in 2024, we're facing a new reality where not all of our problems have been solved, but certainly the potential exists to make a massive change. We see that there are a number of simple mobile native solutions. There are over 100 million stablecoin holders around the world. This has probably been seen as one of the key killer use cases of crypto today. And this creates the preconditions for us to really begin to build for real communities and real needs. All of this is critical because everything happening on-chain, everything happening transparently, actually improves our odds for financial access because it enables individuals and communities to really build credit history in a transparent way. As we just discussed, it's actually lower middle income countries that are driving crypto adoption today. So India, Nigeria, Indonesia are the fastest growing crypto markets, and 15 of the 20 fastest growing markets come from low-income countries and Unsurprisingly, it's decentralized systems and currencies that are leading the way This is most likely because of leapfrog innovation, which was referenced before where when there's no pre-existing technology to overcome people just just jump directly to the next generation. And so grassroots economics, which has been building in this space for a long time, I consider one of the flagship leapfrog innovations in the space because they're innovating both on the payment rails and fintech level, but most importantly on the currency and the monetary level in terms of really breaking the monopoly on money and how communities can create their own value, create their own credit worthiness, and actually expand the amount of economic activity that they're doing within the community. This is where crypto has its biggest potential, and it's my true pleasure to introduce Jambi Jorge, who has been building this and implementing this on the ground for actually nearly 100 communities. And she's flown here today from Kenya to tell us about her work and some of the impact that it's had on their communities. Thank you, Anna. Yeah, my name is Jambin Jiroge. I have been working for Grassroots Economics Foundation for the last six years, and I'm really happy to be here. I am an advocate for community inclusion currencies for poverty eradication and sustainable development. So how do we heal a post-colonial legacy of torn communities and ecosystem? How do we enable communities to create scale and scale credit? How does this enable wealth creation to stay within the communities? This, commitment pooling. We've been working on commitment pooling, which is an economic protocol inspired by indigenous wisdom. So when I talk about indigenous wisdom, I mean rotation of labor association. I come from the Kikuyu community in Kenya, and we call it Mwethia. We have so many communities in Kenya with very different names for this indigenous practice. And it's not just in Kenya, it's even global. What you're looking at, the pictures here, the first one is a type of a rotation of labor, an educational kind of it. That is a service, women grinding maize for flour. That is an infrastructural kind of way and there's so many. So, this is the difference of what was and what is now. So, what was the shared economic commons? You know, we had synergetic commitments, harmonious flows, accountable systems, you know, ecosystem regeneration, democratic stewards, and like what we have now. You know, the fiat dominance, open markets, etc. Now, in communities right now, you know, the fiat dominance, open markets, etc. Now, in communities right now, they have these six assets. For them to understand they have the six assets and to understand at what level these assets are is very important, and that is what you're doing with communities now. And this image here is them realizing that they have it. Like, I have what you don't have, and you can benefit from one another. Creating that web is really visualizing what they can and what they have to offer one another. Now, I was talking about rotation of labor associations. So this is all about making commitments, fulfilling commitments, and accepting commitments. So just to explain rotation of labor in a bit, this is family one, family two, and family three. All the families have needs. They need a house built. They need a farm fixed. So what they do, they create commitments backed by, they create commitments, and then they say, okay, fine, I'm committing, I will come and help build a house for family one. I'm also committing that I will also help family two build a house. And eventually, they pull their commitments together, okay? So those are pulled commitments. So that means when I make commitments, I will accept commitments and I will also fulfill commitments. So when they all fulfill commitments, they are allowing accountability and exchange, and they have a clear and non-agreed-upon rules. So eventually when they do a cycle of helping one another, giving commitments, accepting commitments and fulfilling commitments, there is a range of physical assets grown, social assets grown, human, spiritual, political and natural assets, you know, they change. Now, Grassroots Economics Foundation has been helping formalize these commitments by adding technology and now it becomes easier for me to value what i'm offering in a community it's easier because they have a unique signature there is an expiration date you can you can decide to have a demo or not but a demurrage is very important to help with the circulation of the vouchers and then it also means that whoever accepts That voucher has the right to redeem it from the issuer. Okay? now Making commitments and fulfilling commitments and accepting commitment is paramount and this is what used to happen and it's now What you're advocating for but trust is very important. This is how trust was grown then. This is a nice illustration. We do a lot of games and practicals when you're training communities. And this is how they understand the current reality by understanding the six assets and at what level is which asset. And when they do this, they're able to come up with a vision and know how each person, each action step will be worked on according to the rotation of labor associations now this is production financing this is also a very important protocol that you've borrowed from our forefathers it only means that when the community members create vouchers, they put them into the pool. And when a financial wants to get some of the products that are backed by these vouchers, they will need to put in money into the pool and pull out of vouchers. I'm going to give a good example of a financial who pre-ordered coconuts from farmers in Kilifi. So what they did, they put money into the pool and took the vouchers backed by the coconuts. Coconuts take five to seven years to grow. So that means when... So the financier had the money before, prior, and the vouchers prior, and the community members got the money before. So that means they were able to sort out issues, fees, better farming methods, better tools. So we're just basically bringing a nice socioeconomic process that is about bringing together a nice blend of changing the traditional demand and supply models is about bringing together a nice blend of, you know, changing the traditional demand and supply models and, you know, tokenization. Now, this is what the communities in Kenya are doing. They're using the USSD, and there's also the web interface. So this is mostly, the web interface is mostly for those who do not have smartphones, phones, so they can create their own paper wallet, and they can use one phone. Now, we have so far seen over 65,000 households using vouchers in Kenya today. We have 4 million plus worth of transactions, USD worth and 5X average multiplier effect. So, pooled commitments enable us to scale into the future to our beautiful shared heritage. Thank you. Thank you. And so, this came up in the talk right before, but it's actually how do we use these systems rather to create new trust, but actually to unlock trust that actually already exists on the ground. And this is what I've admired, the work that grassroots and Jambi have been doing for so many years now is actually looking bottom up from the community infrastructure and developing tooling that actually enables those communities to unlock and assess value in new ways. Excitingly, this is one example of, I believe, thousands, if not hundreds of thousands that are happening around the world in terms of communities that are beginning to build circular economies using decentralized currencies that actually enable people to create their own value. This is a circular economy image from a community in Brazil that has hundreds of women that actually operate using the good dollar token as a community store to buy and sell services. We also have great examples of different entrepreneurs around the world who are using decentralized currencies bottom-up to create airtime shops, enabling people to use crypto to swap into mobile minutes, into airtime value, which actually is a basic need for anyone living in the contemporary world. And I think really critically the reason why this is relevant and relevant now is because now we start to compose the full stack that actually enables this to become practical and possible and it involves more than just technology, right? And so what we see is that building the stack bottom up from the technical layer, what makes it actually useful for real people, for the hundreds of people that Jambi and Grassroots have touched, is actually the social element, the community and education element that actually brings people along and customizes these technologies for their needs. So to bring it back, crypto is useful, but it's most useful in an ecosystem that has all of the different components of the stack that make it useful. And so this suit that I'm wearing is not just for fun. It is fun, though. It's to represent the idea of an ecosystem and the value of an ecosystem and that actually being the critical enabling linchpin to making the real world Ethereum useful. And I think everyone at DevCon who's made such an effort to come here to actually contribute to this ecosystem understands that. And the more localized ecosystems that we develop, the more we will see this come true. So yes, this is crypto today. Real world Ethereum is decentralizing economic opportunity. And I think we need to stay passionate and stay focused because this is still the biggest upgrade to money since it went digital. We see decentralized economies actually upgrading the money itself and it enables money to flow back to the parts of the economy that are otherwise deemed unprofitable or non-profitable and this is what grassroots and other projects are doing it actually enables the real wealth to come back into community because in you know many communities around the world the people are there the resources are there the desire to collaborate is there. But what's actually missing is money. And so if we can actually innovate on the money itself through using the right tooling, then we are able to support the decentralization of economic opportunity that we want to see happen. Thank you very much for listening. And thank you to the Ethereum Foundation for making this possible. All right. Awesome, guys. So again, Q&A session. We have the QR code on the screen. Scan it and send the question to the screen so we can see what you have burning question here. All right, guys. Let's see, I think people just wait a little bit. People are still scanning. I think we have about a few minutes while we're waiting for them to send the question. Anything you want to say, add on a little bit? There's something else I wanted to add. For the production financing page, when you put in money, community members can now withdraw that or ramp that via Valora, MiniPay, through Kotani, OneRamp, PhoneBank into Kenya Shillings. So it's really been amazing. And I would also want to thank Ethereum Foundation for making sure that I got here. Thanks. All right. You have a question? All right. Do you mind pass the mic? One second. Oh, here's the question. But let's hear from the ladies first. Okay. Okay, go ahead. Thanks for calling me lady. I'm not sure I identify that way, but sure. I'm sorry. It's okay. So, Jebdi, this is a question for you. What are the biggest barriers that are still faced? Because you've obviously had to overcome quite a few to get the technology in place to support these existing traditional systems. What are the barriers that still exist, if any, in utilizing technology in this way? Yeah, so one of the major barriers that we've had to, you know, we still live and experience right now is the network connectivity in some of the rural areas. So when they are trying to sort of exchange into the swap, yeah, so network connectivity in some areas really is a challenge and we normally sometimes have to force them to go to the nearest cyber cafe or the nearest school because we're assuming that is where they would get network. So movement challenges and I would say that is, like, one of the major, and really smartphones, phones in some rural areas. So we've had to, like, even give a group, like, one phone where they need to, like, log out, log in using their paper wallets. Sure. We have three questions on the screen. Anything you want to answer first? So, the first one, how do we quantify impact? So now, when I was talking about production financing, so what we do, we borrow this from the past, okay? So in communities, there were leaders in each community, like village elders. They would sit and decide the next rotation of labor activities. So now we don't have staff at grass, like salaried staff. So what we do, we work with stewards, and stewards are members of the community. So they are the ones that handhold the community members. So whenever the communities are meeting for rotation of labor, whatever it is that they do, is it building houses, is it building roads or tilling farms? So they send that as a report. So what we do, we put in sell a dollar into the pool, get their vouchers. So the vouchers in this case is backed by their commitments or their M&E services. So when the report is in, then we pay them back using the vouchers. So really the trades on the Saraf.network platform represent the reports that they've sent. So these trades in the eastern part of Kenya equals to 10 houses, 5 ETC. All right, that's awesome. Let's go to the next one. I think we have like three minutes to question, Maria. Yeah. No, no, you take your time. I'm going to address the first two in one answer. So how do you actually deal with onboarding? I'm going to speak now from we gave money away. From the perspective of good dollar, UBI or free money has actually proved to be an incredibly effective onboarding method in terms of bringing people into Web3. And I think what's important about that is that we see that that onboarding mechanism then translates into people exploring a deeper financial life on-chain. And so obviously a good UX, simple onboarding experience, but actually making assets free and accessible and encouraging people to experiment has been critical to onboarding people, retaining people, and encouraging their ability and desire to experiment. There was one other question, but I forgot. Oh, it's about creating trust between local... How can trust between local communities in emerging countries and the global crypto ecosystem can be unlocked? So I think, in my experience, a lot of this is actually happening on the local and the community level, right? So it's through local community leaders that create the relevant education and context for the individuals that come along and are the individuals that are also members of that community. And as builders, it's about having the relevant on and off ramps and the relevant tools that are specific to that particular country and country context. So I think that has actually proven to be on and off ramps which come up all the time, and the wallet experience are the really critical bridges in the actual user experience when it goes from someone using a very specific local app or currency such as grassroots versus the cash-out experience, a.k.a. fiat in my pocket, mobile minutes on my phone, Ethereum in my wallet. All right. Anything, three obvious questions you want to answer? We have like one more minute if you want to. Yeah. How do we deal with failures of trust within a group? Like, from our experience as grassroots economists, we work with already existing groups that have their own constitution, and they know how they deal with some of these challenges. So what you're doing is just adding technology to a practice that they already know, that has already been there. So most of the times, the groups follow what they normally do, even without, like, amongst the community. Is it going to the chief? Is it going to the village elder? How do we sit down and sort that out? So mostly it's within the groups. Want to do one more? If you have a short one, we have a 30-second. You can do it if you want to. Want to do one more? If you have a short one, we have 30 seconds. You can do it if you want to. How can these initiatives be protected from bots? Yeah, go ahead. Sure. How can initiatives be protected from bots? It's a great question. Certainly when you're giving free money away, it's something that you have to confront and deal with. Decentralized identity or decentralized secure unique identity is not a new problem, and there's multiple ways to skin the cat. I'd say actually what makes me the most excited now is like new solutions that are based off of existing community and trust that actually enable members of groups to verify one another and verify the unique identity of one another. And I think this is a space that many builders in Ethereum have been tackling for many years. And we're about to see a next generation of solutions that are actually much more usable for individuals to verify one another. And I think that's how bots will be dealt with moving forward.",
  "eventId": "devcon-7",
  "slot_start": 1731409200000,
  "slot_end": 1731411000000,
  "slot_roomId": "stage-6",
  "resources_presentation": "https://docs.google.com/presentation/d/1_dONrIsV4L0B5mPO_9XqzEKOZKIP8ACpAPTEAQfEWMQ",
  "resources_slides": null,
  "speakers": [
    "anna-stone",
    "damaris-njoroge"
  ]
}