{
  "id": "demand-based-recurring-fees-in-practice",
  "sourceId": "GWBWPE",
  "title": "Demand-based recurring fees in practice",
  "description": "ALL 4 letter .COMs have been taken since 2013. Yet most only have a few natural buyers; hence, speculation doesn't make that market more efficient.\r\n\r\nYet, in crypto-economics, we can already transcend private property to deter the monopolization of digital assets like domains. \r\n\r\nThis talk explores solutions from Weyl, Posner, and Henry George. We'll show how pricing and allocative efficiency can be improved through Georgist land value tax for assets like real estate, domain names, or ad space.",
  "track": "Cryptoeconomics",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Economics",
    "Mechanism design",
    "Quadratic Voting"
  ],
  "keywords": [
    "pricing"
  ],
  "duration": 1338,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67348b6f9dbb7a90e151420e",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67348b6f9dbb7a90e151420e.vtt",
  "transcript_text": " How to use the new site project in practice So if you're a developer, you might have seen this already, or you might have come across this problem. You know, you have a new site project or something, and you found a name, and you type it into a domain name search, and then what you see is that, yeah, the domain name is just not there. And then in my case, for example, I looked for kiwinews.com, and there's actually a 500 error error, so it's actually not even used. And then I looked it up, how much it would cost for me to transition the domain, and it was actually 8,000 dollars one-off fee and 2,199 a year to then rent a domain and this kind of annoying because I would love to use the domain And fun fact all four letter dot-com domains have actually already been taken since 2013 and so In the talk today. I want to give you this promise that we can basically already fix this. We are just not doing it. And you will learn how. And so basically, this is not only a problem in Web 2. It's also a problem already in Web 3. 2022 where he basically said that All the nine thousand nine thousand most popular Eve names that are in the Scrabble word list for the most popular words. They could have been rented for 100 years for the equivalents of 12 Lambos essentially and that is because a Dot Eve name essentially costs five dollars a year to rent and so it's actually just not that much to squat these domains. But the problem even transcends kind of the digital space and it's actually a hundred years old and here you can see this behind me on this photo from 1914 where somebody bought a vacant lot in a city. I think this is in Illinois. It's from a person called Fay Lewis. And I'll read out loud the text on the poster and then we can talk what is going on here. So the poster basically says, everybody works but the vacant lot. I paid $3,600 for this lot and I will hold it till I get $6,000. The profit is unearned increment made possible by the presence of this community and enterprise of its people. I take the profit without earning it and for the remedy, read Henry George. So this is very similar actually to the domain names that we just saw that that are always being squatted in that somebody just did it with with real estate right and if we look top-down at inner-city real estate property then what we can see is that the pricing kind of is related not necessarily to the improvements on top of the lots, but it is related to the neighboring properties. So the A1 property here is most likely going to be valued higher than the A2 property because the A2 property is essentially next to like this garbage processing facility and a factory, whereas the A1 property is in close proximity to a university, a cafe, and so on. And so this really brings us, I think, to one of the core ideas of our talk, which is what is Georgism or Georgism in general as an idea. And Georgism, kind of how Georgists themselves describe what they're doing, is they say there is, first of all, land, and land is the source of all wealth in the economy. And so on this land, there are fruits that are growing, but I think more generally speaking, these are not only the literal fruits, but also, let's say, like minerals in the earth, the soil, even like the air part of the quote-unquote land, and then even the property rights that you can get when you have land in a city. And judges basically believe that the fruits can be harvested or extracted from the land by putting in labor. And then the fruits are actually the desirable good within the economy,",
  "eventId": "devcon-7",
  "slot_start": 1731495000000,
  "slot_end": 1731496800000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/15PZ749rPc9HedXMUE_qdwIMFPhSIfM_Qt1GSmEy4JsU",
  "resources_slides": null,
  "speakers": [
    "timdaub"
  ]
}