{
  "id": "demystifying-solo-staking-struggles",
  "sourceId": "9KV8UQ",
  "title": "Demystifying solo staking struggles",
  "description": "Is solo staking easy or hard? What are stakers struggling with? I will go over the main issues facing solo stakers and what can be done about it. I will talk about the importance of solo stakers.",
  "track": "Core Protocol",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Stakers/Validators",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Best Practices",
    "Home staking",
    "Staking"
  ],
  "keywords": [
    "beginners"
  ],
  "duration": 554,
  "language": "en",
  "sources_swarmHash": "3d144e5a76361e6fc5c09fda245ccedab865abf52497afcee7f791dba178d7aa",
  "sources_youtubeId": "Q-sMeimSWJU",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736d76774749a4b89323f1c",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736d86274749a4b893436c0.vtt",
  "transcript_text": " . Hello, how are you? Thank you for coming. A quick about us. We help users to run if you know in low-power devices such as arm boards like a Rock 5B or Orange Pie. And basically this is what we do. And so let's talk about running nodes. This was our first message that we sent to Reddit in 2016. It was about running nodes in Raspberry P3. It worked great. And turns out that eight years later, you can still run a full node, an archived node, or a staking node on these kind of devices, a similar device such as, as I said, the ROG 5 or the Orange Pi 5. So why? Why do we care? Why the community cares? Why the researchers care? Why the dev cares about running nodes on these devices, on commodity hardware. Well, first of all, the core purpose of the blockchain is to trust no one, to verify yourself. So you need a node to do that, right? And second, quite important, this helps individuals running nodes, helps the decentralization of the network. So how? Well, if thousands of individuals run nodes at home, you have anyone can interact with the Ethereum blockchain, anyone, no third parties, you don't depend on anything. Nodes are distributed over the world. A decentralized network should be consistently operational, pretty much 99% of uptime for Ethereum. The network can be used by anyone, anywhere. And additionally, if the low staking barriers are low, solo stakers can participate in securing the network. So what happens if there are no users, no individuals running nodes? So let's take the example of Solana, for example. The Solana's approach is about specialized nodes. As you can see, the requirements are data center-like. I mean, 256 gigabytes of RAM, four disks, a huge bandwidth for network. So nobody owns this kind of resources at home. So you cannot run a network at home. So you need to go to a data center and pay for cloud services or whatever. So these are two different approaches, home node runners versus specializes nodes. So the question is about decentralization. Is a network without home runners decentralized? Well, if you see the Nakamoto coefficient, which is basically, it's not enough. It is not. Because for us it's imperative to be able to verify the chain. Okay? And that means run your own nodes. So you see two different visions. One specializes in nodes. One home nodes, home stakers. So to maybe settle this, let me finish with two thoughts. This is a quote from Vitalik this Tuesday, actually. And if you have users that are verifying the chain, even two-thirds of the stakers acting together are not able to change the rules on people without everything breaking. The Ethereum rules can only change throughout the hard fork that is agreed upon through wide community consensus. I think that says it all. And the last one is about what we said about the core purpose of the blockchain. When we talk about truly decentralization, that means any user can run their own node at home and not rely on a third party or service provider for verifying the chain. So you don't have to depend on a third party. That's all. So my last message is run your own nodes for you, for the network, and that's all. Thank you. Thank you very much, Diego. Are there any questions for Diego? If not, I have one. Okay. Diego. How would you say, like, I have been trying to run on Ethereum, but I have not been successful. Why do you think there is so much trouble running? Well, actually with our solutions today, you need some technical skills. This is, yeah, this is a low barrier that we are trying to improve. But today, yeah, sometimes it's a little tricky. But you have other choices, you have other hardware that is easy to stop and other tools that can be very useful. But I think that anyone that wants to run a node, it's fairly easy with some tools. Definitely. Anybody? Don't be afraid of the mic. Okay, if there are no more questions, we will resume here at 10.50, so we now have a 40-minute break. Just to remember you. Thank you, Diego.",
  "eventId": "devcon-7",
  "slot_start": 1731642600000,
  "slot_end": 1731643200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/12_jK1k9PlkGv-cHbW_ySIi8eDOSs8LavI_tRw_CJE10",
  "resources_slides": "https://drive.google.com/file/d/1gs2a9CoJvoTKSpAlvhqGza_MZ_TXJu1B/view",
  "speakers": [
    "remy-roy"
  ]
}