{
  "id": "depin-pushing-decentralization-beyond-blockchain",
  "sourceId": "Q8QPSF",
  "title": "DePIN: Pushing Decentralization Beyond Blockchain",
  "description": "Explore the revolutionary world of Decentralized Physical Infrastructure Networks (DePIN), where blockchain meets real-world applications. This talk delves into DePIN's core concepts, from token economics to governance, highlighting its potential to transform industries. We'll examine successful projects, technological underpinnings, and future trends. Using Huddle01's innovative approach to decentralizing real-time communication as a case study, we'll demonstrate DePIN's practical impact. Join",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Developer",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Architecture",
    "Decentralization",
    "DePIN",
    "Tokenomics",
    "communication",
    "real",
    "time",
    "rtc",
    "Architecture",
    "Decentralization",
    "DePIN",
    "Tokenomics"
  ],
  "keywords": [
    "Distributed Systems",
    "Physical Infrastructure",
    "Real Time Communication (RTC)"
  ],
  "duration": 512,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735d59f9dbb7a90e186ef54",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735d59f9dbb7a90e186ef54.vtt",
  "transcript_text": " Hi everyone. Am I audible at the back? Yeah? Okay. Awesome. So hi everybody. I'm Akshit. I lead the engineering team at Huddle01. And we are a deep end dedicated to making real time communication affordable, cheaper and performant. So we are a deep end project. So if you're familiar with deep end, deep end stands for decentralized physical infrastructure. And we saw a gap in the market that real time communication is very hard and it's very pricey as well. So people like Zoom, companies like Zoom, Google Meet, all these rely on heavy infrastructure and have to host it on cloud providers like AWS. So this is what my talk is about, how Deepin can make it cheaper. So this is what my talk is about, how Deepin can make it cheaper. So as I said, Deepin stands for Decentralized Physical Infrastructure. And in blockchain, we've seen a couple of trends from the start. Things like NFTs have reshaped ownership, digital ownership. In games, you have these skins and everything, and these can be sold via NFTs to make sure that only one person owns it and stuff. And smart contracts have automated money transfer as well. So you can program how smart contracts transfer money based on a particular condition. But we're still deploying these things on centralized infrastructure like AWS. So if you were to build a complex app which requires heavy infra, you still host it on AWS. Things like storage and bandwidth still require centralized infrastructure. So that's where Deepin comes in. We saw this with Filecoin. So Filecoin is a really good example of a Deepin project, which is decentralizing storage. So similar with Filecoin. So Filecoin is a really good example of a deep end project, which is decentralizing storage. So similar to Filecoin, we have it for real-time communication. So charging for stocks and paying for flows. So this is a very interesting trend we saw. And AWS was charging crazy amounts of money for egress costs. So as you can see in the slides, AWS charges like 700x amount of pricing for egress costs. So say like you fill a bucket full of water, water being the amount of storage, then the amount of water that's being transferred out of AWS, which is data being transferred out, they charge really costly amounts for that and not for the stocks that they save. So that's how AWS is charging, and it's like 700 markup. So why I'm bullish on bandwidth projects like DeepNR? So internally at Huddle01, we did an interesting study where we calculated the bandwidth costs for hosting on AWS, like hosting a real-time communication app on AWS. And as you can see, for a single participant, the bit rate consumption was around 700 kbps. And for eight speakers in a room and 20 listeners, the data consumed was around 112 Mbps. And if we were to take like 100 such rooms hosted on a particular app, you'll see that it comes around 11,200 Mbps. So data consumed in an hour would be around 40,000 gigabits. So that's a huge amount. And if you were to calculate the data transfer cost on AWS, that comes around to $400. So if we were to use a Deepin project and these services were hosted on a physical infra where people are incentivized to run these nodes, then the price goes much lower. So these are some popular deep end projects. You can see Huddle01, which is the project we are working on. And some popular projects like Grass are also working in this bandwidth department where they're saving cost. All you need to do is just install an extension and you'll be good to go. So if you are looking to build a deep end, the best way would be to look for a market which is super overpriced and you can easily save costs by allocating that job to a particular person who can run it on their own machines or host it somewhere, maybe with less P. So as you can see, the less P the better. This is one thing to follow if you are looking to launch a Deepin project very easily. And it's very easy to deploy a project with less P as there's no physical part involved. There are really good projects with more P as well, as you can see on the left. But with less P, you'll be able to run it and make it work. So thank you. That was a small lightning talk by me. And I am happy to entertain some questions. Thank you. Okay, okay. Do we have any questions from the audience? Anyone? Let's wait for another five seconds. Okay. Oh, do you want to throw it? Yes. Perfect. So you talked about essentially that the less the P the better. You need to put it, it's a mic. Hello. Oh, wow. So you talked about a point where essentially the less P the better. I just wanted to understand if you have less P, there's also a chance of having more chance of gaming the system. That means verification can become tricky if your system is more digital rather than having a physical network. For example, Helium, it's very difficult to game a Helium system because you have a Bobcat miner, but in case of something like Hudl, it's more of a digital network, that means you require verification systems, more like QoS systems. So have you thought about that at Hudl01 where you can have a QoS system implemented which can act as similar to a physical infrastructure network as well so that nobody games it? So the best way to go about it is to first",
  "eventId": "devcon-7",
  "slot_start": 1731579600000,
  "slot_end": 1731580200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1frO1LBrX3h2e6LoJqHpvDElvChyEEDg6CFrkzwQt5VY",
  "resources_slides": null,
  "speakers": [
    "akshit-gupta"
  ]
}