{
  "id": "desci-on-trial-two-years-2000-eth-11-projects-2bn-data-points-on-ethereum-has-desci-advanced-science",
  "sourceId": "MZ3RLT",
  "title": "DeSci on Trial: Two Years, 2000 ETH, 11 Projects, 2bn data points on Ethereum - has DeSci advanced science?",
  "description": "Two years, 11 projects, $5M in funding for on chain science - what has DeSci on Ethereum really achieved? We'll critically examine key projects like Copenhagen University's longevity research and Newcastle's autophagy activation, assessing scientific rigor, web3 benefits, and real-world impact. Join us for an honest look at DeSci's promises vs. realities, featuring a live researcher update and helping shape a governance proposal on one of the presented projects.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Permissionless",
    "Use Cases",
    "DeSci",
    "impact",
    "DeSci",
    "Permissionless",
    "Use Cases"
  ],
  "keywords": [
    "Impact"
  ],
  "duration": 699,
  "language": "en",
  "sources_swarmHash": "665be7a46aec53f3558e341d98fa338cd77f6f9dbffb7880f5ab1880683bdffd",
  "sources_youtubeId": "8UReCWNKbLY",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67374b1f1b0f83434da8beb9",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67374b1f1b0f83434da8beb9.vtt",
  "transcript_text": " Welcome to the last day of DEF CON. Really appreciate you all still coming here after such a long and incredible week. This is actually my fifth DEF CON, so I'm really excited to be here. I have the honor to speak today. It's the third time I'm speaking, and it's just really incredible to see how the space has advanced. So I'm here today to talk to you about DeSci. Scientists today, roughly, at least the scientists that we spend, spend 80% of their time applying for funding and 20% doing the science. Academia, scientific funding, and even the biotech VC ecosystem is really broken in the sense of like how we distribute and access and fund innovation. Imagine if software developers had to spend 80% of their time getting funding to write a piece of code and only were coding 20%. Like that would take us back into the 80s and 90s. And that's essentially where our scientific innovation ecosystem is stuck. So we have the fundamental hypothesis that most of the world's potential scientific talent actually today remains untapped. We live in a time of science friction, not of science fiction. Those super cool, solopunk-like cities, we're only going to get there if we actually upgrade the way that we do innovation. So this is a Nature report that recently came out. A scientist that treated her own cancer with viruses. She grew in a lab. And she treated herself with this. And the response was that this under the radar stigmatized an ethically fraught practice. Essentially, scientists shouldn't be doing this. And there's a really cool comment. Scientists are science, cures cancer. The science, no, no, you can't do that. And then you wonder why scientists are fleeing academia. So de-sign, decentralized science, is ultimately really about making science permissionless. In the same way that we have permissionless money, we should have permissionless science. This is the typical innovation and drug development cycle that happens within a firm, this process today takes up to 10 years and costs up to $2 billion. And within here, you have, this is like one company, for instance, trying to cure cancer. Instead of all working together globally in a globally connected marketplace, each company does work by and in of itself. So what we developed on Ethereum is something called an IP NFT. It's a combination of a legal contract, a smart contract, and then you encrypt all of the secret sauce, the private data, on a combination of Arweave and Filecoin. This mechanism to date has funded over 2,000 ETH in research across the world. This, for instance, is the research portfolio of VitaDAO, one of the leading DeSci DAOs that exist today. So there's an ecosystem now of DeSci DAOs that are all actively So there's an ecosystem now of DeSci DAOs that are all actively using this framework to fund research on Ethereum. This, for instance, is with University of Copenhagen, University of Oslo. We have one project with Newcastle University. If any of you are into longevity research, the project that we funded at Newcastle is about autophagy activators. And these new drugs that are being developed that are 100% now owned by DAO are actually proven to be two to three times more effective than rapamycin. Rapamycin being the other leading longevity drug. This is 100% owned on Ethereum now. This happens, as I said, through an IP NFT. There's a further governance framework that we developed, which is called IPTs, which essentially make individual research projects now tradable. I'll go through a little case study. Sorry, it's very fast-paced. It's a lot of ground to cover for five minutes. So this project was funded for $90,000 in May 2023. It is about longevity gene therapy. It was then tokenized. This is how the IP NFT kind of looks on chain. And then here you can kind of see a public tokenization event where now members of VitaDAO can publicly contribute to funding this. Then a DEX Uniswap liquidity pool was launched. And what happens now is you have a live market that becomes really hungry for data, which typically doesn't happen. So all of the market participants at TokenHole are constantly in touch with the researcher, trying to find out how the research is going. So since then, he's released a whole bunch of data. This is a biotech developer who's also new to crypto. So we're bringing an entire new user base really into crypto. So since 2023, we've now built over seven of these different biodas that have in total sourced over 2,000 projects and essentially moved over 20 million of science on-chain. We have one focused on psychedelic research, for instance, another one focused on hair loss, cryogenics,",
  "eventId": "devcon-7",
  "slot_start": 1731658800000,
  "slot_end": 1731659400000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1GqW9KTYWAB1IHrlktGM0ntHgWK-2umJNkyohBO811gU",
  "resources_slides": "https://drive.google.com/file/d/1jFZuZ2WeWVYNPgGIF0en2wHSrVjdt5_U/view",
  "speakers": [
    "paul-kohlhaas"
  ]
}