{
  "id": "designing-and-launching-a-retroround-incentivize-what-matters",
  "sourceId": "39AVKD",
  "title": "Designing and launching a RetroRound - Incentivize what matters",
  "description": "Learn how to design, develop and launch a retroactive funding round. In this workshop we’ll explore the differences, similarities and best practices for running a local and ecosystem RetroRound. Participants will be able to set clear goals, define impactful behaviors to be incentivized, scope technical roadmaps, and formulate a sustainable strategy to fund public goods. Ideal for emerging markets community leaders and web3 Ecosystems looking for new resilient and diverse funding strategies.",
  "track": "Coordination",
  "type": "Workshop",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "RPGF",
    "Quadratic Voting",
    "Public good",
    "Design",
    "Mechanism design",
    "program",
    "grants",
    "Mechanism design",
    "Public good",
    "Quadratic Voting",
    "RPGF"
  ],
  "keywords": [
    "Emerging markets",
    "Grant Program Design"
  ],
  "duration": 5442,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "Ugxag4KRdds",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735ccd29dbb7a90e1c675d9",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735ccd29dbb7a90e1c675d9.vtt",
  "transcript_text": " Hi everyone. For all of those of you joining for the Designing a Retro Round workshop, please, we're going to ask you to seat according to which group you belong to. So the exercise that we're going to be doing in this workshop is, I'm not sure how many of you are familiar with retro rounds, retroactive funding rounds. Yes, I see some hands going up. If you're part of an ecosystem, like you are a protocol or you want to design a round to incentivize growth or different things in an ecosystem, we're going to ask you to please sit on the left side of this area. Everyone, please try to come over to the middle. If you are looking to design around for a community, say you're a local community and what you're trying to incentivize is growth or different goals within your local, geographically local community or community of a different type, we're going to ask you to sit on the right side. And this is because we're going to be making... You're right. So here. Yeah. Perfect. So communities over here, ecosystems on this side. And this is because we're going to have breakout groups. So this is going to be a very hands-on workshop. You'll be working or collaborating with two or three other people that are here to go through the process of designing a reach around. And it's best if you are sitting or partnered with those that are on the same wavelength of who your audiences are going to be, what are the type of values or behaviors that you want to incentivize. So that is why. Please, ecosystems to the left and communities to the right. It's your right. . Yeah, ecosystems is on the left, which is your left. So if you're, I'm sorry, I think... Oh, that's more... So ecosystems to the left and communities to the right. We're going to be handing out some post-it notes so that it's easier for you to brainstorm. Usual advice from workshops, one idea per post-it note is going to make it a lot easier to know what to do with these different ideas. Okay. Come in here. To the right. And I think this will also come clear and happy to go over any questions around seeding when we get to the breakout groups. Perfect. So before diving right into it, how many of you know what retroactive funding rounds are? Can I? There we go. Yes? Yes. Can I get a hands up from those of you that know what a retro round is? If not, because I'm just going to walk through it. Perfect. So one of the reasons why we've been experimenting with Retour Rounds as of late is the fact that it is meant to be easier than running a proactive grants program. In a proactive grants program, what you're trying to do basically is predict the future. You're trying to understand if people are gonna do what they say and promise that they are gonna do. You're trying to predict if this is still going to be relevant to your ecosystem or to your community by the time it is done. And you're trying to assess as well if the team that is doing it is going to be capable of doing it. So basically, we're trying to fulfill the role of a VC when we're not VCs, when we don't have that information, when we don't have the tools that VCs have. And this is why, or through this logic, this other mechanism came up and Vitalik came up with it, or right about it. Actually, not came up with it, but right about it. And the most relevant thing here is that in reacharounds, we expect that it's easier to agree on what was useful, rather than trying to predict what is going to be useful. And so retroactive rounds are a funding mechanism. You might have heard them as retroactive rounds, which is the latest rebranding that Optimism has given to this funding mechanism. But previously, and I think it's more widely known as RetroPGF, Retroactive Public Goods Funding Rounds. And this is a funding mechanism that has two sides of it. The first one is we have a results oracle. This results oracle can be a group of people. It can be a smart contract. But right now, all of the forms in which we've seen it have been groups of people that reward projects that they recognize as having already provided value, either to an ecosystem or to a community. However, we know that the design of this oracle is actually a complicated thing. So what we've seen as well, and what is expected of these retroactive rounds, is that we have them running over and over again because we're experimenting with the design of these rounds, which is also what we're going to be exploring today in this workshop. We're not expecting to have the best design from the get-go. We know that we're going to learn and get closer to this best design in an iterative way. We're going to be trying out different hypotheses. We're going to be trying out different variables. We will be engaging different audiences. And through that process, we expect to get to a better outcome of how these allocations are done. And I will mention that retroactive funding is not a new thing. This is not something that was invented in the Web3 space. We actually have institutions that have been running this type of funding rounds for really long times. And maybe I'm not sure who knows what this is, but this is the Nobel Prize, or like the insignia that is given as a Nobel Prize. And the Nobel Prize is one of the best examples of a retroactive funding program. People that are granted Nobel Prizes are people that have done research usually like decades ago and it's only until it has been proven that this research has been really meaningful to society that they get awarded a cash prize and a lot of other things that come with being a noble laurelate. But it's a similar experiment that we're running with retroactive rounds, in which we're looking at what has yielded a very valuable contribution to an ecosystem or to a community, and we want to reward that. Because we want to incentivize more people to have this type of behaviors of contributing to the communities or to the ecosystems. So one of the things that I suggest for all of those thinking of running retroactive rounds is this is an iterative process and it takes time. It is resource intensive. So don't try to run. It's not going to be perfect at the first time. It's going to require several iterations and you will need to take your time and going through this process. So this is a mechanism that was made popular by Optimism. Optimism has run already six rounds. We are currently, or we just closed, I think one day ago, the latest sixth round. Optimism, for those of you that don't know it, is an L2 that has committed to this funding model from inception. From the moment in which Optimism minted its token, they decided that the fees generated by the sequencer were going to be directed to this mechanism and they are going to be used to fund public goods and to fund projects that are providing an impact or benefits to the ecosystem. They've been also pioneering in the experimentation of this mechanism. So while they started with a small round back in 2021, in which they gave out about 1 million USD, and had a small subset of voters, this has continued to grow and evolve throughout the years. Their largest round was in 2023, in which they allocated about 30 million OP through different categories, and they had a set of about 140 voters. They've also been experimenting with other type of rounds like the latest fourth round in which they used voting style called metrics, like impact metrics, people voted and impact metrics instead of projects, but it's been going back and forth in between voting for projects or for metrics. And this is something that they've committed 850 million OP throughout the rest of the life. And this is only what was allocated at the inception of the token. There's also all of the funds that are being generated through sequencer fees that are going to continue with this, that are meant to continue this mechanism or funding this mechanism. It's important to note, though, that Optimism is not the only ecosystem running retro rounds. There's already been several rounds run by other ecosystems, such as Filecoin, that is currently running its second retro round. There's also Pocket, which ran its own round at the meet this year. Interestingly, also using the funds that they received from the Optimism Reacher round and funding that they received from Arbitrum to reward its own contributors. There's also the Celo ecosystem that ran a round earlier this year and is looking to run another round at the end of this year. And the LEAP P2P library or LEAP P2P ecosystem that has also run its own retro round to fund those that have been providing value to this library. And in addition to that, it's not only ecosystems that can use this mechanism, but we've also seen local communities using this mechanism to incentivize specific types of behaviors. So one of the really nice things about reach arounds is that what you're doing is you're creating a feedback loop of behaviors that you're incentivizing that are going to enable your community or your ecosystem to get to a goal, right? So while we can see that for ecosystems this may be growing your TVL, making your users more sticky, or growing the number of your users, we can also see that local communities that are trying to onboard more people into Web3, that are trying to become more regenerative, can also use this mechanism to incentivize this type of positive behaviors, and people will know that this is something that is going to continue to happen, and this type of behavior will continue to be rewarded. As long as these retro rounds are run, there is this expectation that these rounds will continue to run. So we've also seen groups such as Dow Drops, which ran one retroactive round as such earlier last year, whom they were targeting was Ethereum contributors, regardless of which L2 or which ecosystem within the Ethereum ecosystem they were contributing to and what their type of contributions were. We've also seen local communities such as ETH Colombia and Ethereum Mexico host their own rounds. And we've also seen other educational communities such as CryptoVersidad also doing this type of experiments to incentivize more people in particular behaviors that they find relevant to their communities. And so as I mentioned before, reach arounds are mechanisms. And there's five steps that I usually look at when designing mechanisms. And that I usually look at when designing mechanisms. And that it's good to keep in mind. Because these affect, like the steps, and as we scope them, affect the rest of the process. And it's also important to think of it as multiple steps, because this means that you can change the things and the sub-mechanisms that are part of the mechanism design, or in this case, the retro mechanism. So first, we have funding, and when we're thinking of the retro rounds, sometimes you don't need to worry about funding. Sometimes you're optimistic and you just have funding. But if you're a local round or you're a local community that wants to host a round, you need to think about where am I going to get the funding for running this round? Not only to run the operations of this round, but also where am I going to get the funds to give out to the community because they've done the behaviors that I want to incentivize. Second is the design of the round. And when I talk about design, I'm not talking about the images that we're gonna use or the funds or the colors that we're gonna use, but who the audience is, what is it that I'm trying to incentivize. All of this work that leads up to the round. And we also have the data aggregation. So based on the design that you're using, based on the things that you're trying to incentivize, and based on your audience, you're going to be able to determine what are the type of metrics and data that I can use to measure if people have actually, people or projects have actually generated value to my ecosystem or to my community. This is the why, the how, and the what. Then third, we have the decision-making. So what we've seen so far has been groups of people in different sizes voting on who gets the funding. But there's other ways in which we can have this decision-making process take place. This could be two different groups of voting, groups that vote. You can have one group that votes, then people review the vote. They approve it or decline it. And this is why I wanted to call out there's this decision-making process, which can be its own mechanism. Then there's a disbursement process or disbursement mechanism, which can be you're streaming the tokens over a certain amount of time, or you're giving the lump sum. And then you have really important post-mortem analysis. You definitely want to look at how your round went to understand if you did the right things when you were designing your round. And then in this workshop, we're going to focus on the design because this is the most relevant part of your round. If you don't get the design for your round right, you won't know if you're actually achieving the goal that you wanted to achieve. therefore you won't know if you're using your resources in the most efficient and effective way to achieve your goal which means you're not going to be able to evaluate if the program that you just ran actually made a difference for your ecosystem or for your community and if you should even think of running it again so why are we going to focus on the design and the scope first is we community and if you should even think of running it again. So why are we going to focus on the design and the scope? First is we have a lot of participants and a lot of audiences that participate in a round. Each of them have different incentives, but this is a game that we're all playing together, and we want to make sure that we're aligning everyone's incentives so that we're able to get to the goal. So we want to be specific also around what the incentives are that is going to be essential for us to know if it worked. Second, it's also going to help us improve the stakeholder management. This can be a very time-intensive process. So we want to make sure that people know what they are supposed to do, when they are supposed to do the things, and why they are supposed to do these things. If we're asking them to vote, if we're asking them to review projects, if we're asking them to provide specific data, we need them to understand why they are doing these things so that the retro round itself can be successful. Number three is we want to mitigate risks through the design. We want to understand and recognize what are the unknowns in this design, what are the variables that we're unable to influence or that we're unable to control in these experiments, and we also want to know what could go wrong and if there is something that we can avoid, that we can do to avoid it going wrong. And the fourth one is we need to optimize our resources, specifically for local community rounds. I know that ecosystems tend to have a lot of funds and this is also what enables them to experiment with this type of mechanisms. But this may be something that local communities cannot afford. Because they are either being funded one by one or they have a more limited runway. Which means that you need to be able to pick your battles in terms of where you're allocating your funding. You need to be able to clearly identify where should you be putting your time, where should you be putting your funds, and where should you be directing the attention of your community when you're running this type of rounds. You want to identify what are the most high impact areas that you want to be focusing your initial or your first iterations of the rounds on. And in terms of incentives, as I mentioned before, with this type of mechanism, we're looking at not predicting. We're not trying to predict the future. We're trying to assess what has already been useful. So we want to align incentives. So the hypothesis here with this mechanism is that people out there will build what matters to this ecosystem or to this community. And once they've generated this value, they're going to be rewarded for it. But if we're not telling them properly, what is it that this ecosystem needs. But if we're not telling them properly what is it that this ecosystem needs or if that is not clear and it's not of common understanding for the community, it's going to be very hard to have people building the things that are actually doing meaningful work for the ecosystem. And for example this is something that we've seen in Optimism and that we've seen in some of the other retro rounds, in which there's a lot of work that is being done, but this is not exactly what is needed. Or we see multiple versions of the same thing being replicated and not being used by the target audiences that people are trying to save time or improve their work. And this stems from a lack of communication and a lack of clarity in terms of where is the ecosystem headed? What is actually needed? What is still going to be useful in three, four, five, six months from now? So if we give this information, either as local community or ecosystems to the audience like to the community members we're going to be able to get them excited of contributing to the ecosystem and know that they will be receiving a reward and we will avoid having to like Have them lose faith or hope in this mechanism or process by building something that is not going to be rewarded because it wasn't impactful or useful. And as I was mentioning, this predictability of having these rounds is going to create reliability. You want to have your builders or the members of your community know that the round, there's going to be multiple rounds. So they are going to continue behaving in this particular way that you've set. Through this mechanism, what we're doing is we're creating new behaviors. We're asking people to actively change what they do with the expectation of a future reward. And this change in behaviors happens over time. It's not going to happen from one day to another, and it's not going to be cemented only after one round. So it's also important that as we continue to iterate on these designs and on these rounds, we make sure that we're not completely disrupting the expectations from the participants, because it's going to make it really hard to keep incentivizing the behaviors that we want to see in the ecosystem. So I'm going to stop very quickly there, because now we're going to jump into the breakout groups. Does anyone have any questions so far on to reach arounds? No. Perfect. So next thing that we're going to do is we're going to design our own reach around. Yes. Can I project? Okay. All right. Testing. I'm just curious if you could share some more examples of retro rounds, and what are the differences in the round as you change what you're funding? Like if it's software or if it's governance or if it's something else. Thanks. Yes. So depending on what it is, on who your audience is, and what their capabilities are, for example, in terms of, ooh, perfect, in terms of generating different data that you want to aggregate for people to vote, depending on how much funding you have, depending on precisely the things that you're looking to fund and incentivize, you're going to have different, one, different types of communication that you're having with them. There's also going to be, as I mentioned, different types of data that you're going to be gathering. So, for example, I designed and ran the Ethereum Mexico round. What we were focusing on there was this is a geographically specific round, and what we were looking to incentivize were five different things in the community. We wanted people that were prioritizing onboarding others into the Web3 ecosystem. So we were looking at an increase on wallets, regardless of which chain this was happening in. So I think this is also going to be one of the main differences that you might see from local communities versus ecosystem-specific communities. Sorry, ecosystem-specific rounds, in which ecosystem-specific rounds will look to increase the value to their own ecosystems, which makes sense in that it is their funding, and they have goals that they need to achieve within their own ecosystem to be successful. So you'd be looking at more specific metrics such as, as mentioned, TVL, number of users, number of transactions, transaction size, or if it's libraries, number of projects that are using this library within my ecosystem. Then on the community rounds, what we were experimenting with in the Ethereum Mexico community was looking at number of people onboarded into Web3. We were also looking at reducing the gender gap. So number of projects that were specifically targeting onboarding women or supporting women in the Web3 space. We were also looking at refi communities in Mexico. So looking at how many had interacted with local regenerative projects, how many of them had onboarded local regenerative projects, or use cases in the refi space. We were also looking at education, so partnerships with universities. And these were some of the type of behaviors that we were trying to incentivize in the long term as well so for us let's say that an ecosystem would be pushing for a growth on number of users in their own ecosystem we were pushing for a number of new users or new attendees to Web3 events. Because our hypothesis, and this is also where the designing and understanding, well, what is your North Star and what is your goal, is really relevant. Because what we are trying to incentivize in the long term is we want to have more people educated and participating in the Web3 space. That would be one in terms of onboarding. Second, we want to see more women integrated into the space. So allocating funding to that as well. I would say those are two of the main difference that we've observed. I know as well that I believe Ethereum Colombia, one of the things that they were incentivizing as well is number of people running their own nodes. So how people are actively participating and securing Ethereum. But those are some of the things that are stark differences. And I think also another thing that is very dependent on whether it's an ecosystem or a local community thing is local communities are very different from one another in terms of the things that are needed in one country or one city are going to be very different from what's needed in a different country or a different city. And how we framed as well the round that Ethereum Mexico ran is we want to fund the edges where impact is happening. And this impact might not be clearly understood by someone that is very far away. So say even if this is impact that they are onboarding everyone into optimism, this might be very difficult for optimism to recognize from such a far away point of like, oh, why is this relevant in Mexico in this type of scenario? But this is something that local communities, if they are the ones running the rounds, if they are the ones designing and determining what is impactful in this specific situation or in this specific reality, they're going to be better able to identify and understand why this was impactful and why it should be rewarded. So I also think that one of the big differences is how close you are to the impact that is being generated so that people are able to identify it and fund it. That's a very broad spectrum. Hello. So I have a question. I had a question about how you can measure the post-mortem analysis. And I was thinking, like, should that be done? I was thinking about how an ecosystem that runs retro-PGF rounds can make the post-mortem analysis, and I was thinking this is a whole design space on how you can do that, how you can measure how much you incentivize the project from the previous round compared to the next round after one year. So, yeah, my question is how, for example, the analysis of previous Optimism rounds happened. Perfect. So for each of the optimism rounds, there has been hypotheses that are set at the beginning of the rounds in terms of lessons learned from the previous rounds. with, it's sort of like, we are, say, now we're going for impact metrics-based voting, and we're doing this because we expect that people are going to have an easier time deciding which type of metric is more relevant to them. They won't have to, we're going to be reducing time because they're not be reviewing each of the projects. And then once the voting comes to an end and allocations are done, there's usually also an exit survey that is sent. And all of this data is then aggregated to understand, do we, I think this one has been more of a sentiment analysis, and like, do we feel confident that the allocation was done better in comparison to round three. There's still room, a lot of room for improvement, to be quite honest, in terms of analyzing the postmortem of the rounds, specifically when it comes to the impact that funding has had on the projects. I think for some of the retro rounds, this is still to be done. And there are some, I think Open Source Observer has done some in terms of one year after Retrip BGF3 to have projects continue to build on optimism and continue to ship and generate value in the ecosystem. I think that's one good approach. Something else that I know, like Sejal and myself and others have been exploring is, can we create counterfactuals to understand if this injection of capital or injection of funding to the projects actually made a difference? If we were to look at this in the future, had they never received funding, would it still look the same? Which can help us understand if this actually makes a difference for this type of projects or in this type of situation. But I think that is still pretty nascent. And not a lot of it, yeah, I know that not a lot of it or none of it has been done yet. OK, perfect. has been done yet. Okay. Perfect. So... Okay. So we're going to get into breakout groups of three to four people. They can... Let's see. I think five can also be good. But if you can just get together. So... Perfect. I think we have three here. CJAL is going to help us as well in terms of putting together the groups. Do you want to get together? Hello. Perfect. Do you have things to write with? Yeah. Okay. Perfect. And what we're going to be doing is we're going to go through a set of prompts. And the first one is we're going to go through a set of prompts. And this is going to be the process through which we design a retroactive round. You can choose whichever, whether you want to design a retroactive round. You can choose whichever, whether you want to design it for a community. You can choose whether you want to design it for an ecosystem. For example, I see the Gitcoin team here. Maybe they want to design a retro round for members in their ecosystem. I see different people from LATAM communities over there. Maybe they want to design it for a Latin American community. Something that Sejal and I were also brainstorming earlier on this workshop is someone, and it might be an experiment that Sejal and I do right now as well, is what if we were to design a reach around for DEF CON? So anyone can take that prompt up as well. And so the first prompt is we're going to ask you to introduce yourselves in your group in case you don't know each other. Please make it short because we are going to have eight minutes for this first prompt. So introduce yourselves and choose your adventure. Choose who are you designing this retro round for. Is it for a local community? Is it for an ecosystem? And just agree with the other members of your team which audience you're looking to engage with. Is it going to be, again, a local community? Is it going to be an ecosystem? And if you have any questions throughout this process, please raise your hand and Sejal or myself will walk to you and answer any questions that there may be. We're going to have eight minutes for this. So please introduce yourself, share why you're in this workshop, and if you're part of a community or an ecosystem, and then decide who are you designing this round for. Go. Yes. If you have any questions, just raise your hands and Sejal or myself will come. I feel like I'm focusing on something. Oh, yeah. I'm going to take a picture. Can we focus in Mary? Can we carry on something? I feel like I'm focusing on something. I feel like I'm focusing on something. Thank you. ¶¶ Thank you. Hello? Thank you. Thank you. Thank you. Terima kasih telah menonton! Thank you. Thank you. We have one minute left, so please come to a decision of what adventure you're going to follow for the next prompt ¶¶ And time is up. So please, I hope you've written down either in one of the post-it notes or somewhere else. What is the adventure that you're going to follow if you're going to be designing this retro round for a local community, or if you're thinking of it as a Web3 ecosystem or Ethereum as a whole or DEF CON. So the next prompt that we're going to be looking at is based on your groups and based on who you've decided to design this round for, you will be defining what is the North Star that you want to achieve. And here is what the North Star is. What is the end goal that we want to reach? What is the end goal that you want to reach? What is the end goal that you want to reach within this community? What is the end goal that you want to reach within this ecosystem? And it's important as I mentioned before to know this because if we don't know where we're going then we're not going to be able to tell if we've gotten there or how we're gonna get there. And this means we're not going to be able to measure what's the type of data and what are the type of metrics that would be useful for us to leverage when we're deciding who should be funded. And we're also not going to know what are the type of behaviors that we want to incentivize for people to follow that are going to get us closer to this hypothetical goal. And I will incite you as well to think of this not as a short-term goal. It could be a short-term goal, but it's better to think of it as a long-term goal. Like if you're doing this for a local community, how do you want this community to look 50 years from now, 60 years from now? What is this like bright future that we're aiming for? And as I mentioned before, you can have it be a one-year goal. I know that a lot of the ecosystems plan in more short term because it makes sense for what they're trying to do. But try to aim for this long-term vision. Even if you're an ecosystem, we want to play infinite games, which means we're incentivizing behaviors that are going to be healthy for what we're trying to achieve in the long run. And so the second prompt is define with your team members what is the North Star that you're going to be fulfilling for this either local community or ecosystem. What is the overarching? And here are some questions that will help you in defining this North Star. And here, feel free to use the post-it notes. And remember, one idea per post-it note. That's going to make it a lot easier when you're looking at the different ideas that you have. What is the overarching objective that you hope to achieve by running this round as well? Not only this round, but like in the long term. And how does this round, how can this line around with this overarching goal? Then what is the long-term vision that you have for your community or for your ecosystem and what are going to be your goals for this round? And so for this one we're gonna have about 10 to 12 minutes. I think it might be too much but we'll be going around and if it is too much we'll just cut it short so go ¶¶ Thank you. Vielen Dank. Thank you. Yeah, and we just had a really good question on whether it's like, oh, should we just have one North Star? What I would suggest is each of you write what are some of the things that would be very relevant to have in this round. Write it in a Post-it note, and then you share them, like you paste them in the middle for everyone else to see, and then people can either agree or disagree with the things that you've identified are valuable for there to be, or that could be the North Star that you're going after. Thank you. Let's pray. Amen. Thank you. There we go. And I think it's a flex. so Thank you. © transcript Emily Beynon I love you. Thank you. We have one more minute. So please start gathering your ideas and choose what the North Star is going to be for your round. We're done. And we're up to the next prompt. So now you've already defined what is going to be the North Star for your community or your ecosystem. And the thing that you're going to have in mind as you're designing the rest of the steps of the richer round. Next is we're going to identify who are the audiences that are involved in these richer rounds. Who are, one, the projects or people that you expect to fund through this round, it's going to be either the projects that are applying or if you're not asking them to apply, you already have a way in which you identify who's going to be eligible to participate in this round. Who are they? What do they look like? Are they individuals? Are they individuals? Are they groups? Second, as I mentioned before, most of the retro rounds as we've seen them is people vote on who gets allocated the funds. So who are going to be your voters? Is it going to be everyone that belongs to the community? Is it going to be a selected group of people that are very and have a lot of high context into your ecosystem. And third is you're also going to identify who is benefiting from this overall impact that the people that you're funding or the projects that you're funding are generating. Who are the end users or end receivers of the impact that is being generated? And map out who these audiences are so that you can understand what are their incentives, what are they trying to achieve, whether it is within your ecosystem or within your community, but what moves them forward and what are they trying to achieve so that you can then continue to design something that will ensure that you're aligning their incentives with the incentives that you're trying to achieve through this round. And here there are some questions to guide you through thinking through this. The first one is, oops, this is not, OK. So apparently this slide is wrong. But here it is, as I mentioned before, identifying who's the audience in terms of who are benefiting from the impact that's been generated, who are the people that would be voting in year round, and who are the projects or people that would be receiving funding through this round. And for this, we are going to give eight minutes. Let's start. Vielen Dank. Thank you. Amen. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. And And the time is up for this next prompt. And we're going to move to the next prompt in which we are going to be looking at setting behaviors and defining what these behaviors are. So what we are, as I had mentioned before, in these retro rounds, what we're doing is we're incentivizing very specific behaviors that we want to see, that we have a loose idea that are going to take us to this North Star, that are going to enable us to get to these goals. So for this next prompt, what you're going to be doing is you're going to be thinking about what are the type of behaviors that you want to see, the type of benefits, the type of recognition that you want people to have or you think people will appreciate from participating in this type of actions that are going to get you closer to the North Star. So think also about what are some of the milestones that are in between where you are right now and getting to the North Star so that you can identify what are the type of behaviors that I'm trying to incite for people to do that are going to get me closer. If you're looking at an ecosystem round, maybe this behavior is contributing to the open source code. Maybe this behavior looks like deploying smart contracts and attracting new users into my ecosystem. If we're thinking of a local round, if one of the things that you're incentivizing or you value the most is, say, protecting the forest, maybe the type of behavior that you're looking for is planting trees or protecting trees that are already in a specific place, taking care of the trees. These are protecting trees that are already in a specific place, taking care of the trees. These are the type of behaviors that you might want to incentivize that people have or do as you're going through, and that is going to be rewarded at the end of the round. So we're actually going to give, I know it says 12 minutes, but we're only going to give eight minutes for this part as well. And you can start now. And try to be as specific as possible when you're thinking of the behaviors that people are going to have. Because this part is going to help us to identify what is the data and what are the metrics that we can use to measure the type of behaviors that people have already completed and that we could reward in the round. So again, sort of like if we are looking to protect the, like if it's a local community and what they want is to preserve a particular area, then maybe we're going to be looking at planting trees or having a more healthy ecosystem. And then how do we define what a healthy ecosystem looks like? Is it the number of trees that are in a specific space? Is it the type of behavior that people are having when going around? So this is what we're going to be looking at. Thank you. Thank you. ¶¶ ¶¶ Thank you. um ¶¶ Thank you. Gracias. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay, we have one more minute before we go to the last prompt. Okay. We're going to move on to the last prompt. Since both, since the groups are already done with this prompt. And as I mentioned to both of the teams, the way in which you're designing your round is going to inform the evaluation process that that you're able to already extract from existing sources or that you need to create. The best thing there is to create it in a standardized way so that people can cross-compare it amongst different projects. So for the last prompt, we're going to be looking at data and metrics for this evaluation. And there's two actions here that you're going to be looking into. Or questions that you can use to guide your process through. The first one is, now you know, based on the behaviors that you want to see happen from these different audiences, what you're aiming for, and what are the potential actions that the members or people or projects can undertake to get to the North Star, how can you measure these actions? Like over here, we were talking about, oh, we want to have more developers building in this particular ecosystem. And we talked about developing looking like launching their own smart contracts. It could look like contributions into the githubs and into the repos from the different libraries or tools that are relevant to the ecosystem. Then you can also explore, are there already existing data sources for this information? And if there are not existing data sources for it, how can we measure this in a standardized way? And we're going to give three minutes for that. And then we'll start wrapping up. Thank you. Gracias. Thank you. Is it moving forward? We have one more minute left. Okay, so you were talking about . GitHub repo commits, stuff like that. And we were talking about maybe that's spammable, it's not good, and maybe we should look at the quality of the codes. And I was like, how do you even standardize that? Is it all right? It's very subjective. It's the same level we have in OPP. Exactly, no, but it is subjective. I think the good thing, though, is how can we do subjective evaluations to become as most objective as possible? And that can look by, like, for example, if it's very, very subjective, maybe you have five different things within the code that you're reading. And then that helps, like, reduce the subjectivity of it. But I'm reviewing it to a degree. No, you're welcome. Perfect. So we're coming to the end. And I think now what would be really interesting, this was the last prompt. And so as I mentioned, this was a taste of what the design phase looks like when we're looking into mechanism design. The second, there's several other steps that would follow, but right now we only focus on the design space of the problem. And so we're going to just ask real quick the two teams if you can share what your round, whom you were designing this round for, what is the type of incentives that you wanted to generate, what was going to be rewarded and who the audiences are. We have very limited time, so if you can explain it in like one minute or two, that would be great. Hello. So retrofinding the round is for ecosystem. Specifically, it's unique swap ecosystem. And the round we were thinking about is the hook round that they just released. So the goal would be to increase the builder that build on the Uniswap hook ecosystem, increase the numbers of high-quality hooks, or build hook tools, making it easier for developers to work on it, and also like onboard builders on the ecosystem. Some of the audience would include Web3 builders, educators who help and also the benefit, this will benefit like the Web3 developers, Uniswap users, Uniswap token holders. And who will vote on this? We're still debating on this, but we think probably like the Uniswap token holders. But yeah. Yes, so the behavior we wanna see is we want them to build on the Hoke ecosystem, them to deploy the smart contracts, and also we want some educators, content creators to create content for Hoke to spread the information to help onboard people and also yeah and people to participate in voting and stuff like that perfect thank you and so please I know we're missing the last group but I don't think we have time for that anymore as we're well just make it really really really brief. We still have two minutes, but this is the QR code for the group. Please feel free to join as well, and we can continue exploring what these designs look like. We designed retrofunding, retroactivity funding to incentivize more women developers to onboard to Web3. que nos incentiva a crear o tener más workshops para esta audiencia específicamente. Y la audiencia o el financiamiento serán de personas que pueden ser individuales y también comunidades desarrolladoras. Y los comportamientos que estamos buscando son, primero, communities. And the behaviors that we are looking for is first onboarding more women with workshops, focus on them. And also more women contributing to open source projects. In the milestone, we have increased women attendance by 25% in six months. And in Greece, and then have more women meetups during a year. Okay. Thank you. Awesome. Thank you. So please feel free to share the designs in the Telegram group. Thanks a lot. Sejal and I were really happy to host this workshop, and we're excited to see more people approaching mechanism design in a more methodological way so that we can have better outcomes for how we're allocating funding in this space. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731571200000,
  "slot_end": 1731576600000,
  "slot_roomId": "classroom-e",
  "resources_presentation": "https://docs.google.com/presentation/d/1GTU723iYMOTD9COHjYQdSKNFi7gSZc88-BnP7Co9jE4",
  "resources_slides": null,
  "speakers": [
    "launamu",
    "sejal-rekhan"
  ]
}