{
  "id": "downtown-stimulus-public-goods-funding-for-main-st",
  "sourceId": "VC9TDM",
  "title": "Downtown Stimulus: Public Goods Funding for Main St",
  "description": "Web3 Public Goods Funding has left web3, & successfully hit main st!  💰🏦\r\n\r\nThe downtown stimulus team raised $43k for Boulder Colorado COVID economic recovery & proved QF works in mainstream USA.  Learn about this experiment & lessons from it from Gitcoin founder Kevin Owocki.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Quadratic Voting",
    "Public good",
    "Local Impact",
    "UI/UX",
    "mainstream",
    "Public good",
    "UI/UX"
  ],
  "keywords": [
    "mainstream"
  ],
  "duration": 599,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "LmYVHyEPeSE",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735da639dbb7a90e1300946",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735da639dbb7a90e1300946.vtt",
  "transcript_text": " Let's welcome Kevin. Hello, friends. What's up? I'm Kevin Awocki. I'm one of the co-founders of Gitcoin. Has anyone in the audience used Gitcoin? All right. Can't see it on the live stream, but a bunch of hands went up. All right. Can't see it on the live stream, but a bunch of hands went up. I'm going to talk about bringing the Gitcoin model of quadratic funding to Main Street. So how do we exit our little crypto bubble and start to do more public goods funding downtown? So if you've been in the Ethereum ecosystem over the last couple of years, you know that quadratic funding is a democratic way to run a public goods funding campaign. If you are an ecosystem that wants to fund your ecosystem public goods, you put out a pool of funds, and then you allow grants or projects in your ecosystem to access those funds by raising money from their constituents and receiving money from the central matching pool. But there's one weird trick with quadratic funding that makes it into a democratic power tool, and that's that the matching is based off of the amount of contributors to each project as opposed to the amount that they've given. So if you raise $100 from 100 contributors and I raise $100 from one contributor in a quadratic funding campaign, the one with the broader base of support is going to get 99% of the matching pool. And this makes quadratic funding into a power tool for funding what matters for everyday people in these communities, because the poor and the many get to make capital allocation decisions instead of the rich and the few. instead of the rich and the few. Quadratic funding has delivered $65 million worth of funding in the Ethereum ecosystem over the last six years on Gitcoin. But I wanted to prove that we could bring it out of the crypto bubble and to Main Street. And so in 2020, when COVID was ravaging the world, and in my hometown of Boulder, Colorado, 99% decrease in foot traffic for the downtown was happening. Businesses were struggling to stay afloat. And so I got together with my colleagues, Zach Herring and Katie Johnson, and we put together a $25,000 matching pool of quadratic funding in downtown Boulder, Colorado, and were able to run a quadratic funding campaign for a yoga studio, a bookstore, a coffee shop, and a couple of other projects downtown. So this is what it looked like, downtownstimulus.com, and basically the way that we positioned this was that you could support local businesses by making a contribution to these businesses using a credit card payout. So basically, we took quadratic funding, we took Gitcoin grants, we stripped out all the crypto, and we just allowed people to contribute with quadratic funding, or sorry, with US dollars, contribute with quadratic funding, sorry, with U.S. dollars and have their contributions matched by quadratic funding. So we had a $25,000 matching pool. Thank you to Vitalik Buterin and to local philanthropist Brad Feld. And we're able to raise $16,000 from 320 contributors of an average donation of about $40. And all in all, we're able to raise about $41,000 for downtown Boulder public goods. I think this is really exciting that a primitive that has been pioneered and distributed in the crypto ecosystem was able to go mainstream with a campaign like Downtown Stimulus. And I'm really excited about this meme of cosmolocalism, which is basically an approach to production and governance that provides a combination of global coordination with knowledge sharing and local manufacturing and resource use, emphasizing open source software and a relationship between the global and the local where the global services the local. Okay, so in what ways can we, in the Ethereum ecosystem and the open source ecosystem, create a global commons, create knowledge and production that is in service to the local? And this is opposed to the Web2 surveillance economy in which you have Facebook communities going into your local communities and surveilling everyone and tearing apart the social fabric because it's more profitable for Facebook shareholders that way. How can the Ethereum commons be in service of the local commons is the design space of cosmo localism and ethereum localism and i'm happy to say that downtown stimulus to me is a proof point that this is possible we can take the programmable money where we program our values into our money in the ethereum space from the ethereum space and start applying it to downtowns across the world and i'm really excited to downtowns across the world. And I'm really excited to see what kind of experiments in public goods funding, community currency, supporting the arts and supporting public goods that we can do when we do that. So I'm Kevin Iwaki, founder of Gitcoin. That's been Downtown Stimulus. Thanks so much for your time. Thank you, Kevin. Hello. Thank you, Kevin. Hello. Hello. Amazing. We have like roughly five minutes for questions. By the way, I'm also a big fan of cosmolocalism. Yeah, thanks. Anyone in the audience? The gentleman in the purple hat. Should I? Oh, wow. You're good. Good catch. Thanks. Yeah, I love your work and all that. I was going to ask, with things like community currencies and things like that where you might put conditions on your money, I sometimes think that that's obviously a restricted form of trade whereas regular fiat currencies are sort of unrestricted. So with that lens, how would you say that the community currencies can sort of out-compete freer money, if that's the right premise for you? Yeah, so the question is, how can community currencies out-compete national currencies? Yeah, like how would it have more utility if it's somewhat constrained in different ways? Yeah. Yeah, like how would it have more utility if it's somewhat constrained in some ways? Yeah. I think that community currencies are cool as an outsider, but I'm not a designer of any, so I'm not qualified to answer that question. I think Scott Morris has done a lot of work on community currencies, and I would ask him. Yeah, I guess I was riffing off the adding our values to our money. And if you put sort of constraints on it in that sense to fuel our values, I can see definitely the bigger picture that that's awesome and I want to see more of that. But then I also sort of play devil's advocate, because more so another friend does this to me where he sort of says, well, I could just do that with the US dollar or I could do that with this sphere currency. So I'm trying to sort of find the arguments, like other arguments that say this money with value restrictions is kind of more better in a more immediate form than I can currently argue. So I'm trying to find on that side. Yeah. I think that, you know, one of the things that I see a parallel between what we're doing in the crypto ecosystem and what community currencies have done for hundreds of years is that what we're doing in the crypto ecosystem is memetically local and community currencies are geographically local. Okay. So like to me, memetically local means that like Gitcoin's a public goods funding coin. Filecoin is a file storage coin. Ethereum is a computational coin in a local memetic area. And so, you know, in what ways, what we learn in community currencies can be applied to global currencies like the DAO currencies and vice versa. I think that there might be sort of a Cosmo local convergence there. Yeah. But my talk was about quadratic funding more than community currencies. I think that they're both cool, though. Thank you. Do we have time for one more question? Yes, we do. Gentleman over there. Thank you. Hi, Kevin. Hey. What do you think in your mind will be the hardest part of building some version of a downtown stimulus in another local community? Finding the initial donors or the tech, probably tech is just working something. Or making people understand how to use the system or anything like in your experience. What do you think should the focus on if you want to build something in my own local community? Yeah, great question. So we built a code base that you can use to do Fiat quadratic funding rounds. It's called simplegrants.xyz. Go to simplegrants.xyz, fork it, deploy it in your own local community. I should have put that in the talk, actually, now I think about it. But yeah, the hardest part, honestly, was raising the initial 25K. Quadratic funding campaigns in Web3, there's a lot of treasuries that are just hundreds of millions of dollars. And we draw on those to run quadratic funding rounds in QF. But the raising of funds to do quadratic funding locally is sort of hampered by, do you have access to wealthy individuals who are willing to do it? And can you crack the nut of the local government actually funding it? We actually went around the local government. We didn't even talk to the local government because their funding cycles are just quarters and quarters long. So to answer your question, I think that raising the initial amount of funding is the hardest thing that you'll do if you're going to run these campaigns. And hopefully we can make the tech a little bit easier with simplegrants.xyz. Thank you for the question. Thank you. And that's it for the time.",
  "eventId": "devcon-7",
  "slot_start": 1731581400000,
  "slot_end": 1731582000000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1Lf82ct08SpegO30t849kscAqeyNa8bTNVpMQ8ljElfA",
  "resources_slides": null,
  "speakers": [
    "kevin-owocki"
  ]
}