{
  "id": "ebay-and-web3-powered-digital-product-passports-and-what-this-could-mean-for-the-future-of-commerce",
  "sourceId": "DWMA3P",
  "title": "eBay & web3 powered Digital Product Passports and what this could mean for the future of commerce?",
  "description": "eBay is embracing web3 technologies to fulfil the vision of a truly connected product world. Digital Product Passports (DPPs) underpin this movement with a real world application of public blockchain technologies, tokenised products, attestation based technologies and selective disclosure schemes as the  technology of choice.\r\n\r\nI will explore what this could mean for one of the world of ecommerce, why brands are embracing this movement and whats in it for the consumer.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Digital Sovereignty",
    "Use Cases",
    "Regulation",
    "luxury",
    "Digital Sovereignty",
    "Regulation",
    "Use Cases"
  ],
  "keywords": [
    "digital-product-passports",
    "DPPs",
    "luxury"
  ],
  "duration": 537,
  "language": "en",
  "sources_swarmHash": "642467b5a73ddf35ef37960830082f8c7ef102570bcd47092898616cdb785bc9",
  "sources_youtubeId": "soZ5eIS2olw",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735a44f9dbb7a90e1e7e1ef",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735a44f9dbb7a90e1e7e1ef.vtt",
  "transcript_text": " Hi everyone, thanks for coming to see my talk. So I guess we'll go straight into it, we've only got seven minutes. Yeah, so who am I? So my name is James. I am the engineering director for eBay's small but hopefully impactful Web3 team. I came from an acquisition about two years ago of an NFT platform called Known Origin. Now really myself and my team are really interested in looking at the Web3 landscape, looking at the eBay machine as it stands now, and seeing how this technology can potentially impact them and find value for buyers and sellers. And today I'm going to talk about a topic called digital product passports and why I intrinsically believe Web3 is the right place for them. And I'm going to touch on four topics today. A topic called connected products, digital product passports. We'll talk about Web3 and we'll talk about commerce. But first, I want to set the scene and provide a little bit of vision of what commerce could look like. So you've got to bear with me with this, right? So you walk into an office, you see your colleagues stood around a board, maybe you're discussing the latest meme coin. You've got your Vision Pro 5000s on, some AR-enabled glasses. Not only that, it's looked in your address book and it's noticed the PFPs of your colleagues and displayed them on screen. You know, shout out to any Xcopy or Squiggle holders in the room. Not only that, it's noticed that your friend Dan at the board has got a killer watch and the latest greatest in sneakers. These products are connected. You've got to find out more. You double tap your fingers. Some machine vision or AI vision scans these items, uniquely identifies them and starts working out exactly which unique product they are, not the product SKU, the actual unique product. After that, the digital product passport pops up, a digital layer linking the physical product directly in your face. Now, this is a vision piece only, right? But you can see the potential, you know, and you might notice as well, this is very much similar to how maybe NFT platforms looked trading NFTs a few years ago. From this digital link, you can see ownership. You might see if it's got a warranty. You might see trading activity on the secondary market, traceability, servicing insights. This is the vision that I want to talk about today, and this is my vision and potentially the future vision of how commerce might look in several years' time. But wait, before we go on, I think it's worth touching about some of the problems and challenges in commerce at the moment. And, you know, the first three topics, you know, the supply chain. The supply chain is very difficult to wrangle for physical goods, aggregating lots of disparate information. Maybe the digital product passport is the perfect layer for this. You know, circularity. I bought a good on the primary market. How do I sell it? There's many websites, many marketplaces, all have different pros and cons. Maybe the product passport is the place where circularity will start. Maybe it will also tell you how to recycle this good at the end of its life. Maybe this product passport is the place where circularity will start. Maybe it will also tell you how to recycle this good at the end of its life. Maybe this product passport's the place where you'll get additional utility after your first transactional engagement with that brand or with that shop. And finally, the last three, there's some emerging regulatory insights coming from the EU. So from 2026, 2027, the EU will mandate digital product passports in things like batteries, fashion, white goods, collectibles. Now, the goal is to make things more circular and give consumers more choice. Maybe a tokenized digital product passport is the place where that will happen. The last two are digital physical experiences. A lot of the NFT space sort of tried to tackle this over the last few years with some mixed success, maybe starting with a physical and adding on a digital is the right approach. And then interoperability for your items. For the things you own physically, how do you interop with the wider world? Again, maybe this digital layer. So this is the vision I presented. Slightly wacky, really lo-fi. You know, this is not what we're building. This is a vision piece. But really, what does it enable? It enables a digital layer on physical, which is interactive product experiences, real-time information about your goods, you know, empowering customers, and then interoperability, where you, you know, you can take your physical good and use it anywhere. And this is, again, what these could enable. And then really quickly, I've only got a minute left. Last but not least, what is this? So first of all, a physical item and a product connector. Really, a connector comes in many forms. QR codes, RFDIs, NFC chips, machine vision we spoke about. And then you've got this digital layer. And this is what I talk about for digital passports and this could be you can own this thing right that's what crypto enables ownership of digital items quickly a few industry examples 30 seconds left there is already people playing in this game in the fashion space in the luxury space you know maybe on-chain is the next online and this change in consumer behavior will be a big driver for web2 adoption beyond training stonks and mean coins. And finally, wide Z-Bay care. It's massive. We've got to be ahead of these trends. And why Web3? It's credibly neutral. It's a base layer for enemies can play together. Lots of composable great standards to build on and interoperability and ownership. And that's it. Thank you very much. Thank you. That is very interesting in a very real world. Do we have any questions in the audience? Let's see. Anyone? Okay, cool. Oh. Hello, James. Hello. Quick question. When do you imagine a global platform like eBay showing its regular users, I don't know, an icon and something verified as something that says this come with a DPP and of course you can check it visually, but when you acquire this pair of sneakers, this watch, whatever, well, you also acquire this digital passport. Is there some form of an estimate timeline? Yeah, so I guess we may already be playing in this place in pilots, but you may not notice. And we also go down the mantra of eBay users don't really care exactly this place in pilots, but you may not notice. And, you know, we also go down the mantra of, you know, eBay users don't really care exactly, you know, what we're doing as long as they get lots of great value from it. So maybe we're already doing this and they don't know. And maybe next year it'll sort of be pushed up the rankings and things will become clearer. But there's also lots of luxury brands already playing in this place, is the reality. Just right over there. Ooh, nice. Hey, James. Based on eBay's sales numbers and that, what throughput do you think that you need from the underlying technology to serve your users? Oh, that's a good question. Well, I guess, you know, to get to eBay scale, you know, the end game, you know, it's hard to really talk about. It's a reality. It's hard to really say stuff in public. But, you know, eBay is a big, huge user base, billions of products, hundreds of millions of users. You know, in the last two years with the rise of L2s, there's an actual credible path for actually how to achieve the eBay and that's what we'll be keeping an eye on as that space emerges. One more question and the last one. Right over there the gentleman in the cap. It's going to be from over there. Yes. Beautiful. I've got to admit I'm a bit confused as to what would be the advantage for the end user. This feels like a lot of overwhelming information that might not be tangibly beneficial. And it also, frankly, seems like a bit of a privacy nightmare. I can see how aggregating all of this kind of information in a not centralized, but central point of identity could be problematic. So are there any... Do you also envision a level of privacy associated with that? Yeah, so privacy first, very true. We think about this a lot. And is it right that you know this wallet owns 10 Rolexes? Probably not. But we look at technologies like providing proofs, selective disclosure, you know, zero knowledge stuff. You know, that's really where I think this will go. And it'll ultimately be at the behest of the holder of how much information that they should disclose. I do agree that privacy is a big issue in this physical space, much more than in digital is a reality. I can't remember your first question. Sorry. much more than in digital is a reality. I can't remember your first question, sorry. Okay, so that's it for our question session today. And please reach out to James if you have any further questions, any discussion you want to continue. Thank you again. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731567600000,
  "slot_end": 1731568200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1oolmmoeS_8L3O435iq2vuXQPr9H_eWlvs-2T3XokFwU",
  "resources_slides": null,
  "speakers": [
    "james-morgan"
  ]
}