{
  "id": "ecosystem-development-best-practices-and-why-we-need-to-start-with-builders-first",
  "sourceId": "EY3HL9",
  "title": "Ecosystem Development Best Practices, and why we need to start with builders first",
  "description": "Given the myriad of chains out there, it is increasingly crucial for L2s to solidify their ecosystem building playbook and constantly refine it to win over (and more importantly, retain) users and builders. As an ecosystem builder in SEA (Thailand) who has worked with over 10 ecosystems including other L1s, on local, regional and global initiatives, I am excited to share the ins and outs of ecosystem building from a neutral perspective.",
  "track": "Layer 2",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Business",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Layer 2s",
    "DevRel",
    "Best Practices",
    "management",
    "stakeholder",
    "Best Practices",
    "DevRel",
    "Layer 2s"
  ],
  "keywords": [
    "Ecosystem Building",
    "Ecosystem Design",
    "Developer Experience",
    "Stakeholder Management"
  ],
  "duration": 407,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "xqs8trszoOY",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67331cf83a168eb5353a19d3.vtt",
  "transcript_text": " Hi, good afternoon, guys. So my name is Ngan. I'm the co-founder of Symmetry. I'm also a fellow Thai here. So it's a pleasure for us to welcome you to my home country and my hometown, which is Bangkok. So really excited to be here. So yeah, straight into my talk. So as you can see from the talk title, it's about ecosystem development. So what I do at Symmetry is basically we help change on what more builders and users from Thailand. So I figured this would be a good topic to touch on given DEF CON so what exactly is ecosystem building so ecosystem building is basically a to the marketplace right so side marketplace so when you're building chains you need both barriers and users and you did both at we strategic timings a chain cannot function with one or another",
  "eventId": "devcon-7",
  "slot_start": 1731402000000,
  "slot_end": 1731402600000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/12auC9dhscSkSUtYU1CqtRqHz64-ljDXc1f7otM8hLMw",
  "resources_slides": null,
  "speakers": [
    "nine-arnakorn"
  ]
}