{
  "id": "elliptic-curves-and-snarks-past-present-and-future",
  "sourceId": "Y3PMMA",
  "title": "Elliptic curves and SNARKs: past, present and future.",
  "description": "Elliptic curves are used in many proof systems. Some systems (e.g. Bulletproofs) use plain curves (e.g. ed25519). Some (e.g. Groth16, KZG-PLONK) use pairing-friendly curves (e.g. BLS12-381). Some recursive systems require pairing-friendly 2-cycle (e.g. MNT4/6) or 2-chains (e.g. BLS12-377/BW6-761). Some other recursive/folding systems require plain 2-cycle (e.g. Pasta). In this talk we will go through the difference between these curves and why there isn't a silver bullet curve for all scenarios.",
  "track": "Applied Cryptography",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "ZKP",
    "Cryptography",
    "SNARK",
    "elliptic",
    "curves",
    "Cryptography",
    "SNARK",
    "ZKP"
  ],
  "keywords": [
    "elliptic",
    "curves"
  ],
  "duration": 1519,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "D5x6H5HPkHM",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673334463a168eb535c515c9.vtt",
  "transcript_text": " Hi everyone. My name is Yousef. I'm a cryptographer at ConsenSys working on Gnark, the ZK Snark library and Linear, the ZK EVM. Today I'm going to talk about elliptic curves on Snarks. I have two problems in my life. One, getting my wife to choose a restaurant. A difficult one. And two, Ethereum supports only BN254 pre-compiles. So today I'm going to talk about the second problem, because the first one, we need more time, right? So what are these BN254 pre-compiles? So BN254 is an elliptic curve. So it is this mathematical object on which we can do some sort of cryptography. And mainly these three operations that we call precompile, so they are like native smart contracts in Ethereum. So you can do addition, like take two points and add them, have a third point. And you can do scalar multiplication, which is if you multiply a scalar by a point. So you get another point, which is like adding the points in time to itself, and the scalar. And pairing product check, where you have some bilinear map. It takes points on elliptic curves, output them on some line, some extension field, and multiplies these and check if it is one. So I'm not going to talk about this",
  "eventId": "devcon-7",
  "slot_start": 1731405600000,
  "slot_end": 1731407400000,
  "slot_roomId": "stage-3",
  "resources_presentation": "https://docs.google.com/presentation/d/15MaGmHzAvHj765BvqDHs0ZxiiGevi3H9hscAvkCAGTc",
  "resources_slides": null,
  "speakers": [
    "youssef-el-housni"
  ]
}