{
  "id": "empowering-a-safer-internet-community-driven-scam-reporting-and-prevention-in-thailand",
  "sourceId": "FGUAQX",
  "title": "Empowering a Safer Internet: community-driven scam reporting and prevention in Thailand\"",
  "description": "In today’s digital age, user-driven solutions are vital for online safety. This talk explores Whoscall—a free mobile app trusted by over 17 million users globally, offering call and SMS identification, phishing site scanning, and personal data breach detection—and Thailand’s Scam Alert feature. Both initiatives empower users and promote public-private collaboration in scam prevention.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Public good",
    "SEA",
    "Security"
  ],
  "keywords": [
    "Anti-Scam"
  ],
  "duration": 533,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "guXtHSEhZgQ",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735cb649dbb7a90e1b64fac",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735cb649dbb7a90e1b64fac.vtt",
  "transcript_text": " Hello everyone, greetings from Taiwan. I am Michelle Shen, Product Director at HUSCO. Today I am going to share our HUSCO empowers internet safety through a community-driven approach to scan reporting and prevention in Thailand. In the digital world, trust is fundamental to the online interaction. At HOSCO, we are committed to building that trust by combining cutting-edge technology like AI with global partnership. This approach aims to create a safe collaborative space where user activity and participants in combating scans. Hoosco was founded in 2012. We are founded by the trusted company, Gogolook. Gogolook now has a dual headquarter in Taiwan and Thailand. So for over a decade, we were connected with governments worldwide, including the police agencies across Asia, and we enhanced anti-scan solution. We now have more than 250 employees around the world. So for those who never heard of Who's Code before or you never used Who's Code, so here give you a very quick introduction to the videoอีกที ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตอนนี้ ตทำร้ายตัวเอง แล้วทำร้ายลูก ๆ 1 tbs of sugar 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey 1 tbs of honey Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Ketua kota Okay, so we just published a book. This book includes more than 1,000 of the scammers' calls, and weight is more than seven kilograms. So this book is just a function that we want to give a simple introduction of the host code. That is, if you cannot remember all the scammers' calls, the easy way to protect yourself is to install HoosCode. So why we can do it? I think now because we have the largest number of databases in East and South Asia. Every year we block more than 2.6 billion of spam calls and messages. So we help users identify the stress and stay protected every day. So now we reach more than 100 downloads worldwide. So Hooska offers not only the color identification as an SMS filter, but we also evaluate our new features. So right now we also can help users do the personal data linking monitoring, and also we can detect the suspicious website. And also now we are trying to provide some defects scan detection. The reason why we are consistently involving and to meet the new threat is because the scan become a new normal. According to our annual scan report in AIPAC, only 1.6% of people, they never account for scan before in a year. So means that people will at least account once a month. Even some of the people, more than 50% of people, they will account for every single day. And I think the most important is that the scammers, they are so smart. They were involved with technology. So with these new technologies, such as social engineering, phishing, and defect, they leverage the data science, big data, and AI to power themselves. So that also gives us a learned. Even at Asper's, acknowledging that is a battle that we can not win only by ourselves. We need to fight with the network. So that's why we want to build an involving network to combat a scan. A part of our self and AI technology to present scans and public database, we also couple that tip with government, including the lawyer type police. Most importantly, we believe that we should work closely with our users. Sooner we post, we can discover the new trending scan is happening. So who are these hidden heroes? What outcome did they contribute? In the past years, these report users, they submit over 4 million of scan code reports through the Who's Code. So who are they? After speaking with them, some of them just the uncle or auntie that you will meet every single day. So this community driven effort reflects a strong sense of justice among our users. And the only purpose they want to report is that they want to pretend they are loved. Like they believe the report they built can help more users pretend as guests. So we also found that this value to share will transcend age, even gender, and demographics. So while community-driven reporting is inactive, it also raises some challenges, such as how we're going to ensure the report is trustworthy. And we also have some challenge to meeting the regulator compliance. So I think we also see some opportunity such as incorporating blockchain to facilitate report origins and data integrity will help us to overcome this challenge. So in closing, Unity is essential in combating scan, at whose core we are built for trust and join forces with users, partners, and governments to create a safe internet. Together, I think we can make a meaningful impact. Thanks for your listening. This is Michelle from Google Look. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731579600000,
  "slot_end": 1731580200000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1PhodWX8WCiq6P9Vsm9h6TVZlVmdMbAjQkvyVws1MlFw",
  "resources_slides": null,
  "speakers": [
    "michelle-shen"
  ]
}