{
  "id": "epf-day-panel",
  "sourceId": "ZMRJ9B",
  "title": "EPF Day Panel",
  "description": "Panel with former fellows who became core devs and mentors",
  "track": "[CLS] EPF Day",
  "type": "Panel",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 2235,
  "language": "en",
  "sources_swarmHash": "072589e67adaa227348834bef25064203fc523216871a6bae08780ba110064ef",
  "sources_youtubeId": "sOhT-LfOTkw",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67347fbe9dbb7a90e1b8c58d",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67347fbe9dbb7a90e1b8c58d.vtt",
  "transcript_text": " Okay, I guess we can start. We're already a bit late, but we've managed finally to get all the panelists here. So, yeah, first of all, thank you so much for being here, all the fellows on the panel and all the fellows and attendees and mentors who managed to make it to the end of the EPF day of 2024. And we are wrapping up today's EPF day with a special panel discussion. And I call it the E panel discussion because it's, you know, Ethereum, but it's also Echo, Ethan and Anyco. Completely randomly chosen fellows, of course, to join us. I chose you guys, I invited you guys, because all of you have been in previous cohorts of the fellowship, and today you became full-time contributors, you became working with client teams. I will start with a quick intro, and I will do your intro. You can add if you want something because I want to move to the questions. But so we have here three people who have I believe are representing all kinds of possibilities that EPF can give you because we talk a lot about client teams and the core contributors and so on, but not everybody from EPF is going to end up working in a client team. And there are other kinds of futures for you. And I will start with the lady here, Eniko, who's been working on debt packaging as a part of creating a verifiable deterministic builds for Ethereum clients and has been working on it for more than a year now as a grantee. So continues her EPF work on a grant and working on something which is, you know, Ethereum tooling but not directly to the clients. So a great example of like how how people from EPF can work outside of clients. We have Ethan, who is on the other side, directly in the client, working full-time in Lighthouse as a core developer. And we have Echo, who is a researcher in ARG, or Applied Research Group in Ethereum Foundation. So we have all the representatives of a research flow. So yeah, all kinds of backgrounds. And I don't want to actually talk really about your EPF experience itself, because you can actually find it. If you go to cohort three, cohort four repository, all of the experience, all of the work done by these people is there, it's open.",
  "eventId": "devcon-7",
  "slot_start": 1731489300000,
  "slot_end": 1731492000000,
  "slot_roomId": "breakout-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1zfYthY0BXd-oH251a-aAijUCaZpAylXrBQ0_5terdHk",
  "resources_slides": null,
  "speakers": [
    "mario-havel",
    "eniko-nagy",
    "echo",
    "eitan"
  ]
}