{
  "id": "epf-day-introduction",
  "sourceId": "PE8JHU",
  "title": "EPF Day Introduction",
  "description": "Josh and Mario introduce the fifth cohort's EPF Day.",
  "track": "[CLS] EPF Day",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "EPF",
    "Ethereum Roadmap",
    "Layer 1"
  ],
  "keywords": [],
  "duration": 567,
  "language": "en",
  "sources_swarmHash": "07c8d90edd36f96c7e993e961857bd845f20407627a717428d0862e3d0594b15",
  "sources_youtubeId": "_2fNWYoBrT8",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673887c51b0f83434dcfb118",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673887c51b0f83434dcfb118.vtt",
  "transcript_text": " All right. Welcome to EPF Day. Thanks for being here. My name is Josh. This is Mario. We coordinate the Ethereum protocol fellowship with the Ethereum foundation. And this is EPF day where the fellows from the fifth cohort will be giving you lots and lots of demonstrations about what they have been working on over the past five months. Though quickly, I want to talk a little bit about what the Ethereum Protocol Fellowship is. This is a program that's been running for about three years now. It's been going through five different cohorts, starting with what was called the core developer apprentice program started by Piper Merriam and then Mario and I have been running this iteration of the program for the past three cohorts. The protocol fellowship is a program that is meant to steward the protocol through the bringing in of more and more developers. So according to the latest protocol guild statistics, there are about 180 developers that are working on the core protocol, all the things from specification to working on EL clients, CL clients, doing testing, and also doing lots of the research that is necessary for future upgrades and forks so it's a lot of stuff that needs to get done and not that many people to do it as Tim Baco likes to say and I think others I'm sure you've seen this roadmap before that each one of these tiny little boxes could use an entire team to focus on just that box. So we are here to try to fill in all of those boxes. The EPF, the Protocol Fellowship, has sort of grown a lot over the past couple of years and we've been adding new and new features to it to enhance the experience and to make it easier for people who are interested in doing this work to do so. So it started with the EPF. Again, this is the fifth cohort. At the beginning of this year we started the Ethereum protocol study group and that was a three month, two month long program that offers some more basic introduction and overview to the different pieces of the protocol so those people that are interested and maybe have some developer experience but don't really have much knowledge of Ethereum itself can get introduced to it and learn about the different pieces and parts and understand what it is that they might want to focus on. In addition to that, we've created a resource, epf.wiki, which is the intention is for it to be the go-to place for people who are interested in learning about the protocol to do so answering questions and and helping them to understand more about it it is a growing and collaborative resource so it is in it's still it's sort of fledgling form and will you welcome any further contributions to it if you are learning about the protocol or already are very knowledgeable about it to add your two cents to it. And finally, like Piper likes to say, the door to core development is hilariously wide open. You just have to step through. The EPF open. You just have to step through. The EPF is a way for you to step through with somebody holding your hand a little bit. I'll go ahead and pass it to Mario. Yeah, thank you so much. And let me tell you a bit about the current cohort. So as Josh mentioned, we started this cohort. I feel like this cohort started even before it started because we did a study group first. And it was a very special experience. We started with that this time for the first time, and there have been a bunch of people who came to learn about the protocol basically from zero and then joined the cohort. And in the last six months or during this year, we started the study group, like, February, March. So, like, during this year we started the study group like February, March. So like during this year people who didn't have any idea about the core development became like almost full-time contributors in some cases. So yeah, it's been a wild ride. We had around 45 follows. Just some context to this number because we started, when we started the cohort, it's permissionless, anybody can join. And in these first calls, we had like over 50 people, maybe like 60 people who were interested in the fellowship, but then at least 45 of them submitted multiple updates throughout multiple weeks during like two months or something. So 45 of them at least made it to the second month. But to the very end, till today, we have 30 fellows who made it to the EPF day there are a few of them who couldn't make it of course because of the travel restrictions and so on but we had Anyway, okay, put it further, okay. Five months of the, ah, the echo. Five months of the actual fellowship, which was the first sub-learning part, first month to figure out what projects these people want to even work on. And for many, it was easier thanks to the study group. We had two calls every week. So all together we had over 40 calls together over the past five months. We met each other every week for the office hours, for the stand-up. So a ton of calls. But also, we met in person. First time we met in person in Brussels, we had a chance to meet with maybe half of the fellows, but almost everyone is here today at DEF CON. So it's really an honor to actually meet you finally all after seeing each other at these calls. Yeah, so 30 people made it to the end with 30 projects. It's not one project per person. There were teams of people Working on a bigger scope project together, which is also Amazing to see that people learn to collaborate together. And we will have presentation for 20 projects today. 30 were proposed. Yeah. And altogether we had like over 500 comments, over 500 updates in the repository. So when you open the development updates in the Core 5 repository with all of the tracking for every fellow, it's over 500 of them. So I guess I read all of them, but it's not really possible to do it by yourself. But there's been a lot of work done. And it's hard to summarize what individual fellow did. I know that Rahul summarized it, so I kind of borrowed his data here just to give you an idea what is the output of one fellow who dedicated 1,000 hours to the fellowship. And how many coffees? 228 cups of coffee, yeah. That's interesting metrics that I would like to also use for measuring DPF. But, yeah, thank you so much for the numbers, Rahul. So this is 26 updates just from one person. So you see, like, this is what the single person is able to dedicate to the fellowship over five months. And so with this, today, again, it's an honor to host the project presentations to see your recap of what you've been working on in past months. And there is 20 of them. There is a lot of them. So we have a ton of topics to go over. I'm not going to even mention each of them because you will see them. This is the order, and we are starting with EVM memory repricing. So maybe let's get slowly ready to that. And, yeah, we will have first half of the presentations in the morning with a pause at 1 p.m., 1.15, because we have quarter past 1. We will have 45 minutes for lunch, and then we meet here again at 2 p.m. for the rest of the presentations and for the panel. Two, we'll have a panel discussion as well. So that's the schedule for today. Please enjoy the EPF day. And yeah, I hope you get inspired by the fellows, by their work. I hope you are able to meet some interesting people here.",
  "eventId": "devcon-7",
  "slot_start": 1731467700000,
  "slot_end": 1731468600000,
  "slot_roomId": "breakout-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1UgPaeQAkzm7-SuT2jdxRMLHcVJEzy3CxxHN_BL0ftCg",
  "resources_slides": "https://drive.google.com/file/d/1Z9q2gfwmP7f9R9oGZnirNgq_xScRnNAu/view",
  "speakers": [
    "mario-havel",
    "josh-davis"
  ]
}