{
  "id": "eth-a-roadmap-to-real-decentralization-in-a-world-of-centralized-power",
  "sourceId": "C3HTZP",
  "title": "ETH++: A roadmap to (real) decentralization in a world of centralized power",
  "description": "Unfortunately, trends in block building and MEV furnish rapid centralization pressures that erode the protocol guarantees we gather here to build for Ethereum. We must now define a roadmap to save proof-of-stake. This requires help from builders, transaction originators, protocol designers, and you. We will demistify the hype on how and if trusted hardware (TEEs) can help us decentralize. Let's focus on geographical diversity and permissionless designs, to bring the world together.",
  "track": "Core Protocol",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Protocol Design",
    "Censorship Resistance",
    "Decentralization",
    "MEV",
    "Censorship Resistance",
    "MEV",
    "Protocol Design"
  ],
  "keywords": [
    "TEE",
    "hardware",
    "decentralization"
  ],
  "duration": 1502,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "kSrjley2POk",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67332a173a168eb53572b8a2.vtt",
  "transcript_text": " Perfect. And in this talk we're going to cover kind of a bunch of different concepts at a pretty rapid fire pace. So we're going to start with how does ETH die? How does ETH go to zero? Why are we actually on the road for some possible futures in which this blockchain and this system, which we all love, just like doesn't do as well anymore. How can we save it? What is the formula for that? What does this have to do with E3, which I think is a meme you're going to be hearing a lot about in the next few months, few years, etc. What are the technologies we can use? We just heard about programming, privacy, and other things like that. What else can we do? What can you, the attendee here at DevCon and in the space, do to help this? And then what am I doing about all of this, and where do technologies like TEEs come in? So let's get right into it. I'm going to start a little bit funerary today. So I'm going to talk about what I consider to be the two most disturbing pictures in the Ethereum news cycle, the Ethereum space today, at least to me and to my dream of building a decentralized system together with you all. So the first one is from this paper called Regulating Decentralized Systems, Evidence from Sanctions on Tornado Cash, a paper published by the New York Federal Reserve, authors listed below. And in this paper, they go fairly deep into analyzing tornado cash and sanctions enforcement on decentralized blockchains, kind of enumerating various power dynamics, choke points, and other levers in the system, and then studying how effectively they can kind of manipulate these levers of power to do things like stop technologies they don't like. Technologies which, for example, many people here may have different feelings about. So, actually let me go back to that if I can figure out the clicker. Yeah, so an interesting thing about this picture is it shows the approach that as the nation-state game escalates, as we really go deep into this mission of decentralization, that various kind of centralized parties take on these things we build. And it's very simple. It's about control. It's about the boxes of control. And it's about how to leverage them and make sure we put as many X into these boxes that we see here as possible. So that's the first disturbing picture. The second one, so this is a graphic that you can go browse yourself online. The URL is up there. I can't read it from this distance, but benjdd.com slash AWS. There we go. And here you can go through the various different AWS data centers worldwide and kind of view different AWS to AWS latency pictures. In a very real world, this is the topology of the internet, of the networks on which we're building our technologies today. So you can see on the left there, you have US East 1, which is the most popular AWS data center for crypto deployments. And the lighter the color, or sorry, I guess they changed the color scheme, but I think the blue lines are things that are like approximately on the order of under 400 milliseconds. The light blue line is kind of, or maybe it's under 200, and the light blue line is over 200, etc. But you can see there are these very clear corridors of latency and power that we've built. Why is that? Well, because that is where the data centers are. That is where the economic activity is. That is where, in many cases, the users are. That is where companies want to have their servers and want to build their infrastructure. That is where the capital is and the investors and all of these pieces of the puzzle. And so we've built a power overlay using the latency structure of the Internet on top of that. And this is what it looks like. So we exist in a world where there are two fundamental realities. The first one is that much of the world's power is already centralized. That includes military power, economic power, geopolitical power, social power, and more. And on top of that, the disturbing trend is that centralization begets more centralization. So centralization is an accelerationist loop onto itself. This is present in markets through phenomena like economies of scale or winner-takes-all. It's present in zero-sum games such as trading. It's present in auctions, etc. So when you have one sort of centralizing vector, that tends to bring all sorts of centralization into various aspects of your system, something we really want to avoid if, as we said before, deconstructing the nation-state is at all on the radar for this project. So what I would say, that given that we are in these situations, we have to stop YOLOing protocol proposals and upgrades in terms of this power dynamic and this topology on which we exist, and instead we have to start treating distribution of power globally as a first-class goal for the next chapter of ETH. How can we be intentional about where we're pushing power in the system? This is much, much more important than the performance of the system. Fast block times, throughput, latency, anything like that. Because if you have those things without having distributed power, you've essentially just reinvented the systems that we were trying to escape this whole time. Those performance systems already exist. Otherwise, we come back to the reality where much of the world is centralized and centralization begets centralization. So instead of that, let's stop YOLOing protocol proposals and treat distribution of power globally as a first-class goal in E3. Okay, I'm gonna exit the infinite loop and instead go to the infinite garden. So this is an actual picture of my grandmother growing her own infinite garden. And I think the solution, the exit to this loop, is planting our own gardens, building our own systems. So let us all together kind of brainstorm this infinite garden of power distribution and think about very intentionally, carefully, and together about where we want power to go. I'm going to give you one troll idea, and I'm sure you're going to hear many more over the next few weeks, but this is going to be E3 done my way. This is the best hatching gif I could find that was free. Shout out Wikimedia Foundation, but it is very cute. All right. So in my opinion, these are the four pillars of E3 as I see it. And I say pillars because these are actually non-negotiable properties. If either of these four things, any of these four things are compromised on, we will fail to achieve the goals of cryptocurrency. We will fail to achieve the goals of Ethereum. And as I said in the beginning of the talk, the price will obviously be zero, regardless how much institutional interests or ETFs or et cetera we're able to create. So these four pillars, as far as I see them, number one pillar is permissionless. And I'm going to explain each of these in greater depth. Number two is distributed from a technical perspective and a computational perspective. Number three, and this is the most important property by far, is geo-economically decentralized. And we're going to define that very carefully shortly. And number four is neutral builder efficient. So what are these pillars? Let's get into it. Well, the first one is permissionlessness. This is something we should all have at least a little bit of context on in this space. But specifically, I slice it with thinking about MEV and how MEV is expressed in the protocol, because that's what I work on. So for me, what permissionlessness means is that any actor is able to express their value or preference into a block at any point in the block construction process. And that value is able to percolate to be expressed through the process and into the system. You might note that this is actually the same as many definitions of censorship resistance. Essentially, if you pay a fee, you get in as one slicing, although there's a lot of kind of details there. Okay, other than permission lists, we must also make E3 distributed. So this one is pretty obvious too. This means taking computations that right now require one big computer or one big server and breaking them down into small pieces that we can then distribute kind of all over the network and all over the world. Without doing this, it's hard to imagine how to decentralize. If you require a huge computer to do everything in one central place, that's inherently not decentralized. All right. This property, as I said, is the most important, geoeconomic decentralization. I'll spend a little longer on it. So this specifically is a very specific notion of geoeconomic decentralization, saying that co-location in the protocol must yield minimal additional profit. So this is not saying, hey, we have a node in France and a node in the U.S. It's not saying, hey, we're on three of these AWS topologies of power. We're on three of these links, or five. That is not geoeconomic decentralization. Geoeconomic decentralization is saying that there's a level playing field in your system for people who are participating outside of those existing corridors of power, outside of those existing latency links, outside of that game theory we've created with AWS. And those people must be able to participate as profitably and as meaningfully as the people who are sitting in New York, as the people who are sitting in Japan, co-located with Binance, and et cetera. If you reduce the participation of those systems in the network, in the iterated game, as time passes, your network collapses to these central points of geography and power, and then you lose any hope at censorship resistance or any of the other properties you want. All right, so those properties sound great. Can we actually build that? Well, this is my troll roadmap to get there. It's a little bit oversimplified, but hopefully it communicates the point. So I believe right now, standing from today, there are two things or kind of two broad pushes I want to work on. The first is to TEFI everything. Why TEFI? Well, we're going to get more into that in a second. But basically, TEEs allow us to distribute the computation. So remember when we said before the one big computer becomes many small computers? TEEs give you the trust APIs to make that possible with untrusted parties operating these small computers. And once you have this distribution, you don't have decentralization yet, but at least you're able to start pushing this infrastructure and pushing the power to the edges of your network and outside of those lines of AWS, those lines of power that we have today. So after we TEify everything, we have to start in a cycle doing two things. The first is pushing this power to the edge. As we deconstruct the computation, as we modularize it, we push. And then the second thing is also to reduce the power of actually TEs in our system. So TEs are not a silver bullet. They're not a magical solution to everything. They give a lot of power in the system to Intel. They take it away from that graph that I showed you earlier with AWS and move the needle a little bit more right now towards Intel and NVIDIA and AMD and other hardware manufacturers. So while I would argue that's better than only having kind of trad-fi latency corridors determine the evolution of our network, it's still not perfect, right? And there's a lot we can do using other cryptography, including what we've heard on the panel before, using other alternative TE approaches, open TEEs, things like that, to sort of remove power from the TE itself as well. So I think it's a two-track approach. Once we have the platform to distribute and push things to the edges, we then have to actually start pushing things to those edges, and I'm going to cover how you all can help with that shortly, but also start kind of eroding that core power that we've now built up in moving this needle to this other party which is Intel so I'm going to ask for your help please so please give me your arms or if you don't have arms just your body give me your soul sounded kind of dystopian so I'm not going to ask for your soul but please give me your help in this and how can you all help with this well if you're a dap developer if you this? Well, if you're a dApp developer, if you're an infrastructure developer, if you're a user, ask yourself, how can we, for our uses, what we're doing, what we're using the protocol for, how can we get power off of these corridors of power that we see here? Can we use endpoints that are in different locations? Do they meet our needs? Can we deploy our server somewhere that geographically makes sense for the change we're trying to create in the world, rather than defaulting to US East 1 on AWS because it's the first thing that happens when you click launch? Are we able to make that change as a space? I think everyone needs to spend some time thinking about what am I doing, and is it actually helping centralize power onto these power corridors, or is it actually helping push power out to the edges which is what actually underlies the long-term value of decentralization and cooperation and even the price yes okay so going back to this graph well one obvious thing you might just say is oh we have many boxes why not just have many of them just sign or have some sort of list where the proposer is forced to sign? Well, the reason is very simple because it doesn't actually solve the power distribution problem. It's not a meaningful solution to censorship in any way, right? If in your metagame you collapse to a state where the system itself is very centralized, no form of technical paper mache, technical decentralization, etc., even though it feels really good to us as technologists, it feels great to just say like, hey, we can just do this and it solves the problem. Does it? I mean, let's think about it for a second. So certainly on Binance Smart Chain, it would not. And in general, what I would say is censorship and power dynamics and the way our money works, these are political problems. We're not going to tech tree our way out of these problems. We need to have deeper conversations about where the power is in our network, where we're building power in our network, and how we iterate that towards a place that works better for us. That being said, that doesn't mean that as technologists we can do nothing. Our job is not to make it worse. So please also help me in that if you're participating in this space. Do not centralize power back to those corridors. And remember, today we already live in a world where much of the world's power is centralized, and centralization begets centralization. So I think this is really existential to ETH. We're at the point where we have a choice as a community of do we start pushing the power we've built out outside of AWS or do we concentrate it seeking ETF inflows, seeking stock exchange listings, seeking trad-fi participation, and concentrate the system to the very corridors of power that we thought we were disrupting. So to get actual decentralization, well, the definition is very simple. It's how much have you pushed this to the edges? And I wish it was something that could be easily quantified, but unfortunately it's not, and that's just something we have to live with. A few more things I have to say. So the first is, this is a little bit spicy and a little trolly. I think we should reject the Ethereum endgame. So the Ethereum endgame, for those who know it specifically, is a slightly older, probably like somewhat out of date post, so I'm kind of attacking a straw man here, basically saying that like, hey, is it really that bad if we have these big centralized machines doing things specifically for MEV, but then we kind of keep them honest with the rest of the network. We keep that lightweight and everything. I think that's defeatism personally. I think we can decentralize all the things, and I think as long as you have a central corridor of power, a central source of concentrated power, any sort of system on top is not going to be able to meaningfully police or control it. So we need to actually decentralize all the things that require the big machines as well. Doing a deeper dive into how this relates to censorship resistance. So censorship resistance is a very interesting topic. Traditionally in the academic space, it says that if you create a transaction that assume you pay the fees, you'll be included within some number of blocks. That number is called delta. It's called the censorship resistance or synchrony parameter. So one question I have for us as a protocol is what delta do we actually need and how do we value various deltas in the protocol against other properties we care about, like power distribution, kind of geographic decentralization, et cetera. Because as you push delta to zero, you actually get fair ordering out of the censorship resistance definition, right? If you need to be included immediately, as soon as your transaction is sent, well, what does that mean for the person that's on the other side of the world? How does that stack up with them? What if your delta is below the network limit? How does that then get resolved into the protocol? How do we weigh collapsing these trade-offs against other centralizing effects we can create in the MEV space that maybe help us build this robust geopolitical base and actually allow us to push power back into the edges. So I think the most dangerous thing the space can do right now is essentially fetishize and chase one-block censorship resistance at the expense of all of the core properties that will actually provide geopolitical robustness and censorship resistance in the long term. I think we haven't had a conversation in the community about how to weigh those two things together. So let's do that, please, before we start YOLOing protocol updates. And let's do that in a way that addresses this approach to censoring our networks. So what we need for decentralization is real global meaningful distribution of power. That sounds great, Phil. But we all know there's certain things standing in the way of that. So the first one is what I call UX fentanyl. This is a Web 2 mentality that you need to make things faster and more addictive for your users. If your users aren't addicted, if they're not running on your treadmill, if they're not generating returns, you failed, you're a bad person, you're a bad founder. No, that's not the way we build Web3 applications, I'm sorry. If you chase UX fentanyl, you chase the dragon over and over and over again to the end state. Well, now you need 50 milliseconds, now you need 10 milliseconds, now the mind can perceive five milliseconds. We've gone down that path in web two, and we've ended up with users that can't meaningfully interact with the technology. These zombies that just are kind of fed these inputs, right? How many people like that here? Nobody likes it, right? So let's stop that shit in web three, please. Enough. Yeah, seriously. Another one I want to talk about, and this is a little bit mean to the EF, so I feel a little bit bad whenever I talk about this, but napkin research. And I tried to choose a slightly fancier napkin this time instead of like a dirty napkin or something. But I think we do a lot of our research discussions very informally and without even having deep conversations about what are principles? What does censorship resistance mean to us? What does this protocol change mean? How do you define it i think we can do a lot more i've written a blog post about a few ideas i have but i'd love to talk to people because i think the problem with napkin research is when you have a room this big the napkins become a flood and it becomes too easy to lobby too easy to capture the process too easy to get kind of yO protocol upgrades and bad ideas shipped into the L1 we all care about. So let's kind of upgrade our napkin. The problem is if you combine napkin research with UX fentanyl, that's a pretty bad situation. So that I think is how ETH goes to zero. It's the combination of napkin research and UX fentanyl, eroding the decentralization we've built so carefully and leaving us open to capture, to co-opting, and to rebuilding the systems we sought to evade. So in all of that, the exit must be globally distributed power. There is no alternative. The alternative is $0 ETH. Say it again and again and again, please, in the mirror. Let's move beyond the napkin. This is a table that I have from a talk I gave at ETH Denver. I encourage you to look it up. It talks about all the technologies that we have, including, as we talked about, kind of programmable encryption and their various trade-offs for deploying in these contexts that we have in distributed protocols, including who would break them, including rent privileges, including geographic decentralization, which I think is the most important row here. We need to jam more about this and fill this table out more. Unfortunately, I don't have time to go deep today, but please check it out and let's discuss more. Okay, I'm going to leave you with one soundbite. Why TEEs? Well, they give us the theoretical maximal performance for taking all of these monolithic things we have and distributing them so we can push to the edges and at least for what I care about which is the MEV context we can iterate the security there and for your DAP if you want to do this the recipe is simple build demand distribute the infra to where your demand exists natively to it and then scale your network from there. As for what Flashbots is doing, we're doing so many different things in terms of TE-fying everything, pushing it to the edges, creating platforms for you all to push things to the edges more. There's a lot that's going to be coming out in the next few weeks, so the only thing I can ask is for you to stay tuned or find me later. And please don't forget that I need your arms so that we can get out of this power dystopia. All right, thank you very much, everyone. All right, Philip. Well, well, well. Napkin, fentanyl, and arms. That's quite a fascinating presentation. But nevertheless, let's go right through our Q&A. We've got about four minutes left. Is there any value to centralization at all? Or do you believe everything in life should be decentralized? What do you think, Philip? Yeah, I mean, I think, for example, government is fundamentally centralized, right? And many people find that valuable in many contexts. I think, you know, like for example my laptop is like a centralized computing hub for myself. I don't necessarily want to decentralize that. I think it really depends on the application. I think decentralization is useful where you want cooperation across differences and that's actually where the power and censorship resistance comes from. The more different people that are cooperating under the same tent, and the more each one walks away feeling like, yes, that was fair, that was a just outcome, the more robustness, the more censorship resistance you get for free. And so I think in those cases, it's not centralization is harmful. But in other cases, it totally does make sense. Excellent. Thank you very much. All right. I see people voting and up voting the up voting the questions right at the top with five votes TES are peak centralization three US companies a local device ZKs a viable alternative take it away yeah so we can have a deeper conversation about ZKs ZKs don't allow for the kind of like interactive group computation that you need to do in a lot of consensus protocols or for example MEV or transaction processing. So maybe like kind of at the edges of like, okay, if I show you a proof, maybe you can run this more limited algorithm. Yes, but at the core, it's not really the same tech or the same abstraction. I think all of the entries in that table, ZK, MPC, FHE, TEs, et cetera, crypto economics, they can all chisel away at the centralization. So it's all about using which one is appropriate for your app. Maybe your app is already centralized. Maybe it doesn't need geo-decentralization. Then why would you use a TE, right, et cetera? So I think it's about putting as much as possible off TEs and making TEs also able to be kind of more trusted by having open TEEs and things like that in the future. But yeah, it is a centralization risk for sure. All right, excellent question, excellent answer. How do you think centralization risk of staking compares to the rest of your pillars? I'm not sure what centralization risk of staking means if it means like basically the stake set becoming more centralized or the fact that staking exists centralizing the coin supply I think there's many like slices of staking and centralization I think yes it is kind of implied by the rest of my pillars in my world view like if we have permissionlessness and distribution and specifically geo-decentralization where it's fair for you to participate no matter where you stake, I think you get less stake centralization. So I would say for me it's like downstream of the pillars. If you want to slice it there, I think it is a totally valid thing to have on the table. Say like we don't want centralization into the stake set all right we got one minute more let's try one last question with six upvotes te solve every problem that was previously described in the programmable cryptography session why aren't more people promoting them not only do they solve all the problems but you can use them together to give you defense in depth to give you various optimizations and things like that we're building like a lot of stacks to help people do that. So I think a lot of people are promoting them. I think people are afraid. I think people in crypto and in life and in general, they love binaries. Either TEs are broken and they're useless, they're garbage, we need to burn them down, or they're the best thing ever. And they cast every opinion on TE into one of these two buckets, the reality is much more nuanced. They make sense for a lot of applications. They don't for many others. I think people are promoting and using them and seeing success using them actually basically everywhere they make sense. So I do think you will see more people promoting and using them over time. Definitely in time to come. Ladies and gentlemen, let's give our speaker another big, big round of applause. Thanks, everyone.",
  "eventId": "devcon-7",
  "slot_start": 1731403800000,
  "slot_end": 1731405600000,
  "slot_roomId": "main-stage",
  "resources_presentation": "https://docs.google.com/presentation/d/1bcWYCRlknrhBAHOizptWAGujiHHrSU_sAh9xh-oi1js",
  "resources_slides": null,
  "speakers": [
    "philip-daian"
  ]
}