{
  "id": "ethereum-citizen-embracing-self-sovereign-digital-identity",
  "sourceId": "ATKWT8",
  "title": "Ethereum Citizen: Embracing Self-Sovereign Digital Identity",
  "description": "The world is changing. Everything is becoming digital. As we seek to extract more from digital services, we are giving them more and more of our personal data.\r\n\r\nBut it doesn't have to be this way. Just as we gained self-sovereignty and ownership over our digital assets and money, we can achieve the same for our digital identities and data using similar and new technologies.\r\n\r\nThis presentation will explain what self-sovereign identity is, why we need it, and where we stand today.",
  "track": "Cypherpunk & Privacy",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Privacy",
    "Identity",
    "Social",
    "data",
    "Identity",
    "Privacy",
    "Social"
  ],
  "keywords": [
    "Attestations",
    "data"
  ],
  "duration": 600,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736d9ad74749a4b8937d5e4",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736d9ad74749a4b8937d5e4.vtt",
  "transcript_text": " Hi, welcome from my site as well. I'm a researcher and founder of Lutrolabs and today I'm going to talk about how Ethereum citizens are embracing self-sourced identity. So who is a citizen based on the dictionary, a person who is a member of a particular country or a person who lives in a particular town or city. We extend this definition to the 21st century, we can just state the network state or any part of the digital community. But who is an Ethereum citizen? So Ethereum citizen is a person who is participating in the Ethereum ecosystem or using the Ethereum technology to achieve its goals while promoting the Ethereum's values. So I just want to say there is really no hard definition similar to Ethereum enlightenment, but you can pretty much tell by feeling what I mean by that. So what are the Ethereum values? So from the technology perspective, this is decentralization, security, and scalability. But from the user perspective, is in decentralization security and scalability but from the user perspective this is self-certainty censorship resistance ownership permissionless and privacy so where are we today so for financial assets uh we are pretty much there uh for smart contracts we are somewhat there so smart contracts can be permissionally deployed to the ethereum network but usually they can be upgraded through the governance process of a decentralized community, but most smart contracts have multisig today. So websites. Websites can be hosted in a decentralized way on a decentralized storage network, but we are also somewhat there. And for identity and data, identity and data should be fully owned and controlled by the users. And we are not there yet, but things are getting better in the last years. So as an Ethereum citizen, I want to control my identifiers so no one can take my identity. So here we have many options. So basically identifiers are Ethereum addresses. ENS handles DIDs or semaphore identifiers in the ZOOPAS. But currently the most adopted thing we have are EOAs, so blockchain addresses with ENS, but this doesn't give us any privacy. And for the data part, we want to control our data and share this closet only to the people we want and when we want. So that means that the data should be stored in our wallets, on our personal servers, or encrypted on the third parties. But for that, if we want to make it that work, we need verifiable data. So what is verifiable data? This is like the famous triangle of trust in the self-sourced identity community. So we have the data issuers, we have users, and we have verifiers. So how the verifiable data works is that the issuers issues the data to the users and they sign over the data. And when users disclose the data to the verifiers, the verifiers can verify the digital signature so they know the data came from the issuer. But here I also want to mention that the data issuer and the user can be the same person because some data can be self-signed or self-issued if the data is not that important, or maybe it is important, but for example, what is my favorite color? This data can be signed by myself. So what's the reality? So financial assets in the decentralized applications are in our control but the data is usually stored in the centralized databases for example list of my favorite favorite nfts or tokens on trading devs this is usually stored on each platform in their centralized databases on every platform you have to connect your social accounts and prove that you're owning them and you have to repeat this on every platform and the kyc also you have to connect your social accounts and prove that you're owning them and you have to repeat this on every platform and the KYC also you have to repeat that on each platform but it's not all that bad things have drastically improved in the last two years so for example just look at your tickets for the DEF CON you can you store them in the zoo pass so the tickets for the DEF CON are one kind of the verifiable data, and we also have other kinds, for example, forecaster and NAND protocol posts. DIDs and verifiable credentials are getting more used in the last years. The proof-carrying data is another type of the verifiable data, and we also have zero-null solutions like ZKIT-TLS. So how would the perfect world look like? User would visit her favorite app. The user needs to fill out some information, for example social profiles or any other data that this DAP needs, and the DAP would be able to fetch the data or from the user or from some other third-party provider where the user is storing his encrypted data, and the DAP could use this data without requiring the data to be created or filled out again. So what are some of the challenges? First challenge is user-friendliness. So data sharing in this way takes a long time. Proof generation time for zero knowledge proofs also takes a long time. Use the developer experience so we don't have any unified SDKs and tools for different solutions. And we have many standards for the data and identity but we also don't have enough standards on the wallet side and how to actually use these standards in the applications. So Ethereum citizens will become self-sovereign when not only their assets, but also their data and identities will be owned by them without any centralized point of failure. And that's it from my side. Thank you. Thank you very much, Vít. So, Q&A, remember, just raise your hand, and I will toss this to you. Are there some questions for Vít? Yep, let's go. Hey, quick question on your view of government data. So because all of our identities, unfortunately, it's tied to some sort of government credential. How does that integrate into the schema that you presented for Ethereum citizens? Yeah, so maybe I can talk about how the idea is currently in Europe, where I'm from. So the European government and governments talk about how the idea is currently in the Europe where I'm from so the the European government and governments are also pushing for the similar concept so you have issuers you have users you have very files verifiers and you also have the data signatures basically the whole system is the same only the issuers are the government entities which are issuing the data. You're saying to integrate with the IDAS 2.0 wallets, that's the plan? Excuse me? So is the plan then to kind of integrate with IDAS 2.0 identity wallets that governments are providing? I think that depends on the applications. For example, if you have some decentralized applications, you don't need for everything the government IDs. But I think that the best approach is to merge on the similar technologies. So basically, if you are working on a wallet, which works in the Ethereum ecosystem, it's not so much work to also support other government use cases or whatever. Are there any more questions? Don't be shy, guys. Yep, we have one. Don't be shy. put it close to your... I'm bad at volleyball. So the question is, like, what do you think holds us back? Is it just the governments and KYC providers being not flexible enough? Or, like, what's the real... I think there are many challenges. So, for example, if you want to develop your application in a way that the users own the data, I mean, like, the user experience in Web3 is already not so great. And if you want to do everything like I said, it gets even worse. So I think that we need more tools, just like the standard technical things that we need to figure out first before we can give it to the user so they can use it more. Thanks. Yep, we have one question. Will be the last question. Yeah, thanks. Do you think there's going to be, is there somehow a bit of a race between governments rolling out citizen identification systems which are mandatory and a version of decentralised identity which you've outlined here? and a version of decentralized identity, which you've outlined here. Are you optimistic that the idealized, decentralized, self-sovereign identity model will prevail in time, or do you think they're at odds with the centralized sort of government-issued IDs? I think that in the short term or midterm, we will have both. So basically, like, I don't see that, for example, getting a passport or anything like that, we will be able to do it with decentralized identity. I think that some kind of documents will always be tied to the government identities. But inside the, like, Ethereum ecosystem or there, I don't think there is be tied to the government identities, but inside the Ethereum ecosystem or there, I don't think there is a need for the government ideas. I think we can go fully with decentralized identity. Yep. So that's all. Thank you very much. Thank you. Pete.",
  "eventId": "devcon-7",
  "slot_start": 1731646800000,
  "slot_end": 1731647400000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1JzCvRvtEDW6bmL33pf1kIydVAzlZM-tN5p_XZlUg02I",
  "resources_slides": null,
  "speakers": [
    "vid-kersic"
  ]
}