{
  "id": "ethereum-culture-expanding-in-the-infinite-garden",
  "sourceId": "ZS338S",
  "title": "Ethereum Culture Expanding in the Infinite Garden",
  "description": "As a designer at the EF for the past 5 years, I’ve witnessed the unique culture of Ethereum and its growth. My talk aims to illuminate the vast cultural landscape of our ecosystem such as Cypherpunk, Regen, Degen, and L2s as subculture. I'm hoping to assist ecosystem participants, especially new comers, in becoming the infinite game players in the Infinite Garden.",
  "track": "Cypherpunk & Privacy",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Values",
    "infinite",
    "garden",
    "Values"
  ],
  "keywords": [
    "Culture",
    "Subculture",
    "Infinite Garden"
  ],
  "duration": 1177,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67370b1774749a4b89860bb8",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67370b1774749a4b89860bb8.vtt",
  "transcript_text": " Hi everyone. Good afternoon. Or morning? Afternoon, right? So I want to do a really short presentation about what's happening in the Ethereum culture, actually. And I want to give you some sort of landscape of what the culture looks like. Especially this DevCon has like 60% of people are new to DevCon. And a lot of people might be the entry point. They are very curious about what is Ethereum. So I want to give you the super, kind of like a digest of what is the Ethereum culture expanding. In the Infinite Garden. So my name is Tomo. I'm a designer at the Ethereum Foundation and I'm from Japan. I work on the DevCon and some other stuff in the Ethereum Foundation stuff. Probably you see a lot of things. Not this, but this is, yeah, this is some sort of, like, I do illustration or design. This is from the Ethereum Foundation website. And then DevCon. Like, probably, I don't know how many of you enjoying being at DevCon and this whole design stuff. I worked on this, and then with other people, of course, collaboration is very important. So I'm really appreciating. Thank you so much for enjoying, and I really love to hear what you guys think. And yes, I am excited about the future of DevCon and stuff. Anyways, so Ethereum is a cultural platform. I could say that because I got involved in Ethereum five years ago when I joined to the DevCon Osaka. And then I came to the DevCon and I thought, oh, DevCon is like the Burning Man for techners. Did I say? Yeah, techners. Right? So everybody knows what is Burning Man? Yeah, Burning Man is like this. Right? And having fun and self-expression and having a great moment. Right? And then get together as a community, and sometimes you reflect, right? So very similar somehow. So I was like, okay, I can definitely contribute more to this community. Okay, so now, so what is a culture actually? So culture definition, the art and the other manifestation of the human intellectual achievement regarded collectively, that's cool, and the ideas, customs, and the social behavior of particular people or society, right? And the third one is actually really like, maintain tissue cells, bacteria, etc. in a condition suitable for growth. It sounds like a very ethereum actually. So that's the image of that. Like we're creating actually small things in one of those. So each one has its own unique activities and projects, things. And in terms of the culture, I talk about the music a lot because music is very cultural and that influenced me so much. Do you know whether this picture is the club culture we're really familiar with right now, with the big speakers and lighting. Do you know where it started? Do you have any idea, anyone has an idea where the club culture started? Some people might say like Detroit. Detroit techno things was happening before. Anyone has any idea? Like some... Japan. Oh, Japan is cool. Japan is really cool. I'm proud of Japan. Okay, so the origin, as far as I know, is here. Jamaica, late 60s and 70s, they were creating a sound system in the park, and they created those dancing environment. And one time in the late 90s, a producer forgot to, so they were actually creating copies of records, and they forgot to copy the vocal track to the next record. So it became like the only track record was created by mistake. And then when they played that, people got nuts about it. So it's like the craft culture started by mistake in the late 60s. I think it's the 69 or something. But that's a beginning. And then that's created as the mistake. It's a small thing. So starting from there to that, this is phenomenal. So that's a part of the culture. So we are one of those three things. And then imagine we're reaching 10 years next year, but many years later, what's going to happen? So I want to go a little bit of digest of major subcultures in Ethereum. So cypherpunk. So probably a lot of people heard about this word and probably swag, the rain jacket, is reflecting that ethos of the cypherpunk as well. So cypherpunk is the DIY movement, also prioritizing your privacy and security, and it started in the 90s, so that was kind of like a base of the culture who built cryptographic technologies and also a lot of applications such as Bitcoin and now Ethereum. And that relates to, I think you talked about the, yes, cyberpunk and also the lunapunk also. That's kind of a sub-subculture, right? And we have regions. Regions is creating the participative economy with smart, cartographic, and social impact culture. And of course, we should not forget about the regions because the regions play some interesting role in the ecosystem as well. So those three are major subcultures in Ethereum, and also layer 2s are creating another cultural element. So, let's appreciate and then see how it's going to grow, right? And an example of the cultural experience and ideas, obviously, in the DevCon, this is one of the most active cultural experiences. So I hope you guys are enjoying it. And DevConnect is another event run by Ethereum Foundation. We're doing next year. It happened last year in Istanbul. Next year, we don't know where yet, but we'll see. And local community events are so important we have a lot of like we had josh mentioned probably 100 more local events was happening over the years right so it's really amazing it's called creating and then pop-up pop-up community such as the zara edge city and etc it and etc. It's becoming an interesting experiment, and I attended one of those in Chiang Mai, and it was really fun. And also, yeah, great to observe what the global movement is going to be. Pagoda is one of the local region-oriented group that focuses on Asia. DIAC. DIAC had a session yesterday, and it's trying to be safe. Technology is cool, but also accelerate, just defensive acceleration is very important because we want to create the humanity safe and protected and this is this is a video example of the DIAG for meイエーク So technology is cool, but you don't want to be just like using the phone at the club. You know, just take a photograph or videos. You know, you want to enjoy life. So, yeah, just be sure we create technology for something good. And autonomous world is the concept of, digitally could be also real world, I believe. It's the cryptography and also what did I say? What did I say? Yeah, small contract type of platform to create an automatic and autonomy society movement and then organizations. And also, in this DevCon, I led the artists and writers cohort, and then there was eight installations in the venues. And it was great to experiment for us to work with the artists and writers to learn what is the essence of Infinite Garden and reflect through art and writings. Yeah, we spent about three months to work on this. And then this was really, yeah, I learned so much. Okay, so how is it expanding the Infinite Garden? I believe most people know about the Infinite Garden, I guess, but let me repeat that. The essence of the Infinite Garden is creating a platform or space so that you can keep playing the infinite games. And let me read this quote. A final game is played for the purpose of winning. An infinite game for the purpose of continuing the play. So we, as the Ethereum community, we don't want to create winners and losers. We want everyone to keep playing the game. So that's the essence of Infinite Garden. And when it comes to playing the game of culture, it probably looks more like this. When it comes to playing the game of culture, it probably looks more like this. Like expanding. So we're not experimenting in a small space, but more like we're visioning expanding and connecting. And there was a lot of activities I listed earlier would show up like this. And you are belonging to one of those, I believe. And another way to describe the expansion is like this as well. And we say my solarium is a good example. And yeah, again. Okay, so, okay, I'm running out of time, so I need to go really fast. Okay, you're also building a culture, right? Because you're creating something in Ethereum. So how to build a culture in the Infineon Garden? So learn the core values. These are core values, okay? So you can go to Vitalik's website, blog. It's super good about make Ethereum cypherpunk again. And define your values. Like why are you working on Ethereum? Just reflect why, right? And then create the practice and project. And because culture has more impact than feature. And when you create a culture, from culture to feature, I think that will make things so much better, I believe. And then step four, share your values. Just like I mentioned about the mandala in the opening ceremony. And remember, we are starting like this. Starting with the sound system, and we are creating the global culture together. Okay, thank you. Sorry, I took so long. Thank you very much. So, turn for the Q&A. Oh, we already have one question. Oh, nice. All right, thanks for that. That's a really cool presentation. I think it's generally easier when you're running an open source project or something that's a public good. But what advice would you have for builders that are building for-profit tools in the ecosystem? How do they fit into this ecosystem from a cultural perspective? With my experience, I would say actually paying forward mindset is always somehow works. It's not as the project principle, but more like a principle of life. And then that is somewhat like you just contribute first and then just receive afterwards. And then not expecting too much about it. Expectation kills you. So I don't know if I'm really answering your question, but that's how I have been doing. No, you are. It's like sharing without expectation of returns, not selling, not transactional. Contribute. Got it. Thank you. Okay. Thank you. Have any more questions? Yep. have any more questions yep uh who are the artists that influenced you in your personal style it's definitely Miyazaki uh I grew up in Japan and also the French artist called Mobius they actually both are influencing each other in the 70s and 80s, so that's definitely my biggest influence. All right, are there any more questions? Yep, we have one over there. What are some areas you think people are under-focused on, that people should focus on in the culture of this community? That's a really good question. Let me think. Well, that means actually, I think there's a lot. I feel like Ethereum is covering actually so little. And I'm not saying necessarily Ethereum should cover everything, but I think we are covering our own places and area of interest as a community, and we can expand more, and a lot more. And a lot more I never experienced or never heard yet. So I think it's okay, and I'm curious, what do you think? What do you think you are, you know, what's missing for us? If you have. There's definitely something about people don't know what Ethereum is. If you talk to a normal person and they just think it's the gambling. So there's definitely something there. Maybe it's a product that really helps people or a narrative that makes people feel it isn't just for gambling. Yeah, definitely. I 100% there's a lot of people have a misconception about what is Ethereum. That's actually why I am kind of working on creating the world of Ethereum using my skills to create some familiar world or that's somewhat you can experience. So yeah, definitely, yeah, that's a good challenge I'm taking and I'd love to challenge more. Yep. We also have one over there. So there's a lot of things that contribute to the culture, you know, whether it be people building in the ecosystem, events like this. So what do you think are some of the key pillars that help build a culture within Ethereum, for example? I would say those three pillars, the cypherpunk and region and decision, are major pillars that build this ecosystem. And definitely the cyp, Cyberpunk is the largest. And then we can actually learn what is the essence of Cyberpunk and create your own version. It is really fun and also probably meaningful for you as well. What was your personal reason for joining the Ethereum Foundation? Personal reason to join the Ethereum Foundation? I was actually asked to apply to the job. It was five years ago and and a designer was leaving, and so they were looking for the new person. And then I got a connection to apply. So, I mean, that's a dumb question. Dumb answers. But, yeah, so actually, so I started working, right? And then, again, it came to DevCon, and I just realized what this experience is such amazing. So I just decided to stay. All right. So cool. Thank you so much. Thank you very much.",
  "eventId": "devcon-7",
  "slot_start": 1731649200000,
  "slot_end": 1731650400000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1A5FoYp0OS56Zm_O5Ba5qVu-PLRcWRf09JijiP2TnAog",
  "resources_slides": null,
  "speakers": [
    "tomo-saito"
  ]
}