{
  "id": "ethereums-ultimate-gift-will-be-birthing-digital-matter",
  "sourceId": "XSCFZR",
  "title": "Ethereum's Ultimate Gift Will Be Birthing Digital Matter",
  "description": "Bitcoin created Digital Gold, intangible yet valued like real gold. Ethereum will birth Digital Worlds which culture will treat as real. Unlike Bitcoin's scarce digital coins and tamper-proof IOUs, these worlds will have scarce digital matter and tamper-proof physics. Within them, inhabitants will use primitives like smart items to build economies and civilizations with society-shifting GDPs.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Autonomous World",
    "Gaming",
    "Use Cases"
  ],
  "keywords": [],
  "duration": 1025,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "ZwkGlbjT1SQ",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6734901b9dbb7a90e1916dd8",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6734901b9dbb7a90e1916dd8.vtt",
  "transcript_text": " Hello. Okay. So, funny enough, the last talk was about building a game with mud in five minutes. This talk is going to be about a game built with mud in five months, so the much more extended version of it. And I think the last talk you probably found to be useful and technical, and you can do something with it in your life. This talk will be really, really weird. And you might find it useful, but you should at least find it really weird. Ethereum's ultimate gift will be birthing digital matter. So basically we'll start off by saying that one lens to view Ethereum is as a more efficient, open global financial system. This is a valid lens to view it as. And if you view it from this lens, there's a particular set of things you care about. You care about stable coins, you care about RWAs, you care about on-chain treasuries, you care about secure wallets and private payments. But this talk is going to be really weird, right? So it's going to be about an entirely different lens to view Ethereum through. A lens that is not really about moving our existing world on chain to make it more fair and more global and efficient. Instead, it's a lens about creating a totally new and weird world, which is quite different from what we have today. And a future that's like super weird and interesting, but something we can enable with Ethereum. We're going to talk about Ethereum as a way to make people treat digital objects as if they were real. If you think of the prompt that Bitcoin was able to birth digital coins that people treat like a real valuable coin, the prompt today is going to be, can we use Ethereum to 100x this and birth digital planets that people treat like real valuable planets? And to sort of draw an analogy that we can play with, if we think Bitcoin has scarce coins, we can think a digital planet might have scarce crops, scarce wood, scarce ores, scarce land. If we think Bitcoin has tamper-proof IOUs, you may think a digital planet has tamper-proof physics. Just like having lots of scarce Bitcoin grants you power in Bitcoin's world, controlling lots of the scarce matter grants you power on a digital planet. If you sort of just visualize it, imagine that if you want to go somewhere far, because you want to mine a valuable resource there, you're going to need a lot of food. So you can sort of re-energize yourself and get there. So if someone is going to farm crops and you have scarce crops, that's valuable and you can create markets with it. And if we do another thought exercise, just to get really weird here, if you think that Bitcoin on AWS, it could only be worth so much, right? But if you put Bitcoin with true scarcity and tamper-proof rules, because you use blockchains, it can be worth a trillion dollars. So likewise, if you have sort of digital wood on AWS, it can be worth nothing. But if you have digital wood with true scarcity and tamper-proof rules, I don't know, can you have digital wood that's worth a million dollars? And there's already like, there's a bit of a meme about this sort of in the community we're from, about digital sakura that takes a year to grow and you can build really cool things with it being like super valuable. And to make things concrete and not as sort of abstract as they are, we're going to use biomes as a case study. On the surface, biomes is basically just Minecraft with everything on chain. This is possible for the first time ever because of recent advances in scaling. This means everything is on chain. All the items are on chain. The players are on chain. Every action the player takes, like that, like building and jumping and moving, all of it is on-chain. And recently, Biomes has started to see a lot of traction. Funny enough, there's sort of the chain that was being talked about in the last talk, that chain is sometimes in top five in Rollup.Wtf, which is the chain Biomes runs on. One of the community members has said Biomes feels like Ethereum but more playful. There's people who spend hours and hours a day building stuff in Biomes. People who spend eight hours plus hours a day sort of mining stuff. So Biomes has really been getting a life of its own recently. And we're going to ask and we're going to dig deep on why this is happening and why people are excited about biomes. Think of it like biomes is a digital planet the same way Bitcoin is a digital coin and you have provably scarce matter. There's only so much coal, there's only so much ores, there's only so many crops, only so much wood, and you have tamper-proof physics. Similar to how folks use smart contracts to build on top of Ethereum, folks use smart items to build real economies on top of biomes. Smart items are just items with functionality in the world that you can program with a smart contract. So imagine you have a chest. In a chest, you can put stuff inside, you can take stuff out. Imagine I put a smart contract inside of the chest, and I program it with Uniswap. So every time someone mines an ore and puts the ore inside of the chest, they get some amount of token. Or I can put the token inside and get some amount of the ore, and all the prices are set by AMM pricing, just the way they would be in a DeFi protocol. And you can sort of imagine this for a ton of things. You could imagine a door inside of the world that is a literal token gate. The door checks if you have a token, and if you do, it lets you open it and get through, right? So you're taking Ethereum, and you're giving it the Homer Simpson treatment. If you told like some random person what is a token gate, this is what they would think it is. It's a gate that you need a token to open. You have a force field that can protect lands and you can program with a smart contract to determine who's allowed to build and mine inside. So yeah, smart items are just like physical smart contracts. And already a lot of really cool things have been built inside biomes with this stuff. The Bazaar is basically our version of Uniswap. It's a large mall with chess shops for all types of objects, and it prices everything according to the Uniswap AMM formula. And there's another group of players who right beside our building created this thing called WozSwap. And basically, it's the sushi swap of biomes, right? They're trying to vampire attack the bazaar with like different pricing. So you can kind of see the same kind of like emergence you see in DeFi happening inside of this virtual world. You have the Sakura Temple. So Sakura wood is wood that takes a year to grow and it's a bit of a meme in the community. So you have a group of players who have built this big temple where they program the chest such that if you donate Sakura to it it gives you a membership NFT. And they're probably going to get all of their future meme community events with this NFT. And they're going to use all of their future meme community events with this NFT. And they're going to use all of the donated Sakura to build the largest Sakura tree in the world. You have the Castle Hotel and Sakura Inn, which are hotels with beds inside, and they're going to make it so you can keep your players safe and not be griefed when you're logged out. And of course, you've got to pay rent to stay in these hotels. The Pyramid Arena will host a bunch of duels in the future, have a bunch of betting markets around all these duels and prize pools. The Parkour Challenge, it's this really hard challenge where if you complete it at the very top, you can sort of mint an NFT. And this NFT will grant you access to more difficult parkcore challenges in the future. So, you can already see how smart items are literally the smart contracts of biomes, and people are building physical dApps inside of the world. So, with scarce matter, tamper-proof physics, and smart items, a crazy new asset class and economy is now being born inside biomes. Imagine a force- field protected gold reserve. Imagine you have a chest where you go around this Minecraft world and you mine for gold, and gold ore is scarce and hard to find. You get this gold and you put it in the chest, and the chest mints you a coin. If you put the coin back, it burns the coin and gives you gold ore. So now you have a coin that is backed one-to-one with the scarce gold ores in the world. And every time you do this, it takes a small fee and gives it to players that reinforce the force field that is protecting this chest from being stolen and broken into. In this case, what you see is if this coin rises in price, let's say this coin gets enough mindshare and enough excitement and enough utility in the world that it reaches even the 10 million market cap, it becomes extremely and viscerally obvious why you need the gold scarcity to be provable. Because if I as the dev of the world can arbitrarily mint myself more gold ores, I can just go to the chest and mint myself more coins, right? And then that just breaks all of the functionality of the coin. It also makes it super clear why the physics needs to be tamper proof because if I change the physics, I can make the force fields really easy to break. And then I as a dev can just go to this bank reserve and just break the force field, steal all the gold ores, and that token is going to go to zero. So as soon as you have this new asset class that's extremely weird, an asset class that's born in the physics of a virtual world, as soon as you have that asset class take off, it sort of just carries the virtual world forward. You know why all the origin to be scarce, all the physics need to be tamper proof. And it's just a massive narrative violation where the virtual world now just instantly becomes super significant. To sort of give another example, you can think of like an old asset class, which was, I don't know if anyone's aware of like the entire NFT metaverse land movement that happened a couple years ago. That's kind of, you know, that's really failed. But basically in that movement, you could own and trade land NFTs. And if you had one of these NFTs, you would have total forever ownership of that land. And this was really good for a specific crowd of people, the crowd of people that were into hyper-rational financial speculation, right? I can buy this real estate because I think it's going to be worth more in the future, and you have Snoop Dogg buying land. But in this new asset class, it looks very different. If you want to protect land, you have to build a military. Now, this military can tokenize a land they're protecting and sell it to people and say, oh, come build in this land and we'll make sure only you can access it. But that token is only worth anything as long as the military is still active. If I come back in eight months and that military has been broken down, the token they sold can't really do anything, right? So this is a very different type of economy where players have to actually grow and maintain a digital military to maintain the value of the assets they have just sold. And anytime you have a thing, you kind of see this in crypto all the time with whether it's been DeFi or NFTs or meme coins, when you have a different asset class with a completely different set of rules, it invites a different type of participation and you start to appeal to a different set of users. So yeah, we think a crazy new asset class, which is enabled by digital matter and smart items, is slowly unlocking biomes and soon we think these sort of concepts are what will unlock autonomous worlds broadly. The crazy new asset class enabled by digital matter and smart items. This is a statement. Now you know we have some time because I think they allocated too much time to me for this talk so we're gonna go a bit crazy",
  "eventId": "devcon-7",
  "slot_start": 1731494400000,
  "slot_end": 1731496200000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/15oxvM3TxOCUK4NDmYqvX1h3RKEylrnyt66ZdyLe_RR0",
  "resources_slides": null,
  "speakers": [
    "dhrumil-shah"
  ]
}