{
  "id": "for-the-kingdom-mud-day-demo",
  "sourceId": "FM3LCK",
  "title": "For The Kingdom - MUD Day Demo",
  "description": "This is a project demo as part of the MUD Day CLS: autonomous worlds, onchain games, and non-financial applications.\r\n\r\nFor The Kingdom (https://forthekingdom.xyz/) is a web-based MMORPG featuring a player-driven economy and worldbuilding, empowering players to be anyone they want to be.\r\n\r\nThe game is fully onchain, and currently live on the Redstone Garnet Testnet, using the MUD framework.",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Autonomous World",
    "Gaming"
  ],
  "keywords": [
    "fully",
    "onchain",
    "game"
  ],
  "duration": 350,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "PRVgtqUH6_U",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735897b9dbb7a90e1550f24",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735897b9dbb7a90e1550f24.vtt",
  "transcript_text": " Translator's note Trinh will be demoing For The Kingdom, a browser-based RPG currently on testnet. Hello, okay, thanks guys. So yeah, super great, presenting our game right after E-Frontier, like just super. So okay, hi everyone. Thanks a lot for joining. My name is Tuyen, I'm the founder of Constant Maker Studio, and we're making a fully on-chain game called For the Kingdom. So For the Kingdom is an MMO that aims to become a community-owned world with a player-driven economy and world-building that empowers players to be anyone they want to be. Okay, so can you repeat the video for me? Thanks a lot. Okay, so our vision is to craft an expansive and persistent game world where players can freely experience it and take an active role in shaping the game's values. The core gameplay loop begins by first dropping you into a vast open world where you can explore and fight monsters for valuable materials, for other players to steal their items, or simply lead a peaceful life by chopping away some woods. The true goal of the game is becoming the best at what you do and contribute the most to your kingdom. Imagine you're the best blacksmith in the whole game, and only you can craft the most powerful weapon. It means your kingdom's warriors have an edge over their opponents, or you can even sell your weapons to other kingdoms as well for a profit. And so here I'll show you the first three minutes of our game via a recording, but you can definitely already play the game, even on your smartphone. So the first thing you do is to choose one of four available kingdoms and start building your character. So you can see here that that's basically me creating a character called Defcon for the win. I'll be able to customize the character's story by answering some of the random questions about the character's childhood or their personality. Your choices here determine your character's starting stats, like choosing that you stole a trinket from a rich woman when you were 10 will get you a boost in agility. The first thing you do in the game is claim a welcome package where you'll get all of the beginner items necessary to start to create, you know, doing anything. We have like some text to support onboarding but I'll just, you know, like skip it to get to the fun part. So right after that, the next thing you can do is to basically go into your character profile and equip a weapon so that you can prevent yourself from punching some monsters barehanded. So the next thing you can do is to browse some available quest lines. We have daily quests as well as story lines that you can explore through Kingdom specifics. Next up, you can move from your starting point to different parts of the map. Like here I'm moving to a grassland outside of my starting city. Moving right now kind of cost 15 seconds to compensate that right now we don't have an, like, you know, a zoom in map or an Intel map like DOFUS or ROCFU yet, but we'll get there sometime. You can see during that time that I've also equipped a battle skill. Next, you'll be able to engage in PvE in each tile. Like right now, I'm fighting a slime enemy. As the game is an auto battle and fully on chain, it means that right now the outcome is deterministic and the result of the battle is already decided once you click on the button. But the animation here is kind of like a good representation. Here you can also engage in PvP with different players in this game. For example, I can challenge literally the best player right now. And probably we'll get decimated in one move. Yep, that's because Soulmate or like Dudendi, I think that he's here. Thanks a lot for coming. Like you know, he is stoked with very, the map is right now very huge. And the main goal of this demo, basically, is to defeat Ignis, our first raid boss. It's a powerful dragon that can drop the best loot right now once defeated. So battling monsters, bosses, and, you know, farming resources will enable you to craft various items to get stronger. In the future, these items can be tokenized and sold to other players that cannot craft them. So, that's our demo. I'm just going to skip to... I have like five seconds left. I can't like, you know, can you change the, I mean, yeah, somehow I can't change it to, to the next slide. Like, can you manually change, like, you know, I don't have enough time yet. So if you can like, you know, go to the last slide. It's OK. Just five seconds on this. This is what we've been doing for the next build as well. We'll add more co-op features and basically a card demo game that we kind of stolen from Final Fantasy right now. And yeah, just can you move on to the last slide, please? So yeah, thank you, guys. The game is playable right now. And yeah, just can you move on to the last slide, please? So yeah, thank you, guys. The game is playable right now. Cross your eyes on mobile.",
  "eventId": "devcon-7",
  "slot_start": 1731556800000,
  "slot_end": 1731557100000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/19JLbZ-yVksBM4TM3ftOIccuAC6UgKAKtM0nVGAdWdQ4",
  "resources_slides": null,
  "speakers": [
    "tuyen-dinh"
  ]
}