{
  "id": "from-concept-to-reality-the-triumph-of-blockchain-in-vaccine-distribution",
  "sourceId": "ZBC9ZM",
  "title": "From Concept to Reality: The Triumph of Blockchain in Vaccine Distribution",
  "description": "Join us for an inspiring session that explores the transformative power of blockchain in vaccine supply chains. Learn how we achieved country-wide deployments in Bangladesh and Costa Rica, enhancing transparency, traceability, and efficiency. Discover the real-world challenges we overcame, the innovative solutions implemented, and the remarkable impact on public health logistics, setting new standards for supply chain management and ensuring the safe delivery of vaccines globally.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Business",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Sustainability",
    "Ethereum for Good",
    "Public good",
    "real-world",
    "deployment",
    "Ethereum for Good",
    "Public good",
    "Sustainability"
  ],
  "keywords": [
    "Real-World",
    "Deployment"
  ],
  "duration": 974,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "0dSz0CN6bI8",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67333a7b3a168eb535edc345.vtt",
  "transcript_text": " All right. Thank you for that. It's one of the last talks of the day. We don't have much time, so I hope it will be a good one for you guys. Yeah, so my name is Arun. I work with UNICEF. I'm the blockchain lead at the ventures team within the UNICEF Office of Innovation, and we are here to chat with one of our portfolio companies, Statwick, around the supply chain solution that they have worked on and the impact they are creating, along with a partner of ours on how to get these open source digital public goods funded. May I ask you guys to quickly introduce yourselves, starting with Mansi? focused on enhancing the transparency and efficiency in the global health public supply chain. What we essentially do is help stakeholders keep a track of all their transactions and give end-to-end visibility in the supply chains. Thank you, and thank you both for the invitation today. David Casey here, Director of Funding the Commons. Funding the Commons is a community and event series focused around exploring public goods funding mechanisms. And we do conferences, hackathons, open source developer residencies. We just completed one in Chiang Mai last month. And public goods funding experiments, so applied experiments using new mechanisms. So in case you're wondering what a UNICEF person is doing here, so we have been working with blockchain since 2015. We run something called the UNICEF Venture Fund, where we provide funding for early-stage startups, such as StatWig that Mansi is working for, and we are also interested in digital public goods. We are part of the Digital Public Goods Alliance, and that's how we got to know David. So hence, here I am. First question to Mansi. Could you please maybe talk a bit of the product around the vaccine supply chains, please? Yeah. So I think the problem, the challenge that we were looking at was twofold. So the first initial issue was around how these supply chains are fragmented and specifically in the healthcare systems, how they rely on siloed information which do not talk to each other. The other issue was also around product wastage in terms of expiry, counterfeiting and cold chain failures. So this was like the primary agenda that we wanted to solve firsthand and have a unified platform. So that is where we've built a solution called Vaccine Ledger, which typically ensures that every physical asset in the supply chain, we create a digital twin of that. And so from how that works is that from the time of procurement or from the point of manufacturing, and every time the product changes hands we basically record the journey of products as and how it is passing on so we help ensure that you know all these stakeholders are completely aware of where the product is in supply chain right now yeah and and we did we did also have like issues looking around how 30 percent of the global vaccines were wasted. And there was lack of information even within many organizations who were sending out products to various LMIC countries, but there was lack of visibility whether it's reaching the final beneficiaries or not. So it becomes very important and critical to ensure that the life-saving vaccines and medicines reach to those people, especially in the under-deserved areas. And that's how I think what we're trying to do is leverage blockchain and provide the whole data in real time for every stakeholder to make informed decision. That's fantastic. So blockchain here is, of course, used to track every vial of the vaccine, I think which adds a next layer of traceability and you know visibility which all the stakeholders get. And talking of stakeholders, where have you piloted the solution so far? Yeah, so we've had a couple of deployments. So we had it both on the private side also and on the public. So we did a couple of deployments in Costa Rica. We had partnership with IDB, Inter-American Development Bank, who actually opened doors for us to help track products within that market. So the major issue at hand was that once the manufacturers send the product, they only have visibility till Panama. And after which there's like complete lack of understanding of how is the product moving in the country. So we did make a deployment there. And even during COVID, we were able to like track a million doses of COVID-19 vaccines and also the end beneficiaries who were receiving it. And we did have another department, which",
  "eventId": "devcon-7",
  "slot_start": 1731409200000,
  "slot_end": 1731410400000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1yuhgDizD0e2BcBSAmT-nwGyHIS4gNNqFjMZbvO34IPc",
  "resources_slides": null,
  "speakers": [
    "david-casey",
    "arun-maharajan",
    "mansi"
  ]
}