{
  "id": "giga-staking-for-school-connectivity",
  "sourceId": "ZU3AEJ",
  "title": "Giga: Staking for school connectivity",
  "description": "Giga is a joint venture between UNICEF and the ITU with the mission of connecting all the world's schools to the internet. Over the past years, a novel approach to fund the ongoing operating expenses of school connectivity has been running as a pilot in Rwanda and Giga is currently scaling up operations.\r\n\r\nAs part of this pilot, one staking node has been generating returns that are being spent on connectivity in a school in Rwanda. All of this has been done in compliance with local regulations.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Staking",
    "Sustainability",
    "Ethereum for Good",
    "Social",
    "impact",
    "Ethereum for Good",
    "Staking",
    "Sustainability"
  ],
  "keywords": [
    "connectivity",
    "schools",
    "social impact"
  ],
  "duration": 472,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "nqe0zeu_z7w",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735c98d9dbb7a90e17afef8",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735c98d9dbb7a90e17afef8.vtt",
  "transcript_text": " Hello everybody. Can you guys hear me well? Good. Thanks to the organizers for putting me right after Chris. It saves me a lot of introduction for what Giga is and does. A quick summary. So we're a project about connecting every school in the world to the internet and every young person to information, opportunity, and choice. A little bit of a summary of what we've achieved so far. We've connected about 14,500 schools benefiting almost 8 million students. And we're currently active in 34 countries. So it's a big operation. One of the opportunities that we found, one of the challenges that we have, is in once a school is connected, to fund the operational expenses of the school. So we're kind of looking for a sustainable financing model. And one of the projects that we've looked into is around staking. So I thought it'd be interesting to talk to a crowd that's very familiar with staking and talk a little bit about the challenges that we faced in implementing this in the real world. So what we want to do is we want to create staking nodes and use the staking rewards to pay for the operational expenses of Internet connectivity. So it's kind of like an endowment. A little bit about the size of the opportunity or challenge that we have. We did a case study a few years ago where we looked at what it would cost to connect the 86,000 schools in the 17 countries that we were active in at the time. And we discovered that it would cost approximately $305 million in operational expenses. So it's a very significant problem that we're looking to solve for. But the benefits also speak for themselves. So with sustainable funding, about 25.5 million students and teachers will be able to benefit from connectivity. What we've done so far is we started with setting up a staking node and loading it up with 32 ETH. So you can look at the validator node there. And what we are using this funding for is to pay for connectivity for one particular school, the Murama Primary School in Rwanda. So about 1,000 students in Rwanda are benefiting from this connectivity at the moment. But we ran into some problems. So currently we have to jump through all kinds of regulatory hoops in making this system work. So we have to off-ramp the ETH into fiat, then the ISP needs to send a paper invoice to a company that pays this invoice, and then the school needs to be connected. So you kind of lose track of the payment process in that way. And it's something that we feel hinders the scalability of this a lot. So there's no problem in sort of paying for one staking node ourselves and connecting one school, but doing this for all the remaining schools becomes a problem for impact investors if you can't prove the impact. So this is where we are. We have completed this pilot and we want to scale. But we're currently sort of stuck in the middle where we're trying to set ourselves up for success. One of the things that we need to do for that is create an end-to-end crypto flow in cooperation with the central bank of Rwanda. And we have a pathway for doing that. And the second is to set up a pooled impact staking product. But I'm here today with a super specific call to action. And Vivian, I might ask you where that group of African community was gathered. But we're essentially looking today for a crypto company based in Rwanda who could join us in this regulatory sandbox of the central bank and help us make this more scalable going forward. I'll leave a few minutes for questions. Thank you. Do we have anyone from Rwanda here? We're not here. Nobody. It's okay. We have the whole hub. Okay. We have one person here, one, I think, over there. Let's start with this gentleman with the white shirt. Yes. I've got a crypto company in Rwanda. I'll talk to you after. Oh, good. I told you it would work. So I'm from Myanmar, and we are having all kinds of crisis. Can you speak up a little bit? Yeah. So I'm from Myanmar, and in Myanmar, there are a all kinds of crisis so is there can you speak up a little yeah so I'm from Myanmar and in Myanmar there are a lot of civil wars going on and we the schools needs a lot of this internet connectivity issue so the first challenge is that not only the internet connectivity but also we only got around six hours seven hours electricity a year. So in that kind of scenario, will the GIGR infrastructure will be work? Or that's the first question. And second is, will there be a future plan to come to Myanmar to support this kind of internet infrastructure development? Yeah. So this particular project was really about raising the money to pay for operational expenses. There's of course this whole infrastructure question and electricity providing question that also needs to be solved for, which is part of a bigger problem, I suppose. We do intend to see if this solution will scale on a global level. So far, we've always hit this regulatory glass ceiling in this solution. So we are quite excited to be working with the central bank in Rwanda in trying to break that glass ceiling for this particular use case, and then hopefully using that as a pilot study to show central banks that there is an opportunity in this space in other countries as well I think for the Robonert they already have you know support of the central bank but in Myanmar the central bank and all kinds of financial transactions are always checked by this dictator military so I think this will be not happen in like next a few years I believe. Yeah Myanmar sounds like a very complicated situation I agree with that. Thanks for raising the question. Any other question? We have time for one last question. One over there. So I'm from Kenya, and I really appreciate the work that you are doing with Chris. So my question would be in terms of locating, for example, the institutions, you had mentioned that you have an ML model that helps you identify what is a school and what is not a school. Is that model available for use to other use cases? So are you working agriculture identity for farmers? I mean, the answer is yes. It will probably have to be a different model. But we do have a data team that looks into that. And I don't know if you mentioned it. Did you mention that we're also doing hospitals and health centers? Or am I spoiling something? Yeah, so we're also branching out into other public infrastructure, like hospitals and health centers. Okay, Luc, for you afterwards. Thank you. And thank you, Gerben. Thank you, Giga team. That was a lovely half an hour. Okay, that's another round of applause.",
  "eventId": "devcon-7",
  "slot_start": 1731577200000,
  "slot_end": 1731577800000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1rmmBw3SZZEyNNDi7PgdUEMlN6Wfogmt3EIpC8WZe-5I",
  "resources_slides": null,
  "speakers": [
    "gerben-kijne"
  ]
}