{
  "id": "governance-innovation-analysis-on-voter-behavior-in-blockchain-governance",
  "sourceId": "ZKNSAL",
  "title": "Governance Innovation: Analysis on Voter Behavior in Blockchain Governance",
  "description": "As the first comprehensive examination of voter behavior in Web3, the following research explores two significant blockchain ecosystems, Curve Finance and Polkadot, using a novel quantitative methodology to decompose and highlight governance patterns.\r\n\r\nThe presented analysis shows, among other findings, a significant influence of market conditions on voter tendencies, diverse patterns relating to voting power accumulation, and a potential effect of financial incentives on voter participation.",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Expert",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Permissionless",
    "Coordination",
    "Governance",
    "Decentralization",
    "Game Theory",
    "Tokenomics",
    "voting",
    "analytics",
    "Coordination",
    "Decentralization",
    "Game Theory",
    "Governance",
    "Permissionless",
    "Tokenomics"
  ],
  "keywords": [
    "Vote Escrow",
    "Funding Allocation",
    "Voter Analytics"
  ],
  "duration": 535,
  "language": "en",
  "sources_swarmHash": "8a6871d32bd8b80aedb0c02d15838b45bb8315fb3f851587e4f2362a09ca2690",
  "sources_youtubeId": "wLw9Xvigdqs",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673476c59dbb7a90e1392576.vtt",
  "transcript_text": " Hello, everyone. Thank you so much for taking the time to join in. In this specific talk, we're going to cover about governance, and it will assume that you have a basic understanding of governance already. Another thing that this talk is going to do is drop a lot of QR codes because there's quite a few innovations I want to cover so you can go apply it in your worlds and the QR codes will help you dive deep into specific topics that you want to dive deep into. Let's start with innovation number one and this is so often like overlooked. Let's face it, right? Be it grants, be it governance, be it decision-making, the voter's perception is at the end of the day, your reality. And the user experience and governance is an area of innovation that's not very much focused on. This is where we have an interesting product we just launched, which kind of shows you how you can delegate in one of the simplest user experiences possible. You can select the percentage that you want to delegate. You exactly know what's your voting power going to look like, and then you delegate. And that's simple. And this is one area where we're trying to make user experience as less fragmented as possible. And if you'd like to read more about the thinking, the transparency, the ethos, the on-chain activities that went into designing a governance hub, I highly recommend scanning the QR code and jumping into it. Now, let's talk about not just the user experience. Let's go a little bit deeper, right? We did a research on how exactly voter behavior works out. We took two vote escrow systems. One, we took Polkadot. The other, we took Curve. Both of them require you to lock in your tokens and in return, you get a certain voting power. That voting power is decayed over a period of time. But there's one fundamental difference. Curve has a financial incentive mechanism to it. Every Thursday, you use your VE Curve tokens and you get APYs based on how the treasury allocates funds. Polkadot not necessarily has financial incentives attached to it. Now, you will see some very interesting insights. So in Curve, 65% of Curve is logged as Vcurve. And out of the 65% that's logged, an average of 38% is used for voting. What do you think that number would look like for Polkadot, one that doesn't have financial incentives? Well, 54% is locked in multiple Polkadot lockers. And it's, you know, a shockingly low 0.11% that's used for voting. And you can see how financial incentives play out a huge role in possibly this disparity. Let's go a bit deeper into another data point. In Curve, the maximum lockup period is four years. 67% of them actually do lock up for that long on an average. What do you think it's for Polkadot? A similar vote escrow system. It's again a shocking 4% locking up for a maximum duration of 224 days. What is the other sign you see is that this behavior, perhaps the underlying assumption is the financial incentives and how the whole incentive governance mechanism is playing out together. We also went deeper. We said, who are these voters that are locking in longer? Are these whales? Are these large token holders? We found a very interesting insight both in Curve and Polkadot where 93% of whales and 98% of sharks tend to lock up for 14 days or less. They tend to enjoy a sense of fluidity. They tend to enjoy a sense of flexibility with their lockup tokens. We saw shrimps, on the other hand, locking up much longer. And when you design your governance system, this is going to play a key role. Who are your token holders? What's their demographics? How are you going to design your lockups? And who's likely going to lock up for longer? It's going to play a pretty huge role in the way you design that. For more on the governance research paper, it's full of insights. You have that QR code, feel free to scan it. This is one of my favorites, good governance is obvious, but great governance is transparent. So many, like over the last three years of being in governance, I've had multiple people tell me, I don't understand what to vote. And who's keeping track of what to vote? Well, we've introduced something called as transparency reports, where every multi-isig that's apparently taking decision is supposed to put out their rationale behind it. And so you can read a transparency report. It's designed for even non-technical folks to really understand what's happening and exit the system if you choose that that upgrade is not safe for you or one that you don't like. Almost every governance team I work in, this is a mandatory introduction and we made it very easy for folks to generate a transparency report. My time's up, but you can read more about transparency reports as well. What I'm going to do is I'm just going to jump through the final one, which is the conditional voting power, DK. So the concept's really simple. Your voting power DKs with time but based on your participation and there's an interesting research on that as well. But yes, thank you so much everyone for taking the time and I hope this helps. All right, so... Okay, so... Do we have any questions for Tanisha? We can do maybe a round of passing the mic if anyone has questions. Yeah, we do have one over there. We do have one question at the back. Yeah. Hello. Do you mention the difference between Polkadot and Curve? And how Curve has, like, higher votes just because of the rewards or, like, incentives? What sort of incentives are at play in there, or what incentives you think might make sense for most DAOs? That's a great question. It depends on what the DAO focuses on. There isn't like a one-size-fits-all answer. So if it's like Curve or any DAO that's focusing on liquidity, having APYs for staking that's combined with governance where you have like an underlying staking mechanism with vote escrow and giving APIs for that crypto economic guarantees makes a lot of sense. But for DAOs that's not focusing on staking and focusing on engagement, having very interesting ways of distributing funds based on the level of engagement like for a gaming DAO makes a lot more sense than just vote escrow or staking. So it's really what the DAO is seeking at the end of the day. All right, thank you. And actually, Tanisha, here's a live question. What do you use to gather this data? It's mostly on chain in the sense that a lot of these data points are already there. So when your Curve and Polkadot already have it on chain. So you take all the wallet addresses. We used Arkham data to also identify some of these wallets and who they belong to, to measure the level of centralization. We used Arkham data to also identify some of these wallets and who they belong to, to measure the level of centralization. But I hope that answered your question. Hi. My question is more maybe on privacy and still managing engagement. Do you see valuable like using TK for enhancing privacy in managing the proposal and still giving the confidence of user that will not be blackfired maybe for any exposure? Yeah, that's a great question. So maybe not in proposal creation. I think privacy is, in my opinion, best suited to delegations. So I was talking about this to somebody yesterday. Let's say that I delegate to you and I want to undelegate, right?",
  "eventId": "devcon-7",
  "slot_start": 1731489000000,
  "slot_end": 1731489600000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1hyhPIjZoL4CayjCbBks0Dvhf-v1OSKN0dKkek0vNdSE",
  "resources_slides": null,
  "speakers": [
    "tanisha-katara"
  ]
}