{
  "id": "growing-the-biomes-gdp-using-digital-matter-and-smart-items",
  "sourceId": "AZCYRS",
  "title": "Growing The Biomes GDP Using Digital Matter & Smart Items",
  "description": "Biomes is growing the virtual world with the largest GDP. As a fully onchain 3D voxel world, every single action in Biomes -- mining, building, crafting, even moving -- is a transaction on the Redstone L2. \r\n\r\nWe will share stories how we're working to grow the GDP of Biomes, what is working and what isn't. We will also share examples and ideas for onchain smart items in the Biomes world enabled by smart contracts.",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Gaming",
    "Autonomous World",
    "Autonomous World",
    "Gaming"
  ],
  "keywords": [],
  "duration": 1275,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "Y5VCidGZgJo",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735ac844ccb22799e395271",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735ac844ccb22799e395271.vtt",
  "transcript_text": " Hello, I'm Dhrumil. I work on biomes. Biomes you probably played in the gaming corner over there or maybe you saw the demo earlier in the morning. You can also just go in biomes.aw and actually play it. So today we're going to talk about growing the biomes GDP, which is the primary thing we're trying to prove out with biomes, and two things we want to use to try and achieve those goals. Before we start, we're going to take just like a minute to think about why we're doing this. Most people who view Ethereum, they view it as an open financial system. If you view it this way, you care about a particular set of things. You care about stable coins, coins, RWAs, treasuries, wallets, and payments. But this is kind of the weird room. That's why it's in a classroom. And it's a bit of a different scene. It's not interested in moving our existing world on chain. Rather, it's interested in trying to uncover a totally new and weird future that's very different from the world that exists today. And if I was going to sum up the core question that's being asked in this room, okay, I think people probably will have a problem with me speaking on behalf of the room, but I will do it. If Bitcoin was able to birth digital coins that people treat like real valuable coins, can we basically 100x this and birth a digital planet that people treat like a real planet? And I think the short answer is that I think we can. And I think it actually might end up being much more simple and obvious than we might have thought before. There might be a line of sight to this. I think what we should just do is we should take ideas that already work, and we should just reshape them, right? We should reshape them from being built for finance and just make them work with virtual worlds, right? So we've got to take the idea of scarce digital coins and convert that to scarce digital matter. We've got to take tamper-proof IOUs and turn that into tamper-proof physics, and we've got to take smart contracts and turn that into smart items. And that's basically what this talk will be about. And we're going to actually make this concrete with examples of us trying to do this within biomes. And I hope that makes this much more legible. And the claim with those three pieces, the claim is that the digital matter and smart items can birth a crazy new asset class, the weirdest asset class the world has seen. And that, if it gets mindshared, will unlock autonomous worlds. It'll make them super obvious, super visceral, and you'll never have to answer the question of why you put this on chain. So to make things, let's look at biomes. On the surface, biomes is just Minecraft with everything on chain. You can, you've probably tried it out. The items, players, physics, all the actions, you can see it move and mine and build. It's all on chain. You know, right now there's like client optimization thing going on to make this work. Sometimes there'll be bugs. But, you know, I think you've got to press your T dot wherever you find them to make Cori go mainnet faster. And then this will not happen. And what's been happening with biomes ever since we have sort of been in our alpha phase the last month is it's coming alive, the world is coming alive, there's a lot more activity, we're sort of seeing it go. The transactions are up and to the right, you know, the players up and to the right, GDP up and to the right, everything bullish. There's people like Ben who are spending five hours building something, Deki spending eight hours plus days mining stuff. You know, so people are doing stuff. Redstone is like sometimes in the top five change in rope.wtf, which is really funny considering this like barely ever hits 15 concurrent players, right? And Ditto is a community member who made this grand claim that BAMS feels like Ethereum but more playful. And so what we're going to do today is we're going to go down the rabbit hole. Why are people so excited? On the surface, it just looks like on-chain Minecraft. Why are we even doing this, right? The first concept is digital matter, the thing we brought up in the beginning. Think of digital matter as a playful vision of blockchain-created scarcity. So while in Bitcoin, you have scarce coins, in biomes, you have scarce crops and wood and ore and land, and in Bitcoin, you have tamper-proof IOUs, in biomes, you have tamper-proof physics. And what this means is, if there is a tree, I can't just snap my fingers and mint more trees arbitrarily. The only way for there to be more trees is if I farm it according to the physics, right? So there's always like, wood is actually valuable. And if you do like the weird thought experiment, you might be like, if Bitcoin was an AWS, it could only be worth so much. But Bitcoin with scarcity and tamper-proof rules could be worth a trillion dollars. And if you go a bit crazy, why can't the same happen with digital wood, right? You have like Ben, who's maybe thinks one sakura wood will be worth $31,000. So like, this can happen, this can happen, just you just need to believe, right? And just like having lots of scarce Bitcoin grants you power in Bitcoin's world, controlling lots of the scarce resources and land lets you build businesses and be effective in the biomes world. The second thing we're going to look at is smart items. So we've got digital matter. Now we're going to look at smart items. Smart items present a playful vision of smart contracts. You can think of them as items with functionality in the physics that you can program with a smart contract. They make it really easy for players to build real economies for anything in the world. To visualize it, think of a smart contract as a chip. And you can insert a chip into an item, like a chest, to program it. So if I have my Uniswap chip and I put it into a chest, it turns into a Uniswap chest. And at this point, if people mine ores around the world, they can put ores in the chest and swap it for some tokens according to the AMM prices. Or they can give tokens to the chest and get ores according to AMM set prices. And you can sort of take this concept and basically apply it to all the kinds of different objects in the world. You can imagine I have a door and I turn it into a token gate, right? I need the token to actually open it. So what you just did here is you like gave the Holmeson treatment to Ethereum where if you told Homer Simpson what is a token gate, that's what he would think it is, right? And so now you're taking all of these smart contract track patterns and you're just making them much more relatable for a more normal audience. So you can turn a door into a token gate, a force field, a cart, a bed. And with all of these items, you can build a lot of cool stuff. And these are all real examples of things that are already being built within biomes. The Bazaar is the biomes version of Uniswap. It's like this shop with a lot of liquidity where you can trade all kinds of items for coins. The funny thing is as soon as we made the Bazaar, there's this existing other group that put up a really crappy shop next to it, relatively. And it's like the sushi swap of biomes, right? And it's trying to vampire attack the bazaar and take all the liquidity. You also have like Sakura Temple where there's this like big, big temple where you donate Sakura wood to get this membership NFT. They use all that wood to build the largest Sakura tree in the world and all future Sakura meme events that happen will probably gate access based on whether you donated the Sakura tree and got the NFT. The Castle Hotel Sakura Inn, they give you safe spaces to sleep and recharge your player and load without worrying about getting grieved. And in return, you just sort of have to pay rent. The Pyramid Arena and Parkour Challenge are going to host a bunch of games, and these games will use smart items to have betting and prize pools and everything. So in a way, you can basically think of these as like deploying dApps inside of a virtual world, right? And third, if you have Digital Matter and you have smart items, you have a new asset class. And I think it will be the craziest asset class that crypto has ever seen, maybe the world has ever seen. And I think when that asset class gets mindshare is when we no longer have a classroom and we have a building. So to sort of imagine a chest, right? And I can program a chest with a smart contract. Imagine I program it such that when a player gets gold ore from the world, which is scarce, and they put it in, it mints a coin. Right? So now you have a coin that is backed by the actual gold in the virtual world. And if I put the coin in, it burns the coin and lets me take out a gold ore. And every time this happens, the chest takes a small fee, and it uses that fee to incentivize players to charge the force field and defense of the chest to make sure it cannot be broken in. If this coin rises in price, let's say it's even worth like 10 million or something, it becomes extremely, extremely obvious why all the gold ores need to be provably scarce. Because if I just mint more gold ores with a thin air, I can just put them in the chest and mint more coins for myself. So it's really obvious why you don't want, you know, you need the gold ores to be scarce and you don't want the devs to just randomly mint more. It's also really obvious why the physics needs to be on chain. Because if I change the physics such that it becomes super easy to break the force field, I can now come in and steal all the gold ores from within the chest, and now that coin that was backed by the gold ores is no longer backed by anything, and it's just gonna plummet. So if you have this asset class take off, it's super, super obvious why the actual physics and research of the world are significant. To do one more example, we can kind of imagine how in the 2021 like crazy bull cycle, there was this idea of NFT land, right? So basically in the sandbox and Decentraland, you could own and trade land NFTs. And if you held one of these NFTs, you had total forever land ownership of that land. And this was really good for a particular type of user that you can have hyper-rational financial markets and speculation on those NFTs. Because if I buy a land NFT, I forever own that land. So I can speculate on it and trade these NFTs eight months down the line. It'd be totally okay. You do that in biomes, right? If you want to control land in biomes, you need to build defenses. You need a military, you need force field. The military can now decide that, okay, us military are protecting this land. We're going to tokenize this land and sell it to you. And if you hold this token, you're allowed to come and build within our premises knowing that everything will be secure. Let's say I buy this token, I come back in four months and that military is just dead, all the defenses are broken. Now this token doesn't mean anything. Even if I hold this token, I don't actually have access to any land, right? So now you have this entire asset class that is only worth anything as long as players actually maintain their defenses. And what you just did right here is you made a fundamental switch. You made a switch from the system caring about who owns what asset into the system only caring about physics, and assets can live on top of them, but the assets are not the first class citizen. To make it concrete, you went from metaverse land NFTs, where you own something until you sell it, to a tokenized force field, where you own something until someone breaks the force field. And when you have a new asset class, you birth an economy with new properties. This requires new types of participation and appeals to a new set of users, which is really cool, which is why even though this has voxels and stuff, it's not the sandbox, right? It's a very different system. And this brings us back to the original claim that we started off with. No matter, and smart items can birth a crazy new asset class, tokenize digital commodities, tokenize force fields that will unlock autonomous worlds because they'll make the autonomous worlds really obvious. To visualize it one more time, you think, let's just expand that statement. Unlike Bitcoin, scarce digital coins, and tamper-proof IOUs, autonomous worlds will have scarce digital matter and tamper-proof physics. Inside, the players will use smart items, which are tangible, physical forms of smart contracts, to grow extremely large economies. And what we have done here is we have kept it simple. We haven't sort of, you know, went too outside and too wild. We have taken ideas that already work, and we have just kind of reapplied them. We have changed these ideas such that instead of being built for finance, they're now built for these virtual worlds. Scarce digital coins become scarce matter. Temper-proof IOUs becomes temper-proof physics. Smart contracts become smart items. I think if you take anything away from this talk, I think it would just be this slide. Okay, now zooming out, only because I have a few more minutes so I can just be this slide. And okay, now zooming out, only because I have like a few more minutes so I can just say some bullshit. We're seeing how Ethereum can eventually birth worlds we don't inhabit physically, but we still treat as tremendously real and valuable, right? So imagine biomes as like a $10 billion GDP, right? Or maybe the autonomous world you build has a $10 billion GDP. And autonomous agents start living inside. Then you build has a 10 billion dollar GDP. And autonomous agents start living inside. Then you'll have a really funny thing. So if they live inside, they're obviously going to value the scarce digital matter in the world they live inside, much more than the coins from our world. They don't actually live in our world. If I have an autonomous agent in biomes and I give it a bunch of neptunium ore, it can take that and build weapons with it and use those weapons. So it's good, it's clear why it has value. If I give it coins, if I give it the US dollar, it can't buy a burger, right? What's it going to do with a burger? So it doesn't actually give a shit about our coins, it will only care about all the scarce matter. And then you have a really weird future, right? AGIs will only accept secure for payment. They don't believe in coins. In 2027, biomes is our only communication channel to ASI agents. And when we want counsel, we travel into biomes and journey to their lands and homes and bring the agents glowstone. And in return, they give you some cryptographically encrypted Riemann hypothesis solution in a book. So this is how we solve the problems of the future. We just appeal to the agents in Biomes, and they give us all their solutions. And Skyler's really smart. You need to trust in Skyler. He built this, he runs this event thing, which means everything he says is definitely true. And what he said is that biomes is unstoppable Minecraft today but that doesn't mean you can take it you know for fun you have to take it very seriously because tomorrow he said it'll be an unstoppable lifelike simulation that's gonna have unalterable digital physics run by AI who believe they're sentience as we believe we are which which is crazy. So take it seriously. Stock up on all the Sakura you can. Go to biomes.aw. You'll see all this unfold. It'll probably go through many cycles over the years, but hopefully something really crazy will come out of it at some point. And thank you. All right, question times. As before, scan the QR code, log in with Zupass, start asking your questions. You can also upvote other questions if you want them to come to the top of the screen. Please do that so we don't have to scroll because it was awkward last time. So we'll start with the first question. Can smart items interact with the world, like place, remove blocks, and define regions? Yeah, so smart items are items with functionality in the world, like place to remove blocks and define regions? Yeah, so smart items are items with functionality in the world. For example, a chest is an item that you can store stuff in and take stuff out of. A door is an item that you open or close to enter something. So smart items are just regular items with functionality in the world. And all you do is, by inserting a smart contract into the item, you can hook into that functionality and further augment it with your own economics. So I turn a door that opens and closes into a door that is now token gating before deciding if it wants to open or close. Thank you. What are the considerations when designing or deploying physics in new primitives? It seems that playing God is high stakes. Yeah, I feel like something we've been noticing is as people start investing their time into this stuff and they start building stuff with the world, especially if they use smart items, so now they're actually building an economy in the world, you can't anymore just arbitrarily push physics updates. If we start randomly one day minting a lot more sakura trees, it kind of screws up what a lot of people are building. So it does make it more high stakes. You need to really get some sort of rough consensus within your community so you don't piss people off who are trying to build stuff inside. It is higher stakes, yeah. Okay, I'll take the digital physics one. How can we design digital physics to attract agents to live in our games? Coins may be useful for them to pay for compute and storage. Second part is probably a statement, not a question. Yeah, yeah. Ultimately, I'm going to say at the end of the day, right now biomes is very much Minecraft. It's not, we're not creating some super AGI thing. But okay, how do we design this, like, this world? How do we evolve biomes to attract agents? I think basically if you get the GDP of the world to be high enough, like, if you reach a world where there's a Neptunium or people value it at $100 because they can build a weapon with it and be powerful in the world, agents might just want to live in these worlds from a purely rational reason such that all the GDP is there and all the activity is there. Okay, I think there's one down there, which was, can you play for free and earn for free? Can you play for free? At some point, I'm sure you'll be able to play for semi-free when you have the Passkey onboarding stuff, so you won't need to worry too much about gas. What you can do in the world is, yeah, I can come in, okay, imagine this. Imagine you have different parts of the world, have different types of resources that they're abundant in. If I build a train system to move resources from one part of the world to another part, to create all these arbitrage opportunities, if I build this train system, I just need to play the game and build a train, right? And then I protect the train system with a force field to make sure it can't be broken down by others. And I make this train system start charging tickets for people to actually take it. I can start selling these tickets. People can buy them. And now I'm making money from the game. But it's not play to earn in the sense of I'm earning these points. It's kind of if you build a business inside and the world sort of has a GDP, then the normal actions you take inside will be economically significant. I'm just going to log in on my phone to see the questions myself. But for now, I saw someone's question, which roughly goes like, is it possible for me to put a door down as a smart item that grieves someone by using a ton of gas like in a while loop or something like that? Yeah, I think one of the challenges with the smart item stuff is going to be what if you insert a track into one of these smart items that is just a bad actor, and then if players interact with it, it's just doing some crazy stuff. This is possible, but I think this is also possible on the EVM. It's kind of the Wild West. And we're going to probably let it up to clients and communities to maybe white label which type of small item chips they audit and verify and know to be trustworthy, and they'll only use those items. So I don't think you need to build security against this at the protocol level, and you can sort of deal with it higher up. Another quick one is, are biomes contracts going to be audited? Well, right now, biomes is like, it's in a heavy dev update cycle thing, so there's like the physics is changing and getting updated. At some point, you probably want it to be audited, especially if the GDP is going to be high. So I could see this happening down the line. Another one is, how do you bridge biomes to solve real-world scientific problems? Yeah, so I think... I'm not totally sure you want to do that. I think if you want to solve real-world problems with simulation technology, I think you can just run simulation technology on a normal computer and simulate whatever you want there and use that to solve your problems in the world. I don't think this will solve that for you. I think this is more about creating this digital simulation that for some reason people take super seriously and they just want all the wood inside. Okay, so maybe any IRL questions? I'm running out of the list. If someone wants to raise their hand, we can bring them a mic. I'll give 10 seconds for people to make their mind. Okay, so thank you. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731567000000,
  "slot_end": 1731568500000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/13_hK3uoJSZ6tt20JSY81twd2hzFWCOGFjUGmSMP9_R4",
  "resources_slides": null,
  "speakers": [
    "dhrumil-shah",
    "dhvani-patel"
  ]
}