{
  "id": "hacking-thai-beats-cities-and-dances",
  "sourceId": "NM8B9E",
  "title": "Hacking Thai Beats, Cities & Dances",
  "description": "Can we inspire Thai builders to be more creative through hacking our own culture? Stories of an algorithmic Thai music festival in Thailand's oldest museum, an open-source hackathon to improve the city of Bangkok, an interactive art performance that blends algorithms with traditional Thai dance; and how you can build better builder communities by inter-disciplinary thinking.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Art",
    "FOSS",
    "Live Coding"
  ],
  "keywords": [],
  "duration": 522,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67356bfe9dbb7a90e1565e6b",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67356bfe9dbb7a90e1565e6b.vtt",
  "transcript_text": " Hello, my name is Phum and I'm a software engineer at Metabase and I work on open source analytics. But in my free time, I'm actually the co-founder of an open source initiative in Thailand called Creator's Garden, where we basically work on open source projects and create events to explore things like synthetic biology and topics like philosophy. But we try to explore those mainly with coding. So while working on these projects in Creator's Garden, I got asked two questions mainly. First is basically how do we get Thai people or specifically Thai builders to be creative. And second thing is how do you bring builders to your spaces? For example, if you have basically an Ethereum space or Web3 space, how do you get people hooked or interested? We have been hosting these events in Thailand for about eight years now, so since I was in middle school, actually. And I'm going to talk about two of these events that kind of gives me this idea on how to engage with builders. So first is on hacking Thai beats. So this is a project I work with Thailand's oldest museum. So I was working with this guy, Khun Hanoi, and he might look very traditional to you, like a Thai musician, but don't let that fool you. He's actually an AI researcher at TikTok and at Google. So he was working on a program that would be able to synthesize music out of AI. So I was thinking, what if we would take Thai instruments, for example, the pinai and granade, and we would be Thai instruments, for example, the PNI and RANAT, and we would be able to use computer and coding to basically synthesize sounds out of nothing? So that's where the idea comes in. What if you can use algorithmic audio synthesis to basically create an event where musicians can come together? But instead of instruments, they do coding. And instead of Western music, they do coding. And instead of Western music, they do Thai music. So in this event, we actually did a big projection mapping onto the wall of Thailand's oldest museum. And people were using things like AI synthesis tools and algorithmic coding tools where they can basically build sounds out of nothing. And I think this is one of the most important lessons we know over the years, which is it's very important not to only have a strong domain or a strong theme or a strong tool, but to combine that. For example, a lot of hacker house, they only focus on the technology. For example, they focus on Ethereum, but they didn't really let people know what they can build with it. In contrast, a lot of hacker houses, they focus on themes. So, for example, finance, but they don't really see what other interesting tools you can interact with that. So, with the juxtaposition, it kind of helps a lot. So, Seymour Papert kind of puts it best when he says, people really learn best when you build things that you're interested in. He was talking about children, but this really applies to anyone. So that kind of brings me to my second project, Hacking Thai Cities. So everyone knows, like, Bangkok is a great city, but there's one catch. Well, you know, there's, like, the air we have right here is probably not the best, and maybe the traffic is not the lightest. And the mayor of Bangkok didn't actually just stop and do nothing. He actually hosted a hackathon, actually was done about three years in a row now, and I kind of like that idea. But the problem is, in a lot of these hackathons, the idea is to stop and really goes nowhere. So I was thinking what happens if we use the power of open source? I know the space for Ethereum really got this far because it's open source, so why not the whole city? Why not make an open source city? So we started with the idea of basically letting people come together, but they don't have to formally form a team, but rather an open source project where anyone can join anytime. If you're interested in someone, well, just open a PR. And we started by basically bringing the domain experts in Bangkok, people who have the data of the whole city, like what are the problems in the city, what are the areas that have flooded, and the distribution of those people, as well as people who have accessibility problems, like people who are in a wheelchair, for example. And I think the greatest thing about open source is it lets everyone contribute. So it follows the principle of low floor, high ceiling, and white walls. Low floor means you can contribute anytime. If you know how to do translations, you can do it. But there's also very high ceiling. So if you're an AI researcher, you can kickstart a new project. And it has white walls. So no matter if you're a scientist, if you're a researcher, well, there's a place for you to contribute. And this brings very interesting projects in the hackathon we did. So for example, there were a lot of motorcycles that were parking near basically the sidewalks, and you cannot basically get over that, and it was really annoying. So someone developed a software that was computer vision to check that and automatically report that and get a bounty. So in Bangkok, we have that bounty system where you can make money by just catching the people who are on the sidewalks, the motorcycles, and you can automate that with computer vision or automating the tree detection of every tree in Bangkok. So we did that. And the last project I want to share with you is hacking Thai dance. In 1923, there was this photo, which is the first ever photo taken of the Thai dance. And the interesting thing is it's 100 years later, but nothing has changed. We're still teaching dance the same way in school. And to be honest, a lot of kids like my age, they don't really get interested in dance anymore. It's unlike K-pop where you're able to hack. So we were thinking, can we use AI to basically change that? So we think of the project where you can generate new dance out of old dance moves, like for example, the 59 principal dances. So we were turning this into an art performance called Cyber Subin, which lets human dancers kind of dance with AI. So we built a software that would try to learn the characteristics of Thai dance. The way we did this is we started basically a group of builders, but also a group of Thai choreographers. And we were going through the old documents of how people would decompose the dance that makes us learn that there are six principles in a Thai dance for example the energy in your body and the circle and curve that surrounds you and from the knowledge we gained from the choreographer we were able to build a software that about allows us to basically generate new dance out of old ones by tweaking the parameters. So we think of things as basically a set of animation transformations where you'd have the original dance, for example, the dance of Te Panom, which looks like this. And then you generally run that through a series of programs that would generate very new dance that you can command and we turn this into an interface where dancers can use to basically generate dances and we put this all together in a dance performance so we just show this up in bali uh i think that was indonesia and also in taipei taiwan so dance performance, we got a lot of people like upstage to kind of join in the fun and play around with Thai dance. So generally, I think this brings me like all the three projects to a final conclusion, which is if your culture or your domain is very hackable, for example, if you make finance like very hackable or you make Thai culture, there are some elements where people can go in and can use their tools or use their technologies to hack. Then it makes it really fun. So compare, let's say, a Thai student who were learning the Thai dance in school and they were really bored because there's nothing new to make. Versus like kids who know how to use AI and they're able to construct new dances and have fun with it. Yeah, so I would like to say thank you to my team in Cyber Subin for the dance production. And thank you to you too for listening. This is it. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731552900000,
  "slot_end": 1731554100000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/16NvToD2NQxicsfxWktPRLuxSt7qrL73mCEcujVhk_i0",
  "resources_slides": null,
  "speakers": [
    "phoomparin-mano"
  ]
}