{
  "id": "hardening-the-commons",
  "sourceId": "BMTVJK",
  "title": "Hardening the Commons",
  "description": "A hands-on workshop for those interested in strengthening the capture resistance and general survivability of commons under their stewardship. This session will be a sequence of guided small group discussions that will flesh out the levels of a <b>capability maturity model</b> for how a commons resource, whether it is a blockchain or a city, can be gradually \"hardened\" by developing and maturing capabilities at material, philosophical, skill, social, and mission levels.",
  "track": "Coordination",
  "type": "Workshop",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "adoption",
    "Censorship Resistance",
    "Coordination",
    "Solarpunk"
  ],
  "keywords": [
    "Impact",
    "Commons",
    "Adoption"
  ],
  "duration": 10846,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673492da9dbb7a90e1a406e2",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673492da9dbb7a90e1a406e2.vtt",
  "transcript_text": " Hi everybody, thanks for coming. Can we actually all please come into the center of the room since it's a smaller group? Can all the people who have been part of the Summer Protocols program raise their hands or just stand up? Stand up. All right. Do not be in one cluster. Please distribute yourself. I do not want to see two SOP people in the same breakout group. So SOP people, please spread yourselves out. All right. People trickling in. As you can see from my hat, it's my birthday today, so make this workshop a success. It's not just my birthday. It's a big one. It's 50. So how this workshop goes is going to be the predictor of the rest of my life. Please make it go well. Okay. All right. Welcome. This is the Hardening the Commons workshop. If you were at Tim's talk yesterday, you heard him raise the team. It's been part of, like, many of the talks here, the Cypherpunk history session. So a whole bunch of talks had these teams going. So this is a workshop, and it'll have some talking, but it's mainly a working workshop. And this is a research workshop. We are not here to teach you anything. You are here to help us do some research. So we have what we think is a good question. It's one of the most important questions. How to harden the commons is in our opinion one of the most important research questions and this has been validated by like two years of the Summer of Protocols program. And we're hoping that in the next three hours you guys will help us come up with some really good answers, right? And this will actually, oh sorry. Can you hold this? good answers, right? And this will actually... Oh, sorry. Okay. So this will actually help us shape the agenda for the 2025 program. So this is not just going to be like, you know, you do some exercises on paper and it then vanishes into the void and nothing else happens. So please, we will be collecting the workshop output. We will be analyzing it and we'll be trying to make use of it to shape the 2025 program. If you don't know what Summer Protocols is, go to summerprotocols.com or talk to the various program alumni who are scattered around the room. All right, let's see. Okay, oops. So the goal of the workshop is to try and put together everything we know and have been talking about for years in the Ethereum community. Capture and censorship resistance, decentralized governance, permissionless innovation. How do you put this all together in a big picture model and what we're calling a capability maturity model? Raise your hand if you've heard the term capability maturity model. One, two, three, four, five. maturity model, raise your hand if you've heard the term capability maturity model. One, two, three, four, five. So if this had been one of my traditional, you know, big corporation consulting gigs and I'd asked the question, 100% of the middle managers would have raised their hand because this is like standard LinkedIn boilerplate business management stuff. It can feel very like awkward and bureaucratic, but it's a very useful way to put lots of random thoughts together in a model. So this is a capability maturity model workshop. I'll show you a few examples to see what that means. And if we do a good job, it can serve as a roadmap for a lot of people trying to adapt the technologies we've been all working on. So harden the common. So two terms there. Harden is in two senses. One,. So harden the commons, so two terms there. Harden is in two senses. One as in harden technology against threats, like radiation hardening electronics for space missions. That's one sense of harden. The other sense of harden is the ability to make strong commitments about the future, and this is something Josh Stark will talk about in his provocation in like an hour or so. And the commons, of course, you've all heard the term commons, and we have a lot of examples in our mind. So, you know, Ethereum L1 is a commons. Open source projects are commons. Forests and lakes and rivers are commons. So we want to like think broadly about commons. And Trent is here. He'll be actually leading a breakout session on how to think about commons. And Trent is here. He'll be actually leading a breakout session on how to think about commons. But here are some examples to keep in mind. And I've put this icon on some of the slides, because for the workshopping pieces, it'll be helpful to have these lists handy. So take pictures of the slides where I have these sort of like prompting things available. OK? So these are some examples of commons. Don't worry too much about the definitions. Systems for producing or stewarding shared resources is a good enough working definition for our work here, okay? All right, how many of you have heard of Eleanor Ostrom? Okay, this is impressive, like more than half the room. Nobel Prize winner, did some amazing work on how commons are built and stewarded. These are her famous principles for stewarding commons. There's a little bit of a cult or religion aspect around Ustrom, so don't take this as gospel, but take it as a thought starter. They're good ideas, but feel free to contradict and challenge them, okay? So again, another picture-taking slide. We do have a shared G drive where hopefully you'll dump your final CMM model. So you'll be working on paper. You'll be, like, making revisions of the model that you're working on. But the final one, take a picture and dump it in this folder. If you have trouble, just hand your paper model to Timber. Timber, are you here? Raise your hand. Can you stand up and show your face to everybody? So Timber is going to be running logistics in the room. Okay, so that's the housekeeping done. So the agenda is, I'll give you a quick introduction to what CMMs are. Then we'll do a set of five alternating provocations and breakouts. So short, like seven-minute lightning talk type thing, followed by 17 minutes where you do one pass through the CMM, then another talk and so on. So we'll do that. Halfway through, we'll take a little bit of a break, and then we'll come back, do some sharebacks, broad room comments, and then wrap up. So standard workshop structure, but hopefully the content is what will make this. Okay? Okay. So short TLDR version of hardening the comments problem, right? How many of you are seeing this cartoon for the first time? Raise your hands. Okay. So most of you have seen this cartoon, right? So you don't want to be too idealistic. We are not writing science fiction. We are not writing weird time machine stories. We are being realistic. So any speculation we do has to be kind of like plausible and realistic, which means, yeah, don't get into like weird fantasy scenario about cryptos. Keep the, you know, $5 wrench condition in mind. That's what it means to harden a commons against attacks. You should be able to defend against $5 wrench attacks. Okay. What's a CMM? It's a well-known model that management consultants like me and, you know, career bureaucrats use to just think about how organizations acquire and learn capabilities by rising through several levels over several years. So we need to adapt it a little bit to apply to commons and open kind of systems, but I think it works. And yes, it can be LinkedIn middle manager bullshit if it's done poorly, but I think this room can do it well, okay? Because remember, it's my birthday. You have to do it well as a gift to me. Okay, so here's like a classic. If you Google CMM, this is the kind of diagram you'll find. It's a pyramid with five levels. You start out with an initial condition of skills where maybe there's random skills. People have like crappy, disorganized ways of doing things, like all of us using Web3 wallets. I would say we are in this initial disorganized level. Managed is when there's a little bit more structure is coming in. Then defined, people have textbook definitions of what things are. Then people are beginning to measure things, so things are getting quantitative. Then finally, people are starting to optimize things, like this is the mature stage. So this is a generic CMM template. Here's another way to visualize one. You can think of it as like a ramp increasing in time. So this one happens to be about analytics. So this type of diagram was popular about 10 years ago when people were talking about analytics. So as you can see, the maturation is when your capabilities are very primitive, you can only do hindsight analytics. But as you progress through the level, you can do foresight. You can do insight, right? So this is evolving high-level capability based on the micro tool-level tactical capabilities. So you learn to use the tools better and better, and you go from being reactive in hindsight to predictive. Some organizations actually acquired capabilities this way. Other people talked a lot about analytics, but didn't actually get there. Here's another one. These are all things I pulled from Google Images, so they're real images that people presumably used in some organizations. This is an example of security capabilities, and this one is interesting because it visualizes it as growing capabilities on three vectors, technology, process, and people, so the red, blue, and green, and each of them evolves through multiple levels, right? So another good example. You've probably heard a lot about this one. If you've been following like the self-driving cars discourse, people talk about five levels of autonomy. What does it mean? Well, a little bit bureaucratic, a little bit engineering. It's a mix of both. It's technocratic. We'll have Sam doing a provocation later on challenging the ideology of technocracy. But there's a technocratic model of what self-driving should look like. Bureaucrats plus engineers putting it together. This one, actually, I just made half an hour ago. I was in a workshop that I was running called Web of Roots. And it was all about the problems of crypto adoption. And the breakout session I was in was about how there's a lack of tools in the ecosystem. And I made up this capability maturity model. So I have like five levels, AI is like a cloud around that. So you can get creative with this stuff. This one, Tim, do you want to quickly speak to this? Vitalik's roadmap is kind of like CMM. So Tim, come around and speak into the mic. Oh, we lost my slides. Okay. Yeah, so in Ethereum, like Venkat was saying, we don't have a lot of LinkedIn CMMs, and I think this is the closest we've come to as an ecosystem to mapping things out. And it's sort of like an implied CMM here, where if you think of the way Vitalik summarizes the Ethereum roadmap, 2020, it was just like, here's a bunch of stuff we have to do in the next 10 years and how they fit together. And not on this slide is the 2019 version, which is here's a bunch of stuff scattered over the internet that we have to do in the next 10 years. And it's sort of like a refinement in thinking over the years where a couple years after that, we were able to actually break this down in specific tracks, so like the merge, verge, surge, all those things. There's still sort of just like these rough pointers that we have that are quite low context. And then just before, DevCon and Vitalik actually put out a blog post for each of these tracks, sort of like going very deep into details around like, OK, what's the actual thing that needs to be done? Where is it at? What are the blockers and whatnot? And so you can see that we have this sort of evolving capability, or at least Vitalik has, and then guiding the ecosystem to articulate or understand what this entire set of things we have to do is and how they all relate to each other. Thanks, Jim. All right, so now you have a bunch of examples of CMMs to refer to. All these are real world ones, so don't worry too much about what an abstract definition of a CMM is. Keep these examples in mind. So how do you make a CMM? So one, pick a specific important commons. Two, pick a specific target social group that's trying to mature its capabilities, right? So if the commons you pick is like a lake and a community around it that wants to keep the lake ecosystem healthy, the lake is the commons and the people who are trying to keep it healthy is the social group. Try and define four to seven levels, don't go over seven, keep it actually close to four or five if you want because it gets weird. The traditional ones are initial, manage, defined, quantified, optimized, but feel free to get totally creative. Name each level and characterize it in terms of people, technologies, capabilities. Then this one is very important, number five. Try and define a test for each level. So if your CMM is about preserving a forest and you have a five-level hierarchy of how to preserve a forest and say, oh, Brazil is at level three, but Indonesia is at level two. What the hell does that mean? Define a test for level two and level three about how rainforest commons work, okay? Pick a visualization. So I gave you a few examples, pyramids, ramps, stacked blocks and stuff. So pick a good visualization. If you don't like the ones you have, make one up. But, you know, this is not an art workshop. This is like bureaucrat workshop, so you don't have to get super artistic with it. Think of this whole CMM exercise as, this is a collective learning curve from ad hoc, sort of like, kind of illiterate levels to very mature and refined capabilities. And it can go from very scattered skills, like everybody here uses Web3 wallets, I presume, but there's no coordination. It's very fragmented, but if it matures, presumably there'll be a wide conversation about which wallets are better. Maybe there already are, but there's not textbook versions of the discussion. So collective learning curve from ad hoc to mature, from scattered to integrated. And usually there's an element of codification and documentation too in building a CMM. And both the organizational structure and the people in it are learning as you go along, right? Forming procedural memories so that even if people join and leave, the organization or system still remembers, right? So if a whole bunch of people create a CMM for something and then half of them get new jobs and go and a new half comes in, the system should not break completely. The knowledge continuity should be there. So special challenges for us as kind of an open ecosystem that's decentralized and all these weird things. So CMMs are typically for top-down traditional organization where the CEO can say, hey, I'm appointing a bunch of people to impose this training program and all of you are going to go from level zero to level five. This is not that. So how do you do it in an open ecosystem context? CMMs rely on codification and documentation. In open systems, that typically happens in a much more ad hoc way. Like maybe some volunteers start documenting stuff. EIPs are a good example where it's somehow gelled into a very formal codification, but not in a corporate way. CMMs are usually technocratic, but can we actually not make this about LinkedIn middle managers and work with direct technological agency? And finally, CMMs often are about acquisition and installation of behaviors in big corporations because it's all theater. The CEO wants to have like a big program that they can brag about. Once that happens and then the big parties are done, people forget and skills are not actually maintained. So in an open ecosystem, actually the reverse emphasis is better. Like it's better to acquire and install a very limited capability that then endures for 10 years than to pretend that everybody's level five black belt and then one year later, nobody knows how to log on to the system. So you really should think in terms of maintenance of small skills. Okay, we are going to head into the first breakout session. So this is my provocation. Okay, so what is the bounding box for your chosen commons? We are going to head into the first breakout session. So this is my provocation. Okay. So what is the bounding box for your chosen commons, right? So what is the physical medium of the commons? So if you're talking forests, it's like trees and grasslands and the animals and the ecosystem. If it's software, it's the Git repository where all your software lives. So think of what the actual physical material medium is. Think about the neighbors of it, right? If your code is on GitHub like Ethereum's code is, one of your neighbors, whether you liked it or not, is Microsoft because Microsoft owns GitHub and so forth, right? So think about your neighbors. What is the nature of the boundaries and the threat and exposure you have across those boundaries? So here's an example of what I mean by a bounding box. So treat this as like straw man bullshit. I don't know if this is really any good, but you can think of like, you know, censorship resistance, Ethereum development processes. These are the boundaries for it. The fact that the code lives on GitHub, that's a common, not a threat, but a thing you have to think about, right? Everything Ethereum does is based on compute and compute relies on chips, and chips come from TSMC, and that's vulnerable to conflict, right? Quantum resistant cryptography, another threat. So all these are like the bounding conditions for what makes it possible for Ethereum to be healthy. And just to have a very different example, if you have a public lake, you have to think about things like, are there invasive species? What are the environmental regulations that are like constraining what you do? A really good example of this came up in one of our SOP research projects last year, where the people in Brooklyn trying to preserve the waterways, they discovered that the local regulation said that if the water is being used for like human activities, it has to meet higher quality standards. So an activist group started canoeing in the sewage contaminated canals of Brooklyn, and because of that, they forced by regulation, the regulators to actually start cleaning up the canals. So this is a very interesting example of stewarding the commons. So lake. Okay, so breakout number one, so this is the first one. So first form groups of three to five people, so just where you are, look at your two nearest neighbors, So this is the first one. So first form groups of three to five people. So just where you are, look at your two nearest neighbors, bring your chairs a little closer together. And SOP people, I do not want to see two SOP people in the same group, so distribute yourselves accordingly. And yeah, together choose a commons to work on, choose a target population, and maybe draw a bounding box if it's useful, then draw version one of this, you know, capability maturity model for your comments. So set of named levels, people, skills, and so forth and test for the abilities. So it will take 17 minutes to do this starting now and I think Timber is going to go around distributing paper if he hasn't already. So form your groups of three, please. Three to four. Thank you. All right. Thank you. . Yes. Thank you. Yes. Open the phone.",
  "eventId": "devcon-7",
  "slot_start": 1731486600000,
  "slot_end": 1731497400000,
  "slot_roomId": "classroom-e",
  "resources_presentation": "https://docs.google.com/presentation/d/1gO904DKuSqj1sNQuLtbP57gbG3NphApmqMl4sI6azOs",
  "resources_slides": null,
  "speakers": [
    "tim-beiko",
    "venkatesh-rao"
  ]
}