{
  "id": "how-to-destroy-a-network-offboarding-the-mainstream",
  "sourceId": "XNCFRL",
  "title": "How To Destroy A Network: Offboarding The Mainstream",
  "description": "Crafting Ethereum into a setting (both technically and reputationally) where The Institutions feel comfortable participating in it at scale has been the life work of hundreds of people over the last nine years. And yet, for our success, many feel that the victory has come at a cost too heavy to bear: our losing focus as to why we built the global computer in the first place. If you feel the same way, join me for a brief exploration of what would need to happen for us to cut the cord.",
  "track": "Cypherpunk & Privacy",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Network State",
    "Privacy",
    "Anonymity",
    "Digital Sovereignty",
    "value",
    "Anonymity",
    "Digital Sovereignty",
    "Network State",
    "Privacy"
  ],
  "keywords": [
    "Values"
  ],
  "duration": 1441,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "axoRHSVU9KU",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673469329dbb7a90e18ab8ef",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673469329dbb7a90e18ab8ef.vtt",
  "transcript_text": " Tanya Cushman Reviewer:\" Peter van de Ven The room's half empty now. I'll make sure it's fully empty by the time I'm done. I once again find myself staring at the lights, and I cannot see how many of you are, so if you're in the back and you want to leave, you can. I won't know. I find myself quite anxious for the first time giving a talk, mostly because I'm sober for doing this, but also because I have turned 36 today and I found out yesterday that I will be 43 by the time the consensus layer gets upgraded. So I'm having a bit of an Ethereum midlife crisis. This is not a technical talk. It's kind of the amuse-bouche between some really interesting stuff on ZK and everything else. This is more of a culture talk. It's kind of the amuse-bouche between some really interesting stuff on ZK and everything else. This is more of a, it's a culture talk. The are we the baddies? Like, what have we created? Should we be aware of things coming down the pipe? And I'm not the only one who helped contribute to this, which is good because these two are both more intelligent than me. Josh Cincinnati, the president of the Interchain Foundation, and Paul Dylan Ennis. I think one's watching and the other one's asleep. Hi everyone, thanks for your help. And so I've been watching some talks, I've been walking around, I've been speaking to people. Devcons, it's my first Devcon, and it's been really exciting to kind of like watch the energy and like what people are working on. It's probably going to get a little bit frothy in all of crypto for the next couple of months or four years. We have no idea yet. And so I think it behooves us to maybe just caution ourselves a bit and go like, we spent so long, like 10 years, getting to where we are now. We finally have the Biddle Fund. We finally have PayPal and every other company are launching stable coins and so on and so forth. Was this what we wanted when we built Ethereum? Not that my opinion matters, I don't think. I work on a credit facilitation protocol. It's everything for everyone. What would need to happen for everyone to go Ethereum has failed? A bit of a Duma talk. We will make some jokes out of it while we go. I don't want Ethereum to fail. It is the work of my life. I love doing it. But it does seem funny that when you first get into Ethereum, if you are in it for the tech, you go here's the global computer, this godhead, and I'm like, BlackRock's in, let's go, wag me. Not that that's a bad thing, I just sometimes find myself going a little bit of a paradox when I work in Ethereum. And so I'm trying to talk about a couple of things. Some of them are probably probably likely some of them are quite outlandish just rate them like how funny would it be if they happen how likely are they to happen like what would the impact be downstream and yes like I said this is not going to be a professional talk so I guess the first one is like what happens if one of our homebrews fails Lido or Rocketpool or anything of the sort because Because when we, I mean, who was around for the merge? I imagine most people in the room, right? I was sitting at like midnight, 2 a.m., watching it happen, and I popped a bottle. And this was meant to be the whole, like, yes, it's no longer an ASIC thing. We own our own network. It's, you know, we've taken some control back in like a smaller scale. The way I phrased it is from the savage mining rigs to the noble home staker. But 32 ETH is the validator stake. And I can't afford that. So it feels like it's out of reach. So we've seen these solutions come in to fill the gap. So you have Rocket Pool now with its mini pools that you can do for ETH, which is great. That's more in reach. But what if? What if something goes wrong? What if staked ETH or wrapped ETH, something goes wonky? And Vitalik was speaking, I think, two or three days ago about how we want to start driving back down to one ETH as a stake. That's great, that we should get there. We probably won't, or if we do, it'll be 2040. But until it happens, if something goes wrong in the interim, then the likelihood impact is that we see the exchanges that currently have a large minority of the network just aggregate more. And that becomes dangerous. We're in a sunny uplift. We think everything's going to be a little bit better regulatory-wise. Hopefully, we'll get some clarity. But that might flip on a dime pretty soon. And then we end up with a stranglehold in reach. Or we end up with Larry Fink ends up in control of everything and we've just created eCoin. Likely, I don't think. These things have been around for years now. I don't think anything's going to happen. I realize I have a reputation for saying these things, and they do, so I'm sorry. Don't laugh too much, please. I don't want to be here next year and be like, this was the turning point. If something did happen, given that, you know, I think Lido has, what, 27.7%? That's quite an autistic thing to think and then say the percentage. I think Ethereum would remain safe at its core, but it wouldn't be fun. You know, like, we've watched years and years of getting dunked on for proof of stake networks, and this would have kind of proved the point that we can't be trusted to kind of guard our own assets or our network. This is what happens when you introduce programmability. You get it wrong. Tether getting sanctioned would probably be another one. Like, stable coins are such a weird thing because they're now like it's everything and nothing. It's the most boring use case for crypto and also I think probably one of the most important. I've spoken about this in Paris last year. I think it was. Saying that the soft power in Ethereum now belongs to stablecoin issuers. That's where the liquidity goes. We pair everything off against Tether, Circle and so on. To a lesser degree Rai, Dai We pair everything off against tether, circle, and so on. And, you know, to a lesser degree, rye, dye, and so on. Sorry, USDS now. Or back. And it's very easy to imagine a situation where, like, you finally go, I mean, I don't know how much tether has, like, the US bond market now, where things get a bit hostile. And it's actually like, no, we consider you kind of like, where you're no longer simpatico with you holding this much collateral and just making it difficult to redeem. What happens then? We're not getting OFACs at scale for ever having Tether in our wallets, but what if you grip onto something and make it harder? I don't think this is going to happen as well, but it's nice as a what-if. There's one that I'll talk about later which I think is probably more likely, and that will become a bit contentious. But yeah, if Tether's sanctioned, if Nopalo finally gets sent to Gitmo, that's it, we're done. We are back to 2016. It's over. We talk about how if there's going to be a US regulatory compliance stable coin, it would be Circle, whereas Tether's, you know, please maintain the peg no matter how illegal it may be, thank you, sir. I don't think this would be great, but, like, yeah, Bitfinex would have, like, a wonderful time out of it, you know, like, the Tether truth might factor into this, depending on how things go. Maybe Lido fails. Maybe Rocketpool fails. Maybe Tether is sanctioned. Something happens, like DevOps comes back and actually goes, right, this time I'm coming for the EF wallet. And I did mention the other day that I started on Ethereum the day that that happened, that the parity wallet was bricked. And a bunch of people thought I'd told on myself. This is my announcement that I am DevOps199. Actually, Gavin Wood coming down the corridor. Something happens, and we need to wind things back. This is gonna be less hands up. Who was around for the DAO hard fork? Enough. All of you could have your hands up, I wouldn't know. I can't see anything. It would be extremely hard, I think, to coordinate that now. We voted on it back in the day, and it was like, what, 5% of all ether that was around voted for the fork to happen? And that was basically nothing. No quorum, but we were like, well, what other option do we have? You should read The Cryptopians by Laura Shin if you want a deep dive into some of this stuff. Very good. I don't think we could do this again. And more important, in a way that's not centralized, this comes back to what if you end up relying on Coinbase or Kraken or whatever to facilitate the fork. And it does seem that we have accepted as canon that this is not happening anymore. Like the fact that EIP-999 is just there, like no one's going to be upgrading the contract code to like return the funds to parity or make them accessible again, we're finished with hard forks. But what if? It is not for me to sit here and doctor strange to you the various ways that we could finally have a schism, but I think it's probably more likely than not in the medium term. And back in the day, it was an ideological thing. It was very much like, no, this is what Ethereum was meant to be, and that became Ethereum classic. We have the Ethereum that we use now, which won, crowned by the social layer. Not happening now. It's wherever Circle and Tether go. And that's interesting. And what happens if they go to different places? Because if you remember when ETH POW at the merge, that was meant to be the fated, this is the version that exists, and that collapsed, and Pulse Chain was another one. Shout out Richard Hart wherever you are. I do consider this inevitable. It could be something really minor that just gets blown out of all proportion and becomes like our Martin Luther moment on the door. It could be the implementation, it could be the beam chain, it could be anything. I think Ethereum would like this room would have smaller dev cons based on which camp we fell into. But I think we would be fine. I mean, Hudson, you arranged the first dev cons after the fork, didn't you? Yeah, that was really difficult. Do you want to do it again? No, that's okay. Yeah, like, we made plenty of jokes about East POW, and a bunch of people got really into doing some interesting ARBs, and you started seeing things like, oh, ARV's deployment there has collapsed, and that was very funny, but no one was ever tying any value to it. Now that, but a meaningful stablecoin is on each chain, and that gets weird quick. Is my ticker working? Yes. Base level privacy. I want this. I think most people want this. We've just listened to a talk about like, you know, pass keys and losing zero knowledge. I think Aztec Connect should still be around. You know, it got sunsetted. Its final one was January this year that it stopped running its sequencer. I want it to come back. More importantly, I want it to be in Ethereum. I think we want the optionality of being able to obfuscate things. The who and the what. Coinbase have just come out with their schema for confidential ERC20 that uses fully homomorphic encryption to be like, okay, we can hide the who and we can hide the how much. I think that's cool. And I think that's going to get scaled up more now into kind of like Zcash-y type looking things, but plus plus the EVM for programmability. I think when you're talking about hedge funds and what have you, or just large entities that are trying to do stuff on chain, seven years ago, I was doing something like Hyperledger, trying to do reinsurance at a bank. That didn't go anywhere, but that was the kind of thing. It was like, how much can you hide on chain, amounts or what have you, which was fun, but you don't want all of that to be public. I think it would probably make it really interesting for some institutions to bring more stuff onto Ethereum. Because they could kind of access some stuff, like debt issuance or what have you. But some stuff they just kind of want to move in the shadows. And this works really well until you've ever audited a contract or tried to analyze something that's gone wrong. And then you're like, oh, I don't actually, I can't read any logs. I don't know, like, what the call data was. I can't, I don't know what's happened. And so I think this would be fine right up until the moment where, like, you do have a quarter of a billion dollar hack that, like, leaves BlackRock out to dry. And sucks. We don't like this anymore. Even though it's like post facto repair of damage. I think confidential ERC20 is going to be one of a line of like, you know, we've seen ERC20R, the reversible version. No one's ever really done anything with it. I think this is going to be in the same kind of schema. Interesting stuff because ERC20 is what it is. But we're never getting base level privacy in Ethereum itself, dog. I would like to have a Zcash type thing where I could write my Solidity contracts. But this is because of who I am, not because I'm the wider network. A better Ethereum. I really didn't know how that was going to go. Solana, it's lame and cliche to dunk on MERT and TOLI and all of the others for, like, Solana will shut down. We're done. Solana's good. But what happens if, like, over the next four, eight, ten years, you know, by the time that the beam chain happens, the... Wow, I can do off the cuff. What happens if it still is appealing to retail and the institutions that are trying to target them say, you know, fantastic, this is where we're going to go. And we just end up kind of spinning our wheels. Because, like, what if Bitcoin L2s work? You know, Cardano becomes its light layer for that and Plutus becomes a language that we all get good at. Well, there are other languages than Plutus. I'm showing my age here. Does that pop our tires? Like, we work now. Ethereum is top dog for this kind of thing. But we might not always be. We can't presume that we're always going to be the successful networks that were the L2 situation. Everyone saw this post, right? Two days ago. And I was like, oh, shit post or real thing. And then I finished my slides, and I was like, fantastic, I'm done, I'm going for a drink. And then Justin went on stage and was like, the Beam Chain, I'm like, oh, okay, right, now I have to read all about it. What if another network does this first? Unlikely. I think that unlikely that something like this would happen, but what if we get a better Ethereum? I think this is going to happen, and I think it's going to happen before I turn 50. Bitcoin was top dog, and it was the thing we had, until it wasn't, and then Ethereum turned up. And, like, Ethereum might not always be. I'm quoting Tim Clancy here, by the way. The grand network, a godhead unto itself, the fount of a glorious future, might not always be. It's a skill issue if that happens. Like, we'd see it would be completely on us. Not an attack factor. This isn't, like't a bad thing. It's just like our experiment has failed. Can you imagine bankless? For the next two years. I love the bankless guys. I actually enjoy them, but can you imagine? What happens if we become Cosmos? And I say this with love to some of the Cosmos devs I know. The fact that we are responsible for Ethereum is both the best thing about it and the worst. Because we are pretty stupid. On aggregate, we all are. I am, you are. And yeah, have you ever heard the Cosmos governance forums? Not great. What if that spread to Ethereum? Everyone listens and respects Vitalik. He guides us through his thought leadership, which he's getting better at. What happens when he leaves? Who takes over? Who at the EF becomes the new god? We need someone to focus on. It seems weird because that's not how Ethereum should be, but people want to look up to people to take over the reins. And I don't think we really have viable candidates for that yet. This is like Cosmos focuses on being multi-chain, whereas Ethereum's roll-up centric map is like, we have like May 1000, L2's bloom. I think we're less likely to kind of fall into this chasm because we have mainnet to defend. But yeah, if that did happen, you could just imagine bickering of like, how do you do X, how do you do Y? We're going to start seeing it over the next years. As the pilling starts, there's a phase of the beam chain. It's going to happen. We're going to start quibbling over stuff. Some will get implemented, some will change in spec, and then we'll just argue for years. That's not a bad thing because this is slow. It has to be slow. We can't move fast and break things when it comes to Ethereum itself. And it would be really frustrating to watch. I have three minutes left. I think coming back to what happens if we kind of just get muddled in ourselves is because we're human, it's very easy to PSYOP ourselves or be intentionally PSYOPed. If Ethereum becomes a trillion dollar network, it's worth doing a five-year long con To just kind of like muddle the... was it... who was it? Was it me? Am I a cool dev? Yeah To just kind of like infiltrate, to kind of like muddy the waters, to run the CIA handbook of you know Just like make everything by committee, run it back, take all extremes. It's... I wouldn't like to see it happen, but I think it could. I think we're, like, vulnerable to it. I've got two minutes left. I hadn't timed this. I just wrote them and said, like, I'll turn up. But I think it's really important to see everyone here, people old and new. I think it behooves us in the next few years, as things start getting frothy, to just be aware of things that are coming down the pipes that might be a risk to Ethereum. And it feels like, to everyone sitting here, like, maybe if I'm not Justin Drake, it feels like I don't have much impact on Ethereum, but you do. As we've seen with the Bangkok traffic, you're not stuck in traffic. You are traffic. All of you are Ethereum. I am. You are. You are. Not Hudson. But that's the point, is that it is a global network of us. This is part of the drive towards the homest, with our control, our network, our decision. And we're getting there. And I think you should all be proud of the things that we have built as a collective. And in lieu of doing any cringing happy birthday singing, I would like you to just pull out your phones and just tweet, I am Ethereum. That would be nice, I think, just to kind of like sigh up a little moment. Timed that pretty well. One minute to go. Thank you, everyone. Thank you so much, Lawrence. I would have bet $10,000 if that was up there, and I would have made bank. Okay. It's a really fun presentation, so no wonder there's a very fun Q&A as well, for sure. So first one is, is it vegan? I hate all of you. Okay. Next one should be fun. Docs, all your alts right now for attendees only. Yeah, it's just like two of us here on stage. Nobody else would know. Buy me a drink later. Oh, God, I can't engage with these questions. I'm not optimizing putting Catgirl sent on chain. I am 36. Please stop. Okay, so this is a bit more serious one. Yep. Okay. Ethereum is a technocracy that so far hasn't been heavily influenced by BlackRock, etc. I think that's true. I think we find the blobs that stand apart in the Ethereum foundation and the people that we would consider that we would mark as being Ethereum do stand apart from the institutions that we talk to and engage with. You're seeing that we start almost violently rejecting at the social layer even the perception of conflicts of interest. We saw this recently with Eigenlayer, which I was like, I think this is fine-ish, but I can see why that ended up unravelling the way it did. I think we're fine. I don't know. Again, it could be that we start like, oh, it's not going to happen. All of Visa starts settling on-chain. Then they have a motivated interest to be like, we now want control. If you haven't watched Mr. Robot, go watch the e-coin scene. I think that's quite telling. Okay. Next question. There's actually two questions a bit connected to each other. Vitalik leaves, and for some reason, you're in charge of anointing the next thought leader. Gun to your head. Who do you think takes over? And there's one that asks, would you want it to be you? Would you replace Vitalik if asked to serve? Anyone who has to tell someone that they're a king is no king, right? I think it wouldn't be like I would choose. Absolutely not a terrifying idea. Who would take over? I'd like to see some of the people at the consensus layer, I think, kick up, but I'm not going to name anyone. And I think that's also weird because we end up kind of like saying it's the technical good communicators, which are diamonds that show up. But they're normally quiet because they're just getting stuff done. Vitalik's still quite uncomfortable, I think, being the face of Ethereum. He's great at doing it and he talks so much, but I wouldn't want to be him. I respect him and I do not envy him. I don't know. It's Hudson. That's it. Congrats. You're in charge. Okay. Sorry. I'm viewing from my phone. Does Ethereum need a new champion, particularly for privacy? We have champions for privacy on chain. JT Riley, everyone working at Aztec, everyone that's worked in ZK proofs, they're around. You just maybe know or don't know who they are. They exist already. All right. they are, right? Like, they exist already. All right. You seem to believe that there is room for institutions and add-on. It's hyperfunks both. Isn't that very argument for success in network hardness? Yes. I've argued before in talks that I think, like, it's fine for us to have these two worlds, but they will inevitably start clashing, I think, as, you know, kind of, Ethereum is, in and of itself, inherently political Assets become money become power and they will start to be arguments about who is in control Paul Dylan Ennis has given some really interesting talks about regen versus degen culture And these kind of like clicks that like regions were in the minority for a while because that's what everyone was doing Was just pumping things on like in crypto Say by thebye for Jonathan. How to get accepted to West Ham, three ether, please everyone. How do you see privacy going forward? I get your resistance on L1, but what about L2s, would this facilitate crime? I liked Aztec Connect. I want to use DarkFi when it comes out. I think that they're all fantastic. I think it's so hard. I can argue both ways quite easily about the how and the why you wouldn't want privacy on-chain, especially when it comes to arbitrary programmability, because every contract becomes a tornado. And that's really tricky. But at the same time, it's very much like, I want to do these things because I want to exert myself sovereignty. And we have a few seconds. Do you see a decision between pragmatic vision versus cyberpunk ethos? I don't know how to answer this. I don't know what a pragmatic vision for Ethereum looks like because I can only stand here and speak with my biases. And I like to think that I'm a cypherpunk. But maybe I'm a bad one. I don't know what practice looks like. Is it single slot finality? Is it more value on the chain? Is it more stable coins? I couldn't tell you.",
  "eventId": "devcon-7",
  "slot_start": 1731484200000,
  "slot_end": 1731486000000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1mVbPl6HPZouYDklCGe84dKqjwtSkE7VTKOYNdWU6URc",
  "resources_slides": null,
  "speakers": [
    "laurence-day"
  ]
}