{
  "id": "how-much-security-does-your-restaking-protocol-really-need",
  "sourceId": "QDDV9C",
  "title": "How much security does your restaking protocol really need?",
  "description": "Restaking protocols have aggregated millions of ETH with the hope of securing new infrastructure on Ethereum. These services, such as ZK provers and oracles, require restaking ETH to enforce custom slashing rules. But how much ETH do these services need? And how much risk do these services place on Ethereum L1? We will formulate a mathematical model for answering these questions and present an empirical analysis of cascading risks from restaking services to Ethereum, with a positive outlook!",
  "track": "Cryptoeconomics",
  "type": "Talk",
  "expertise": "Expert",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Staking",
    "Censorship Resistance",
    "Economics",
    "Restaking",
    "proof-of",
    "Censorship Resistance",
    "Economics",
    "Restaking"
  ],
  "keywords": [
    "Matching Markets",
    "Proof of Stake"
  ],
  "duration": 1521,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "ikYZ2dMUTyw",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735812c9dbb7a90e14536da",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736ea1d1b0f83434d40f7be.vtt",
  "transcript_text": " Thank you, Miss Purple. Yeah, so the title of the talk is Protocol Guild Funding the Ethereum Commons. My name is Trent Van Epps. I'm a member and one of the organizers of this tool. And just a shout out to the DEF CON organizers. I've presented at a number of events in the Ethereum community and it never gets old. So thank you for putting on an incredible event. And hi to any family or people that are watching on the live stream. So let's start off with some crowd engagement. Raise your hand if you think that there are 25 to 100 Ethereum core contributors. Show of hands. Okay, and by core contributors, these are people who are working on client development, research, people that help with testnets, people that do support for testing and security, specifically related to Ethereum mainnet. That's what I mean by core protocol contributor. All right. So not too many hands. Raise your hand if you think it's 100 to 300, roughly. Okay. Okay. And then raise your hand if you think it's the last option, 300 to 1,000. All right. Most of you were right, so good job. I think roughly, in my estimation, there's probably 100 to 300 people who are involved, mostly in a full-time and probably some in a part-time capacity, working on the software that underpins Ethereum. Another question. Raise your hand if you wanted to buy some of them coffees. How many of them could you name today? So, 1 to 10. How many of you could name 1 to 10, you think? Okay, put your hand down if you thought of Vitalik or Justin. Okay. Alright, how about 10 to 30? You think you could name 10 to 30 core Ethereum contributors? And then finally, 30 to 100. All right, if your hand is still up, come talk to me. I want to meet you after this, if I don't already know you. Why does this matter? This matters because Ethereum is a software commons. And the term I like to use, if you're not familiar with it, is commons. And the definition I use is, this is a system of peer production which manages shared resources. And this is really important for how Ethereum is stewarded over time to think of it in this commons frame. And when we know a system's peer contributors, we can do specific things with it. For one, we can get more certainty around the nature of the shared resources that it produces, and specifically the production process. Secondly, we can fund their work, help to avoid capture from malicious entities coming and engaging with the stewardship process. And finally, we can stabilize this contributor set with particular incentives. And maybe if you are familiar with the commons term, you've heard of it in the context of a fishery or a forest or a pasture a pasture that people share together like natural resources that people figure out how to maintain a standard of the resource and then they all benefit collectively but this can also be applied to digital goods or intangible goods like the internet is a common infrastructure that we all use today we're using it right now for the live stream, and I would be surprised if there's many people who don't use the internet every day, but they don't necessarily think about it as this shared infrastructure. Similarly, for something like Wikipedia or Linux, this is software infrastructure. Software is oftentimes produced within this commons context. And when we think about Ethereum, we might think about different parts of it, but we don't necessarily think about it as this holistic commons kind of mechanism. So the three resource types, from my perspective, I think there are three main ones. The first is the network and derivative forms of it. So the chain state, the chain history, different forks of mainnet. And layer twos would, I think, fit into this resource type of a distributed system. Secondly, the asset in the bottom right side of the diagram. Ether, we all use it for paying for transactions. And then it can be put into different forms, whether wrapped or restaked or bridged to different networks. And then finally, one that maybe you don't think about as being a resource type is media. And this can be the specifications which define bits of the protocol or research about what Ethereum can look like in the future, software generally. But it also includes things like the transcripts of governance calls, all Cordev's calls, or the EIPs which describe future changes. I bucket these all within the term media. Hopefully these three resource types make sense to you as well. And all three of them are interwoven in a very unique way. They can't necessarily exist without the other, and so there's this interlocking where each of them refers to and is informed by the other three. Each of these resources is also produced through protocols, and by protocols here I mean like rule sets or guidelines for how the resource comes to be. So for the network, there's specific rule sets, technical rule sets for the fork choice rule or blobs if layer twos are using EIP4844 or P2P gossip for nodes coming to consensus and passing data to each other. The asset, you know, it's minted through proof-of-stake issuance, and then it's destroyed as part of the 1559 burn. These are rule sets which describe how the asset, this resource, operates. And then finally, the media is produced through open-source norms, permissive licensing, public-by public by default governance, and rough consensus. And these rule sets are really important for defining how the actors engaging in the production of this work really operate. It defines what they can do and what they can't, the constraints which guide their behavior. So this brings us to the question of who and in what context is the software media actually produced? Some of you, I know, had your hand raised until the very end, but sometimes this isn't necessarily something we think about. Sometimes, because Ethereum is so dependable, we don't necessarily think about something which just works by default. But it really is an interesting question to start to consider is who's actually making this stuff? And this is a map. I'm not going to go too deep into it, but this is my perspective of who's actually working on mainnet these days. A range of different project sizes, different project types, there's commercial entities, there's non-profits like the Ethereum Foundation. It's a really broad array. Today, probably around 10 different, 12 different independent institutions, and I would say maybe 30 different projects within that. And maybe you knew some of these, but maybe there's others that you don't. And in the middle, there's like this whole range of other org affiliations. Hopefully, if you're not listed here, you don't get offended. Consider yourself part of the middle there. And this is what comprises the main net stewardship, this set of projects that make up the software that then powers the network that we all use in some way or are aware of, right? So what Protocol Guild does is it takes the individuals that are working within these team contexts, within these projects, and it surfaces them to a different level of legibility. So it makes them visible from a longer distance, let's say. So the Protocol Guild mechanism binds these individuals together in a collective mechanism that then you can do interesting things with. You can fund it, you can set common standards. We'll get into that. So Protocol Guild today is a list of 187 of these main net contributors. And collectively, they have more than 600 years of cumulative contributions, which is, when you put it that way, it's pretty incredible, right? You have people who've been here a long time, people who have just shown up. But together, it's a lot of brainpower that's working on this software. And generally, you can also think of it as just a collective funding mechanism, like I mentioned. There are a couple of things which make Protocol Guild very, very unique in the landscape of the Ethereum space, specifically regarding funding protocols. And I'm going to go through them here. The first is that it has a very narrow mandate. It's only concerned with maintaining the mechanism and driving funding to it. It doesn't engage in protocol governance. It doesn't direct the day-to-day efforts of these individuals. It has a very narrow mandate for what it's supposed to do, and that way we can make sure that we're focused on that mission and we don't have this scope, which expands over time and then the mechanism loses its focus. It also focuses on a very narrow domain, specifically the core protocol set of contributors. It doesn't think of anything much beyond that and tries to approximate where the edge or where the boundary condition of the edge of the main net protocol actually is. Whereas things like Gitcoin or Optimism Retrofunding, they have a much broader domain that they try to put funding to. Protocol Guild specifically focuses on the individuals doing this specific work. The second thing which is unique is it has an open membership of individuals. So to compare it to like a non-profit or a for-profit entity, which, you know, they hire and fire people depending on their budgets, we've committed to having an open membership. So if you meet the eligibility requirements, you show up and, you know, you've been doing this work for six months and you expect to continue doing it, the eligibility is obligated to add you. And this is how we build up legitimacy over time by not necessarily gating the membership, which could be dangerous long term. And we focus on individuals instead of what many mechanisms do for their funding approach, which is focusing on the team or the project itself, we think it's really important to return as much agency to the people themselves that are working on this software and make sure that they have as much flexibility for how they engage in this commons production process. Third, it has a comprehensive quarterly curation. So we're regularly updating the mechanism. The set isn't static. Every quarter, we go around and try to find anyone that's missed that now meets the eligibility, and we add them to the membership if they want to. Ultimately, it's opt-in. We do have core contributors who decide not to be part of this. It's totally fine. So it's an opt-in mechanism. Into this particular domain and not necessarily seeing somebody who's doing valuable work that's maybe lower profile or harder to make legible at a certain scale. The fourth unique aspect for this mechanism, this tool, is that all of the funding goes through a four-year on-chain vesting contract. And this is different. It's an opinionated frame for how funding should be distributed. We use time waiting to allocate funding so that if the earlier you show up and the longer you stick around, the more funding you'll get through the mechanism. And this creates assurances in a number of ways for both the funders, the members, and the community that's observing this mechanism and engaging with it. Funders know for sure that anything that they allocate will be there in the future. It's going to sit in this immutable contract on-chain, and they know for sure that it's going to vest linearly each block i can't run off with it they can't take it back so there's a there's a nice characteristic that we get by having it in this immutable contract on chain um and then for for members they know for sure that there's going to be funding available to them if they stick up and show around and all of these touch in some way, again, the commons frame. Software doesn't spring from the earth like these natural resources, a fishery or a forest. It doesn't come out of the ground naturally. Of course, you can enhance the development. You can make sure it has good conditions. But software requires humans to create it and steward it long term. And these really recognize the commons nature. It's going to take time to do things. Ethereum is where we are today, but there's still a lot to do over the next five to ten years. And the way we've structured this mechanism deeply considers the reality that this stuff takes time and you need people there to steward this common software over time. And so to that point, we can look at all this on-chain stuff through a Dune dashboard. If you're familiar, I recommend go check out our Dune dashboard. We try to surface as much information as we can there. So we've been building Protocol Guild, myself and a number of others and the rest of the membership since 2021. And today we have $57,000 per year that goes to the median member. I know we can project out, you can see in the bottom left, there's a big lump sum of about $40 million that vests over four years. However, markets are volatile. I can't really guarantee that that level of funding will necessarily be available at that US dollar value. So yeah, this is a great accomplishment, but I think we probably need to 10x this, and I'll get into a little bit more around the incentives and why we think this needs to be higher. But definitely go check out the Dune dashboard. It's a great way that we can lean into this radical transparency because all of the funding coming in, all of the funding going out, the memberships change, and number of individuals, it's all tracked in this Dune dashboard. So please do check it out. And now that this thing exists, we've been able to fundraise to it. And we've been really honored to have many large projects and small projects throughout the Ethereum community recognize the value of this common scale mechanism. And I just want to give a shout out to them really quickly. So massive, massive thank you to EtherFi, Tycho, Layer Zero, the Arbitrum community, Lido, Optimism, Uniswap, ENS, ZK-Sync, and MolochDAO for really seeing the value in this kind of thing and not just making a future commitment or saying, you know, this is a good idea, but actually committing significant funding to it. So yeah, thank you. And other things we can do with the mechanism now that it's on chain and leaning into this transparency is we can start to say, okay, as funding is coming in, how can we ensure that the distribution of funding is separated out or we have a good diversity of assets that are funding these individuals doing the work. So we have this diversity score that compares it relative to all past funding. So another cool thing that we can do when the funding lives on chain. And one thing we introduced earlier this year is the 1% pledge. I recommend go and read the full post, tim.mirror.xyz. It's a great post. But one of the things that's really great is this diagram on the right, which visually displays the incentive imbalance that you have to work on the core protocol. So in the top right, you have a crypto project founder, right? They have a lot of risk going into something like this, but there's potential for significant reward. And when you're working on the L1 work, it's stable. You'll get a salary. You might get equity in some company, but you don't have this exposure to the broader ecosystem success or there's not going to be a new token for the Ethereum blockchain. Some people have the misconception that people who are core developers, they've been around since the ICO, and they just have a huge stack of ETH. I'm here to tell you this is not the case. Many people, for whatever reason, they didn't have it. Or if they did, they've sold it since then to pay for living expenses. And there's always new people showing up. So just to set that straight, core devs are relatively undercompensated to the broader industry. And one thing we can do through the mechanism is shift the incentive imbalance. We're not going to ever be able to match what you could get at a, let's say, a VC startup or a layer two that has a new token. Some of these newer projects that you join early, it's clear that you can have significant incentives. You'll never really be able to match that fully, but we believe it's important to at least slide slightly up on the reward curve and give people more consistency while maintaining the same level of risk. Because ultimately, at the end of the day, this work is really undervalued and less visible than a lot of the more high-profile stuff. So another shout-out. There's been a couple of projects which have really leapt into this idea of the 1% pledge. And again, shout-out to Etherfy, Pondau, and Tyco Labs for early on in this year saying, you know, we recognize the importance of this thing. We're going to donate 1% of our tokens to the mechanism, and that's been the bulk of the funding this year. So really thankful that they have taken this early thing and been some of the first people to actually engage with the mechanism in this way. And like I said, we do need significant funding to come into this mechanism to rebalance the incentives. There's risks around the commons being captured long term. This is something you always have to be vigilant about and paying attention to, because as I said, the software doesn't just come from the ground, fully formed. It's a human process. It's a political and social process to maintain and steward this over time. And like I said, there's still so much to do in Ethereum that we need to start putting ourselves in a posture of recognizing that over time, the commons needs to be maintained and stewarded and funded. And while there are risks, there's also significant successes in the natural commons space. Fishing practices, communal rice terraces, different farming systems have lasted for thousands of years. And then in the digital context, the internet, Linux, Wikipedia, they've had early successes, but we can start to see the challenges that they're experiencing as larger pools of capital show up on the edges or the margins of the commons production system and the challenges that they're experiencing now. And so we should really start to think of this. Next year, Ethereum turns 10, which is incredible to think about. There's still so much to do. But what can we do to start to take on this posture of funding the commons at the scale where it's best recognized and suited to fund these individuals who are doing this important work? So I'll end with this. Is it a core dev UBI? Is it a software standards org? Is it a union? Is it a compensation package? Probably to some degree, it has little bits of these woven together. But above all, it's a call to action. It's an invitation for the broader community to take on the responsibility to recognize their role of participants in this ecosystem. You know, the EF is not going to be the sole funder. It never was, but it should not be looked to as, you know, it's just the EF will take care of it or, you know, these large organizations will take care of it. All of you, if you're part of a project or even as individuals, you have an obligation to think about deeply the ways that we steward and we participate in these commons production processes. So my DMs are open if you think this applies to you. Thank you. Thank you. Thank you so much for that. And on your statement, actually, you mentioned that core devs are not paid enough compared to industry. So how much is enough? That's a good question. I think I showed $57,000 per the median member. They do get salaries in addition to this as part of their hosting org, whether non-profit or for-profit. So this is in addition to that. It depends on what part of the market cycle we're in, but we're aiming to 10x this and provide at least 500,000 to the median members. Some people will get a lot more, and some people will get a lot less, but this is kind of what we're aiming for for now. And yeah, keep in mind that any funding that goes into it is distributed over four years. So it's not, you might see this really large number on the Dune dashboard, but keep in mind that a lot of these tokens are very volatile and it'll shift over time. And who decides who's eligible for the Protocol Guild? So the members have an eligibility framework, which we try to make as explicit as possible with the awareness that, you know, things change over time, right? I keep referencing how the commons is stewarded over time. What we think is the edge today may not be the edge of Ethereum core protocol in 10 years, right? We need to have the humility to recognize, okay, we think we have a good picture now, but it's always going to change. It's always going to shift a little bit. So the members themselves are deeply engaged in this decision-making process around where the edge of eligibility is. Yeah. What benefits do donators have for giving away 1% of their token supply for free. What's the pledge used for? So for free is maybe a bit of a bad way to think about it because what you get is the continued operation of Ethereum, right? The maintenance of this software, which you're building a business on, you're building a project on. And again, like I mentioned, we often take Ethereum mainnet for granted because it's so stable and because it really doesn't have issues and in addition to that We're we're getting much over time. We've getting much much better at Doing network upgrades improving the scalability improving usability and security So people often take all of this work which happens maybe behind the scenes or out of the public visibility, they take it for granted. So I wouldn't say you're getting it for free, like you just contribute it and you don't really get anything in return. You're getting something in return already. So I'd first say that. But the money, so what is the pledge used for? It goes directly to the individuals that are listed. There's no discretionary budget where we decide, okay, we're going to fund this particular project or this software initiative. If you meet the eligibility, you get a weight, and then the funding goes directly to you. And we don't make any obligation. You could start to get into the ideas of credible neutrality. You don't want funders coming up and saying, I'll give you this if you do this. We don't make any guarantees to people that contribute funding. We only have time for one more question. How do you make sure contributions are fairly rewarded, especially when individual impact can be so varied? Fair is subjective at the end of the day, right? So we take an opinionated stance that ultimately it's the collective body of software developers that ultimately steward Ethereum in the long term. Of course there are people that are objectively more impactful or more valuable to the commons, but what we can do is pull up everybody together. The rising tide lifts all boats. And that's really what we're focused on. Yeah. All right. Thank you once again. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731556800000,
  "slot_end": 1731558600000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1pXSBtge-cUH6xweP8_EkxdNV7HFwwguB4oabzfh2UJ4",
  "resources_slides": null,
  "speakers": [
    "tarun-chitra"
  ]
}