{
  "id": "interoperability-between-l2s-latest-developments-framework-and-challenges",
  "sourceId": "3ZH9ST",
  "title": "Interoperability between L2s: Latest developments, Framework and Challenges",
  "description": "The number of L2s is growing rapidly and it’s crucial to create strong interoperability solutions to reduce liquidity fragmentation and friction for users. We provide a framework for analyzing interoperability solutions that defines 6 levels of interoperability. For each level, we deep dive the consequences on UX, DevEx, scalability, fee structures, and MEV potential. We also provide an ecosystem map categorizing the level of interoperability offered by existing projects.",
  "track": "Layer 2",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Fragmentation",
    "Cross-L2",
    "Developer Infrastructure",
    "interoperability",
    "Cross-L2",
    "Developer Infrastructure",
    "Fragmentation"
  ],
  "keywords": [
    "Composability",
    "Interoperability"
  ],
  "duration": 434,
  "language": "en",
  "sources_swarmHash": "f312319bdc29280d6466e892fe79207f272961439803ba5130a9043225029290",
  "sources_youtubeId": "-G6oOQTb5AI",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735e5539dbb7a90e1a8b6f4",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735da889dbb7a90e132b668.vtt",
  "transcript_text": " Tanya Cushman Reviewer:\" Peter van de Ven Hello. So, I'm Dave, a co-founder of Alliance to Feed the Earth in Disasters, or AllFed, also a professor at University of Canterbury in New Zealand. So AllFed's mission is to build resilience to global catastrophes, and its vision is feeding everyone no matter what. AllFed is all around the world, has board members including Robin Hanson, Andrew Sandberg, Jan Tallinn and Martin Hellman who won the Turing Award for cryptography. One example of the catastrophes we work on was there was an eruption in 1815 that caused the year without a summer in 1816. And there was famine in many parts of the world, including Europe. And there's the catastrophes we focus on disrupt food supply greater than 5% of total food production in the world. And there are many such catastrophes. One of them is abrupt climate change. Another one is extreme weather on multiple continents at the same time. And a UK government study estimated that that alone had an 80% chance of happening this century. But there are other catastrophes. There could be a super pest that attacks crops that's resistant to pesticides or a super weed that outcompetes crops. You could also have disruption of pollinators, disruption of beneficial bacteria, asteroid impact. And most extreme is nuclear winter. So if we have a large-scale nuclear war, we'd have burning of cities, smoke would go up into the stratosphere and stay there for up to a decade, and the global climate would be severely disrupted, around 9 degrees Celsius drop globally and the agricultural output would fall about 90 percent and to put this into the perspective you can see the yield the number of tons per hectare per year of global food production and if we had a severe nuclear winter, basically our yields would go back to before the Industrial Revolution. So what can we do about this? Well, we could relocate cool, loving crops closer to the equator, things like wheat and potatoes. Also, mushrooms don't require sunlight to grow. But there are a number of other options. We could scale up seaweed. Seaweed can grow around 10% per day, even in nuclear winter conditions. We could turn fiber or wood into sugar, so that's cellulistic sugar. We could take crop residues and make leaf protein concentrate from them. We could build greenhouses and we could also do fermentation. So there are several companies that are now turning natural gas into protein and also some companies turning hydrogen into protein. But these companies are not thinking about how to do it fast in a catastrophe, so that's what we focus on. We also look at catastrophe scenarios that could disrupt infrastructure, such as electricity. And these include extreme solar storm, a detonation of a nuclear weapon at high altitude, causing an electromagnetic pulse that could destroy electronics, or a cyber attack, which could be AI-enabled, or an extreme pandemic that could cause people to be unable or unwilling to report to critical industries. And then this would cascade across industries. cascade across industries. So as we've talked about today, future pandemics could be far more severe than COVID. They could have the transmissibility of measles and the fatality of rabies and have no vaccine. And we're not prepared for that. And we could have a collapse of of critical industries. We've done some research on potential backup plans for meeting basic needs of food, energy, and water in these scenarios. But there's another line of research I want to talk about. And that is, could we scale up some of the technologies that we've heard about today, like UV or in-room filtration like we have in this room. And it would be better if we could scale these ahead of the catastrophe, but we're not ready yet. And that's probably going to take more like tens of billions of dollars. So what we're interested in doing is figuring out whether we could scale them up very quickly with our current capability in a catastrophe, in an extreme pandemic. And another option is massively increasing ventilation from outside and also sequestering workers. And in terms of cost effectiveness, we think that for the resilient foods that I talked about earlier an investment of something like $100 million could get us research and piloting of the technologies and planning and we have some peer-reviewed papers making the case that this is a very cost-effective way of saving expected lives and also improving the long-run future. But in this case in particular, we don't need to build big industrial pilots. This could be done potentially for millions of dollars, so it would be extremely cost-effective. So some of the pilots, the paper factories actually have most of the equipment already that we need to turn wood into sugar, but we'd like to actually try it out and convert a paper factory into a sugar factory. Another pilot we'd like to do is a resilient satellite. So if we had an extreme solar storm or EMPs, the satellites we have now would be destroyed quickly. But if we had a satellite that was resilient to these catastrophes, we could get emergency communication. And with just one satellite in a polar orbit, it would be able to get information to everyone on Earth with just regular cell phones once per day. And here, again, the investment is just in the millions of dollars. So now I'll have Yash talk about some opportunities with crypto. Thank you, David. You might have all seen already some of the solution sets that we could have for such a scenario. But there's still more work to be done. So for the next couple of minutes, I want to explore with all of you about how we as a community can come together and build resilience to global food catastrophes. There is a lot more work to be done. Some of the things that we can do using the decentralization ethos and the defensive ethos from the crypto ecosystems could be communication of crucial information. We would want to have the capability and the capacity to distribute things like disaster resilient guides or response plans when these catastrophes occur. So one thing that we can do is we already have decentralized hosting and storage through IPFS, but we would still need mechanisms that would help us when we do not have access to internet. So we need to have such technologies to be able to communicate very crucial information that could save a lot of lives during such a scenario. We could also build software solutions to enable coordination with multiple stakeholders who would do decision-making. This need not be during a catastrophe, but this could also be done without a catastrophe, too. We can utilize all of the things that the Web3 ecosystem is working on. For example, more pluralistic decision-making and using prediction markets, as Robin Hanson was talking about today for more informed policy decisions but this time only to sort of predict the different catastrophes. We can also build, govern and launch our own community-owned resilient satellites. As David previously explained, we need satellites which can be resilient to solar storms or hams. So I want to leave this with all of you about a potential idea of a food resilience DAO so that we as a community, we can together build and govern resilience at a planetary scale. Does a DAO structure suitable for this? I'm not sure yet, but would love to allow all of your inputs. But there is so much we can do together and take control of our own resilience and defense as a community. But there are some other simpler things that we can do. For example, directly supporting the work that AllFed does through Ethereum. You can just send some ETH to AllFed.Eth. Some of the things that Alfred's working on currently is sort of mapping out the entire technology roadmaps, building a technology tree for food resilience. One of them could be research on precision fermentation. You can make fats from microorganisms, but we would need to still map out what sort of bottlenecks are there in the industries. And as David pointed out, when a catastrophe occurs, how can we actually scale up very rapidly? So we need to have that research and plans available beforehand. We can also do some really cool pilots. We can simulate a nuclear winter condition in the Australian interior. We can do a test launch of our resilient satellite as well. So if you're interested to contribute and help, my signal is up there at h.88. You can hit me up. So I want to leave you with this about potential community-owned resilience. And if you have any questions, we can now take it. I think you can go to the QR code on the side and have some questions there.",
  "eventId": "devcon-7",
  "slot_start": 1731579600000,
  "slot_end": 1731580200000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1DgmkfIFJfD0vf-bVsGTFZt1Nv09KHD5RE7ct8x0puek",
  "resources_slides": null,
  "speakers": [
    "marshall-vyletel-jr",
    "wei-dai"
  ]
}