{
  "id": "keynote-the-next-10-years-of-web3-in-africa",
  "sourceId": "GSNQLC",
  "title": "Keynote: The next 10 years of Web3 in Africa",
  "description": "When Africa reaches 2 billion people, what are the profound ways Web3 shapes its economy? Historically, millions of Africans repurposed and stitched together crypto tools for real-world utility. Now, a new generation of builders is developing tailored solutions. In the next 10 years, what can we expect to be built that redefines trust and finance in Africa? And what needs to be true for more than half of African economies to be powered by decentralized technologies?",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Product",
  "featured": true,
  "doNotRecord": false,
  "tags": [
    "Ethereum Roadmap",
    "Use Cases",
    "macro/micro economics",
    "adoption",
    "africa",
    "mass",
    "Ethereum Roadmap",
    "macro/micro economics",
    "Use Cases"
  ],
  "keywords": [
    "Africa",
    "Mass adoption"
  ],
  "duration": 1531,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6733f64b3a168eb53542528d",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6733f64b3a168eb53542528d.vtt",
  "transcript_text": " Leonardo Silva Reviewer:\" Elisabeth Buffard Hello everyone. Good to see you all today. I want to start off by asking who is here from the continent of Africa. Can you please raise your hand? Can you guys please stand up? Can you guys please stand up? Let's give this guy a big round of applause because like many of our folks have gone through crazy lengths to get themselves here with visas and everything. And this is the DEF CON that has the largest African builder concentration in one place. And my talk today is around what can we expect over the next 10 years in terms of crypto innovation and is very much inspired by a lot of what I've learned from all these folks and many more of what are the things that have been built today and what can we expect coming up. So two years ago at DEF CON, we established the fact that it's actually the crypto ecosystem that needs Africa to reach its full potential of reaching mass adoption and utility-driven building to scale it to billions of people. And we covered the fact that we are the most populous part of the world and we're growing really fast. That is going to be where all the young people in the world are going to be based at even today we have about 600 million Africans who are the end under the age of 14 that's out of 1.5 billion people and we also discussed around the technology rails that exist that how allowed us to basically skip generations of innovations such as mobile phones skipping landlines or mobile money where that has close to trillion dollars worth of transactions a year and we're jumping traditional banking with crypto. Two years ago when we discussed a lot of this, what was the reality is that mostly many of us were doing crypto to fiat transactions doing payments savings and storing resources or investing using predominantly centralized exchanges and a lot of centralized exchanges are actually not made to be banks they're trading platforms but we kind of figured a way to do that by having various liquidity providers like people like you and I providing liquidity on peer-to-peer their trading platforms. But we kind of figured a way to do that by having various liquidity providers like people like you and I, providing liquidity on peer-to-peer exchanges to drive a lot of the value for normal people to access traditional forms of banking that we need. So where are we today, two years from then? Well, the one reality is that in the traditional world we're still in the same place, that we are communicating value over walls, that the internet, as amazing as it's been at connecting us and letting communication flow, communication of value, which is through monetary systems, are actually very much gated. The internet continues to be very gated. The same way back in the days you would have an operator basically connecting two calls by manually calling the other side and seeing can we trust the other operator. That's the same process that we have today. So we are still working through walls in the traditional system. The other aspect of where we still are today is that a huge part of our economy is happening in the informal sector. That includes our GDP, our prominent GDP is backed by micro enterprises. A huge part of our employment is in the informal economy. A huge part of our GDP is also drive by the informal economy. A huge part of our GDP is also drived by the informal economy and also a lot of our money movement happens outside of the banking system. This is a very important context for us to understand why crypto is thriving so much on the continent. Another big also lens is that we have a systemic US dollar problem. Some of these numbers are a bit outdated but we're importing more than what we're exporting we're taking a lot of debt a lot of african countries debt has doubled in the last 10 years and we're paying that debt plus interest in dollars and we're trading with each other as neighbors using dollars and when our currencies fluctuate so much, then we move our money to dollars. So that creates a demand supply. And on the supply pressure, we have a lot of exports, remittance, people sending money. There's a thing called BRIC. Some of you guys might know about it. Around some countries deciding to settle outside of the dollar system, which is creating a bit less pressure on the dollar. And there's a lot of aid and loans that come in dollars. So what is the consequence of this? Is that basically the US dollars are being rationed by the central banks. The demand for dollars is higher than what they have there. So what you end up having is the bifurcation of the bank rate and the black market rate, or how I call it, the actual market rate um and in worse economies you see that being very large in well-managed economies it's very small but we're living in in parallel systems and also that makes the dollar a commodity so people do unnatural things in order to access dollars because the upside on trading the dollar is higher than the trade on the commodity itself, which creates very weird dysfunctions in our system. And some countries have also created rules of who can own dollars and how much you can transfer it. Until very recently, the Ethiopian government actually made it illegal, meaning you can go to prison for it, for holding more than $500 with you at any given point. Many of my friends' and family's houses were raided, just people looking for dollars. And that's because the central banks don't have enough dollars. And what that means, we borrow more money and then just rinse and repeat. So we have a systemic dollar problem. And so you look at that and say, okay, well, what is crypto doing? Well, fundamentally, what crypto has provided us is basically a digital version of the dollar, US dollar stable coins, that allow for large-scale liquidity coordination mechanism in the informal economy, where a lot of dollars have been circulating physically or through various networks like the Hawala networks that call each other and basically move numbers around. What has that allowed us is basically for early stage startups to be able to aggregate more liquidity than what a bank can in a very short period of time and then settle that payment in a much shorter period of time. And this has been a fundamental value proposition of crypto. So as a result of that, crypto has been thriving, it's been growing. Even in the bear market, crypto transactions have been growing on the continent. Chainalysis says we've had $125 billion worth of transactions last year. When I talk to the analysts and the builders, that's just the tip of the iceberg. There's much more dollars that's been transacted behind that. Nigeria of course is the second most popular place for crypto. And Nigeria, Ethiopia, Kenya, we search crypto online because it is solving fundamental problems for us. But this is not just centralized exchanges. This is happening in other rails that have been built. So actually, some of the builders here in this room have built some of these stacks. These are from the builders in Magma, from wallet infrastructure. So actually making like SDK wallets that you can embed into your fintech application or your crypto application. So you can use crypto and fiat. Aggregating liquidity on-chain and off- off chain which is actually not very easy to do and and simplify the on and off run process through that different types of wallets that are being created and all types of payments from b2b b2c b2b b2c serving like small businesses medium, medium-sized businesses, oil and gas companies, and even banks and payment service providers who are now using these startups to facilitate international payments. And people even issuing debit cards on top of your digital wallet in order to be able to pay online without having any limitations, because some of our banks say, I'm so sorry, you can only pay $10 a month. Well, if you have some resource, you want to buy a book from Amazon, how can you buy it with $10? Amazon is more expensive than that. So you're actually using crypto projects in order to do that. And so some of these projects are way advanced than where I see a lot of on and off ramps. And so, bluntly speaking, if DEF CON was held in one of the countries that were mentioned in Africa, the DEF CON organizing team can pay all their bills using crypto. All of us would basically be using our crypto to make payments with fiat without even needing a fiat wallet paying directly just using the applications that have been built today so there's been a lot of work that has happened in terms of making the user experience a lot easier and if you're curious about it just talk to many of the builders who are in this room so with that in mind what can we expect in the next 10 years what are some of the innovations that we can expect to have? Well, fundamentally, I think the most interesting part of crypto to me is bringing whole economies and powering them by decentralized systems. Part of that is basically changing the foundations of our existing economy, and part of it is like opening up new economic activities that we did not know existed before um and this is where i think ethereum comes in because that's the most robust and the most resilient decentralized system that we have right now so it's it's a beautiful merge here and when we think about rewriting a lot of the foundations of our economies we've got to think about both hyper globalizationglobalization and hyper-localization. We talked a lot about US dollar stablecoins, right? So the answer is not, let's dollarize the entire African economy. Everyone uses dollars, dollars for everyone. That's not the answer. I don't think that helps us and it doesn't help the global economy. So we've got to also think very locally. And one idea I'd love to dive deeper on is this idea of actually local currency stable coins. At the moment, when we think about stable coins, it's kind of synonymous with US dollar stable coins. How about actually having our Kenyan, Nigerian shillings, Nigerian naira, Ethiopian burr, a lot of our local currencies having a digital version of them on-chain. What does that allow? Well, on-chain forex. That makes it a lot more efficient. We'll double-click on that. Cheaper local payments. In a crazy way today, with blobs, it is cheaper to run transactions on a layer 2 at least 5 to 10 times than it is on mobile money or banking, which is quite crazy. Well, that doesn't mean blobs will scale infinitely, but it's just an interesting data point of what we can even do today. And the last part of the value here that we can think of at this stage is that it gives us programmable money, and that opens up a whole lot of opportunities and innovations that can happen. I really want to double click on the on-chain forex. Well today Kenya and Tanzania are neighboring countries right next to each other. We even speak similar languages and both our currencies are called shillings. But in order to make a payment from Kenya to Tanzania you actually have to convert it to the dollar. Dollar has to go through the trade system. It has to flow through London or New York or somewhere. It can take a few days, and depending on the volume, it can take even weeks. It's a very long process and long system. It doesn't make sense that we're having to do this as neighbors, right? With local stablecoins, you could potentially move from the Canadian shilling stablecoin to a Tanzanian shilling stable coin, both denominated in value against the dollar, but not actually touching the dollar. So this helps us move the US dollar from just being a medium of exchange to being a unit of account, which is a very interesting use case for it. So one way that can work is building a pair of liquidity where an importer is putting money into the pool from the Kenyan side and an exporter is pulling money out of it. And the person does the exact same thing on the Tanzanian front. And because every trade does not fully balance, you use dollars to basically rebalance the pool by adding local currency on the other side. This is just one model. I am sure we can come up with way more complex and more interesting models to structure this. But bringing forex on chain is one of the most interesting problems for us to solve using local stable coins. Now, when we think about that, we can think in a few million dollar value, or we can think about half economies. And I think the most important thing that we keep missing in the space when we look at the full potential of crypto is that we're not always looking at how can half an economy run on what we're building, and what needs to be true for us to get there. And the reason why I'm saying that is because, you know, many of you know M-Pesa, right? M-Pesa is one of the best success stories that has come out of Kenya. Half the Kenyan economy runs on M-Pesa. What M-Pesa is, is just a private ledger. It's a spreadsheet where they put some fiat in the bank, and the numbers move from different account names and at the end of the day it's basically settled at the bank layer that's somehow a version of what we're talking about but what we're talking about is putting that on chain and a much more open transparent system right for us to get to that level of scale at a much faster period we've got to think about from different principles and and one lens that I can think of is using government bonds to back our local stable coins. You convert the local bond into a real world asset that can either be fully collateralized through a CDP or a better model that we can come up with. And by the way, if you do, I'd love to chat with you. And basically use that to distribute local currency through existing and new rails around. The forex on-chain is one of the lowest-hanging fruit examples of where we can go, but we can bring so many other values to that. And in the future, it doesn't just need to be government bonds to do this. We can bring other types of assets assets like local land, productive land or protected land or gold and silver and precious metals. We're generating so much of that from Africa at the moment. Or we can do other types of commodities. This is such an open book in terms of what we back our local currencies with. Another pillar after local stablecoins that I love to chat about is simple finance as a stack. Now, here in the Ethereum world, we talk about decentralization a lot. Well, for us on the continent, decentralization is actually a very practical solution to a very practical problem. We have a lot of banking rails to build for hundreds of millions of people, and many of them have not been born yet. To do that, trying to build that in a monolithic way as a centralized company, as one piece, like Alipay or WeChat or Grab for 54 jurisdictions, and scale that in a very short period of time is almost impossible to execute. So the best way for us to do that that in a very short period of time, is almost impossible to execute. So the best way for us to do that, in my view, is just to build a connected web of tools. Different pieces of the Lego that form a financial stack that come together, that offer users a better experience and better options, right? I think building this in a much more decentralized way, to me, is the only way we can get to the level of scale that we need to achieve. So for us, it's actually a very practical solution, a practical way of getting there. And we can build interoperable monies with network effects. Remember the walls, the operator? We can just bypass that and keep moving value across different populations and people in that way. Create cash apps with simple user experience powered by crypto, but we don't even have to know that it's crypto. Today we have startups that are doing that, but we can scale that to infinity. And on the hyper-localization lens, there are many ways we can build around existing trust structures. Across many African countries, we have basically cooperatives and little communities of people. Some of us call them table banking, some of us call them chamas, where basically people pull money together to save and lend to each other. There's a strong trust infrastructure that exists to enable things like that. We don't have to reinvent trust from scratch. We can leverage those existing trust structures to build very resilient, hyper-local economies. And I think that should be part of our roadmap. And beyond, you know, so ultimately, it's just two people or two companies or two agents having normal financial transactions, right? No complexity, not much. We're not talking about crypto at the front end. This is all enabling that. Other areas of innovation that we can think about is like around credentialing, identity, reputation, credit scoring, bringing things that don't exist on chain to create trust on chain are some of the more interesting areas for us to experiment on. We don't have time to dive deep into many of these, and there's a lot more than other areas of innovation that we can build in the next 10 years, but talk to the builders around the table. And the other areas bringing assets on chain, such as real estate. We talked about bonds earlier, but different types of commodities, energy, power generating structures that we need to fund and actually revenue generating. We can experiment with so many of these that actually powers the fundamentals of our economies. So with all these ideas and directions that we can go, you might be wondering, how do I help? How do I connect? How do I participate in this? Well, the first is it's an invitation. It's actually an invitation because there's a lot of building happening on the continent, whether we have a lot of builders coming to DEF CON or not. So it's an invitation for you all from infrastructure, from research, from different ecosystems and chains, from capital allocation, from mentorship and support, from actually working with some of the smartest people on the planet. There are many ways you can plug it into the movement that is happening in Africa. And of course, why not bring DEF CON to Africa in two years' time? Who's down for something like that here? Right? Well, yeah, I think that would be super cool, and you guys will have a blast joining DEF CON there. But it's actually not about having another big event on the continent. It's actually, it gives you a much deeper context to go and see this in practice. It is very, very hard to explain how broken the world gardens are until you actually go and experience it in person. Or it's very hard for me to explain to you like what seamless user experience for crypto looks like without actually going and experiencing and making a whole lot of payments and living your life using your crypto wallet without touching physical bills, right? So it's an invitation for you to actually be part of the movement and work that we have. And lastly, because all the Ethereum events that have happened around the world have happened in places where it's just very hard to get visas, right. So to get 177 folks here, man, that was like a lot of work and it's been a lot of collective effort. And there are hundreds and thousands more that you would absolutely enjoy connecting with and learning with and learning from. And so you're invited home. Welcome, guys. All right. That was an awesome presentation, you guys. We have a Q&A session. So anyone want to put a question, that's the QR right there. Just scan it and put a question there. We have a lot for you, brother. Yes. Let's take a look at which one you want to answer first. We can talk about the non-financial use cases. We can talk about the non-financial use cases. We talked about them later on. Yeah, this talk focused a lot on finance because it's just a lot to unpack. And each topic that we talked around, credentialing, around bringing assets on-chain, and credit scoring, and gaming, and communication, there's a lot to unpack there. I will actually invite you guys to talk to some of our builders here to understand a lot of the nuances. But at the moment, 500 million Africans don't have any form of legal ID. And the best that some of our countries are doing is basically having a data center in one location or two locations and putting the entire population's data there. It's like a honeypot of sovereign data. That's not the most secure way to do it, in my opinion. the entire population's data there. It's like a honeypot of sovereign data, right? That's not the most secure way to do it, in my opinion. So I think there's a lot of ways we can innovate around that. KYC is one that really came up, like transferable KYC across multiple tools. So the list goes on. So the invitation is to actually talk to the builders in the room. Any questions you want to answer? We have a lot more here. All right. What do you see Africa becoming? What do you see Africa becoming a well-coordinated roadmap? I want to talk about regulation. All right, let's go. Because that continues to be a hot topic. And it's really important to us because many of our innovations are interfacing the traditional world with the crypto world because that that door needs to be very fluid it needs to allow money to keep moving back and forth for a long period of time and until we bring it on chain um and i think that's a that's a very important problem so i talked to a bunch of regulators many of the builders here talk to many regulators there's there's curiosity, there's some fear because crypto can be a path for capital flight. A lot of value to live in a short period of time. And that's an actual risk. And some of them don't even understand the fundamentals of this technology. So what we end up having is some countries like South Africa saying, crypto is legal. It's a commodity. We will allow it and so we have a lot of builders working there some countries creating environments for experimentation like sandboxes and actually this is a bit of a controversial view but I think creating some sort of tax revenue from crypto transactions for governments is a potentially positive thing if it's done well, because it moves this category from a risk basis to an income generating category. And bringing local stable coins on chain is, I think, one of the biggest value props for governments, because what it does is it creates a much more efficient capital markets for dollars and bonds it brings dollars in and helps reduce the dollar pressure for local trade that can happen so they have an incentive to see something like that but there's a lot of people here doing the hard work of actually informing regulators and we keep building like we keep building even with gray area we keep building like the show doesn't stop. And I think that's something some of us in, like, the Western world find it hard to kind of navigate around, is because, like, even when Nigeria makes crypto illegal, like, we still have close to 15% of the country's GDP, like, proportion transactions happening in crypto, right? So, yeah, it makes you kind of wonder what some of those kind of guidelines can actually have an effect. I think we have about one or two questions more. Let's see what we want to answer. Am I hiring? Are you hiring? I mean, I don't know, guys. We can jam outside after this and recruit more folks to help answer the question. But yeah, I guess what needs to happen before a DEF CON happens there is there's a lot we've got to do on the continent. We have many communities doing real work. They need a lot of support and engagement. So I think that will bring a lot of value. We need to have more hackathons and builders. But, like, I think our builder community, like, the startups that we have there are, from a user experience perspective, in my opinion, are, like, way ahead from what we keep talking about around usability making crypto usable for daily life like whenever I'm in many African countries like I don't use my card, I don't use cash I'm just like paying all types of bills using my crypto account and I think that's super cool and that's amazing so like even the bill of community alone is enough to host you all. All right. Give a round of applause for the speaker. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731407400000,
  "slot_end": 1731409200000,
  "slot_roomId": "stage-6",
  "resources_presentation": "https://docs.google.com/presentation/d/1IAQR41JAk7FPn24OGhprL4uyoP17OlBMG8dv6oyQ_n8",
  "resources_slides": null,
  "speakers": [
    "yoseph-ayele"
  ]
}