{
  "id": "keynote-nomic-foundations-vision-for-ethereums-tooling-ecosystem",
  "sourceId": "VQKXUH",
  "title": "Keynote: Nomic Foundation’s vision for Ethereum’s tooling ecosystem",
  "description": "Nomic Foundation is the nonprofit behind Hardhat. Nomic’s co-founder and CTO will walk you through Nomic’s long-term vision for a community-driven developer tooling ecosystem for Ethereum.",
  "track": "Developer Experience",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Developer",
  "featured": true,
  "doNotRecord": false,
  "tags": [
    "Developer Infrastructure",
    "DevEx",
    "Tooling"
  ],
  "keywords": [
    "ecosystem"
  ],
  "duration": 1055,
  "language": "en",
  "sources_swarmHash": "ecaa24cd9ab18856aeb56a49704f9ed634d71821a77c890de54f9cc929267bd9",
  "sources_youtubeId": "w1ObXCY1n-o",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736c0839dbb7a90e1bcdc3d",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736c0c59dbb7a90e1cc98e5.vtt",
  "transcript_text": " Leonardo Silva Reviewer:\" Elisabeth Buffard ...region in Latin America. So, two years ago, we had DEFCON 6 in Bogota. It was an event that brought thousands of minds to the city to get together and start improving the ways that we did things before DEF CON. So in DEF CON, it was a fantastic gathering in one venue, a big venue that we had in the city there in Bogota. It was a place where we were able to meet in between and start working together. A lot of things started at that moment in the whole region with leaders from every country of the region. And it sparkled, it started something that was starting joining together more community in the different cities of the region and having community events that brought a lot of people inside the different countries. There were a lot of new steps on how to bring blockchain education to the region through different methods all over the place, all over the different countries, starting using new programs to involve developers in the Ethereum ecosystem. And it started growing through alliances with universities and networks of universities. This was something that wasn't happening a lot before the DEF CON, but afterwards it started to pop up in different places all over the region, and it happened more to hackathons and these alliances with universities. And it just came all over the place. So right now, between all the different communities around Ethereum in the region, we have onboarded over 2,000 developers, mainly Web2 developers into the Web3 ecosystem and the Ethereum ecosystem itself to different programs and it's people who before DEF CON they had no idea of what was going on in the industry, but now we have this new sense of consciousness of what are the possibilities and mainly taking the message to the people in the region that it's not an industry only to be a user, but you can be a builder. And it's something that it's been made to attending three main points, that is community, education, and development. Two, community, education, and development. Two, alliances, events, and production. And it is growing and growing. There's more and more alliances happening all over the Latin region, between the communities and universities, all the different communities, and universities, all the different communities, social places, and in general, the actors of the ecosystem, like putting everything together to make things happen. And right now, there has been great improvement in the ways to do and to bring the education to the people through online programs and putting together developers and students from all the region together, developers and non-developers who are starting to build in this program. Have we had some impact? I'm just going to mention a few cases of the students that we have had that, I don't know, 18 months ago they had no idea about the industry, and now there's the case of Neil, who at 17 became a Deaf Connect 2023 scholar, and he was able to travel to Turkey and share his experience as a new developer with developers from all over the world and also after this time Christian and Juan Diego who are here today they after taking this these courses and joining to these processes and giving time to it they have been able to find jobs in the web3 industry and go to... They used to work at a call center before that, and now they are part of the industry, and they were able to travel here to DEF CON. So what needs to go next? We need regional coordination. We need to nurture an environment of trust between community builders and community users, so we can take all these to the next steps after the education and create spaces in common between the different actors of the whole region. So we need to push to encourage frequent blockchain interaction within the different actors of the whole region. So we need to push to encourage frequent blockchain interaction within the different communities and find places where we can share hackathons, opportunities to work open source and bring this to a next level. Before the end, I just want to mention between into this great impact that has been in the region there's have been also very difficult times he was Emerson David Silva he was part of the Ethiopian Colombia leadership and he was assassinated by the war this terrible war we have in Colombia so we lost him this year in March 27 and I asked myself why can't I do Emerson to preserve and honor your legacy he's present every day in my thoughts and the community and the leadership dots we want to make his legacy to go further so we have we need to support Emerson's family so if if you scan this QR code we have, we need to support Emerson's family. So if you scan this QR code, we have a Givet project. So we are trying to get funds to help his family and to keep on helping on the operations on education in Colombia and Arauca. So thank you very much. It's been a pleasure. And thank you very much. It's been a pleasure, and thank you. Thank you. We're going to do one quick question of Q&A. You mentioned you onboarded 2,000 developers to the ecosystem. How did you estimate this number? This number is estimated between data that we have from the different organizational processes that has been taken into the region. So we have more than 15 organizations onboarding new developers. So this number comes from what has been done in the last 18 months. And what do you think are the best next steps for the students that just learned about Ethereum? The next step is the most important thing because we need them to take what they learn to the different educational processes and apply that into hackathons, working in open source, working together, meeting other people. And this is something that we are pushing right now. Thank you very much. Thank you. That concludes the session, everyone, on the ripple effect of DevCon.",
  "eventId": "devcon-7",
  "slot_start": 1731567600000,
  "slot_end": 1731569400000,
  "slot_roomId": "main-stage",
  "resources_presentation": "https://docs.google.com/presentation/d/1kH4iHwoLEeXM3eu44ZJv-USuH2XZbecC-mTN78JbaFE",
  "resources_slides": "https://drive.google.com/file/d/1PfbexOSxKAevYkHs9Zco-j-XI2nR5Onw/view",
  "speakers": [
    "patricio-palladino"
  ]
}