{
  "id": "keynote-world-politics-world-building",
  "sourceId": "ERQKUX",
  "title": "Keynote: World Politics, World Building",
  "description": "World politics has changed. Geopolitics is no longer simply a contest to control territory: in this age of advanced technology, it has become a contest to create the territory. Great powers seek to build a world for other states to inhabit, while keeping the ability to change the rules or the state of the world when necessary. At a moment when the old concepts no longer work, this book aims to introduce a radically new theory of world politics and technology. The end goal: god mode",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Academic",
  "featured": true,
  "doNotRecord": false,
  "tags": [],
  "keywords": [
    "World Building",
    "Technology",
    "Geopolitics"
  ],
  "duration": 1540,
  "language": "en",
  "sources_swarmHash": "814ca0945d9b0b5cc40d580f6819e1a7b896f35b60c8c32954f4e6a92ca7e40c",
  "sources_youtubeId": "uz0GN4Jcywk",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673701f81b0f83434dc99e4d",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673701f81b0f83434dc99e4d.vtt",
  "transcript_text": " . Starting speaking. Thank you for being here. I know at DEF CON you have many, many options. I'm glad you chose to be here. Two years ago in Bogota, I spoke about money as virtual and as necessarily virtual. And today I want to take that a little bit farther and talk about geopolitics as virtual. Let's see how that works. It's the topic of my new book that is coming out in February, but this is actually the first time that I test these ideas in public. Here's a nice little video by Calder Moore, an artist that I recommend you check on Twitter or Instagram, and I hope he doesn't mind that I promote him a little bit here. This is really the idea behind my book, that the world as we know it is always in the process of being built from scratch, from nothing. And the process is naturally contested. Great powers tend to build on top of the work of the building done by other great powers. You know that geopolitics as a word was invented at the beginning of the 20th century, and it was meant to mean the fight or the struggle to control territory. Over the next hundred years, the word lost a lot of its meaning. Why? Because we suddenly started to realize that physical territory might not be that important. There were things that were more important. Communication networks, the economy, energy systems, communication systems, currency systems. And so we moved to something that people like to call international relations. But then something quite odd happened, and I think in the last 10 years. We realized that even if the world is artificial, even if it is built, that doesn't remove competition. Geopolitics moves from the control of physical territory to the control of artificial territories. In fact, I would argue that geopolitics becomes more intense and more existential, because if you are building an artificial world, others have to inhabit that world. Others are in a way captured in the world you built. This is a diagram from my previous book that really set up the problem but didn't quite solve it. We have states, self-contained entities of some kind, that then open up and start developing very intense relations between themselves and so create a kind of space of interaction between different states but then a question arises obviously if there is this space of interaction well who builds it who regulates it who creates the rules for this space of interaction? Is it the states? Well, the states are part of it. Is there something above the states? What is that something above the states? Now, many people would say that's nature. That's the physical world and states compete in the physical world. And I left the question at that point in my previous book, but let's see what my current answer is. There's a sentence, kind of a motto, a proverb, very common in the tech world, particularly in Silicon Valley, truth seekers take feedback from nature. And you could see a certain theory of geopolitics where the feedback would come from nature. Is nature the background for world politics? Well, you could say that the states that do better in state competition are the states that succeed in mastering nature, in controlling nature, in operating in nature. We all know this from engineering. The companies that do better at building aircraft are the companies that understand the laws of physics and understand the processes of engineering. And there was something about this. This view is still popular. You could say, for example, the West has risen to global dominance because he was better at mastering and controlling nature through processes of science, engineering, discovery, and so on. There's even a certain theory of the Cold War. You say the West came out on top because in the end, it was more successful at these processes, either of mastering nature or competition in the marketplace. But you see, in all these cases, there is a background for state competition, and that background is, in a way, natural. But now, imagine if a country becomes so powerful that it acquires the ability to create a virtual world. And this virtual world is so much more attractive than the physical world that other states, other countries eventually migrate to it. What then determines state competition? Well, the interesting thing is that at this point, the world is no longer natural. The world has been built by a powerful state actor, by, I would call it, a superpower. In practice, this means that the world might become an American world or a Chinese world, which are expressions that we hear a lot. And I would suggest that we take those expressions as literally as possible. In fact, the world can become Chinese. The world can become American. Why is that the case? Well, in a virtual world, essentially made up of communication networks, essentially made up of systems that are purely artificial and virtual or tending towards becoming virtual, they are necessarily built by one state actor and they acquire the characteristics that that state actor has impressed on them. What has changed is that we no longer believe in a neutral playing field and the reason we no longer believe in a neutral playing field is that we believe the game environment is built by the players. This is the point where it's quite interesting to start talking about game environments or a world game. It's not the natural world, it's not the world of nature, it's a game that has been built. We live after nature and that must necessarily change the terms of geopolitical rivalry. When your opponent is building a fully artificial or technological world that could redefine your own reality, then geopolitics is not merely existential, not merely a question of survival or disappearance. It becomes ontological. The superpowers are competing to build reality, to determine reality. And others that are not as successful as that will live in a reality created by others. This is the premise or the gambit that I'm trying to explore. In fact, at this point, you start to understand what geopolitics is all about. It's about the building of these virtual worlds. And suddenly there are two levels. There are the levels of those who build the world and those that live or inhabit in that world. The level of those that are playing the video game and The level of those that are playing the video game and the level of those that are programming the video game. And this, in my view, is the nature of geopolitical power, this break between two separate levels. Superpower is a system administrator. Now, I'm quite excited to present these ideas here because I think this kind of language would sound very strange to my usual colleagues in geopolitics but it will sound a lot more familiar to you I'm interested in the reactions to that both today and feel free to to send me a message on on Twitter or or by email you can crack down on offenders and pursue your aims by manipulating this the system itself. I would say this approach characterizes the Western response to the war in Ukraine. We didn't go to war. Western democracies adopted a set of targeted economic tools that were designed to reduce the Russian threat to the existing system. In this kind of cybernetic model that I'm talking about, you could even compare our reaction to an antivirus software or even the agents in the matrix. What did particularly the United States do? It didn't go to war with Russia, but it changed the game environment for Russia in very detrimental ways. And the most obvious way it changed the game environment was to transform Ukraine into something quite different from what it was at the beginning, quite different from what it was on February 2022. And you know how the agents in Matrix occupy the physical bodies of people on the street. If you are a global system administrator, if you have control over the system panel of global politics, you are able to introduce sudden and rather dramatic changes in the game environment. Suddenly, this player, Ukraine, is no longer the same player that it was at the beginning. You can transform the game environment for other players that are not operating at the same level that you are operating. It's a way to transform the ground world that lower level users face on the battlefield. There is the system level, there is the ground world, and the system administrator can change the reality that the lower level users face. So in one sense, geopolitics is a struggle not to control territory, but to create the territory. Think of it as a clash between two versions of the world. Imagine a simulated landscape. Go back to the little video at the beginning. Two or more computer programmers are fighting to redesign what appears on the monitor. This is, I think, evident in the case of the Ukraine war. It's perhaps even more evident in the case of the Ukraine war. It's perhaps even more evident in the Cold War between the United States and China. What you see is not a direct clash, and I very much doubt we will see a direct clash. What you see is an attempt to penetrate deeper and deeper into reality as we experience it and try to take control over it. There is intense competition between the United States and China to redesign the communication networks of the future, and these will be communication networks that will apply to people but to objects. The world will come alive with 5G, 6G, 7G communication networks that replace the physical world by increasingly a virtual world. Who will build this world? And then, of course, energy as well. We enter a new energy system. Who will build this energy system? Will it be the United States? Will it be China? And what form will this energy system take? We already know well enough that it won't be purely an energy system, but this has happened in history many times. The second energy revolution at the beginning end of the 19th century, beginning of the 20th century, it wasn't purely about energy. It was a kind of a complex where electricity and the modern factory formed a single complex. Henry Ford started his career working for Edison, and many people speculate that he was able to come up with the idea of the assembly line because he had seen how electricity worked as a constant flow, and he adopted the logic of electricity to the modern factory. The modern factory together with electricity created a single complex that was dominated by the United States. Now, we already know enough about the third industrial revolution. The first was, of course, coal. Even then, there was a complex, coal and the steam engine. The third industrial revolution will also be a complex, and it's already pretty clear that it will be a complex of AI together with an energy source. There seems to be a difference about what the fundamental energy source will be, whether it will be nuclear or solar. In my book, I take a clear choice for solar, in part based on costs, but not only on costs. But we'll see what the final answer is. In the United States, clearly there's a certain preference for a complex form of nuclear power and AI. I see the geopolitical competition as this kind of struggle between two programmers to see who is able to redesign the world. Now an interesting question that is raised here is, does the world have to be interesting question that is raised here is does the world have to be designed by a single player or can we have something like modularity, composability, I think terms that will make sense to you where parts of the system may be designed by different administrators, by different builders and this is perhaps a way that one could find balance in world politics that China the United States and other superpowers will be able to divide the task of building these virtual worlds and we could even perhaps have a kind of a system of percentages where the world system would be built 80% by the United States and 15% by China. Some rules would be predominantly Chinese, but others would be American. In a computer program, this works because there's a principle of modularity. And one suspects that these principles could be applied to world politics as well. What I'm arguing essentially is that just as new technologies like nuclear weapons raise the destructive potential of direct conflict, there was another avenue open for power. You didn't have to win a nuclear war against a determined opponent. You could build an artificial world that others would be forced to inhabit. Call it a form of indirect government or indirect power. Perhaps your opponent will even assume that these rules are natural. Go back to the beginning. Perhaps from his point of view, these rules are not really your rules. They are just the way the world works. That is the highest possible form of power. When you design the world in such a way, there are the people take that world as natural rather than constructed. You have moved one level up in the great game. Your opponent is playing a video game. You are coding it. This is the highest aspiration of geopolitical power to build a world that others have to inhabit. Now, something directly addressed to you. Builders tend to think that this idea of a world game is more than a metaphor. I think you have the intuition that you're building something much bigger than just a gadget or an app. It's particularly clear in the case of Ethereum, where many times it seems to me your aspiration is to build an artificial world. With principles of decentralization that go back to my comments about composability and modularity. Builders are building a global platform that eventually will set the terms for global power competition. But many times when we talk about technology, we fail to ask whether technology exists as a kind of background for our actions or whether something else is the background. I am arguing very strongly that technology is the background and is the ultimate background. Sometimes we assume technology is a set of gadgets. The idea that it could become our environment, that it could become our only environment, is still, I think, for many people, too bold. We already talk about smart cities, which it seems to suggest technology rather than the physical city is the environment but that is still not enough we're moving in that direction but still hesitantly sorry just just tell me the sign language is confusing I'll share of course then I'm getting in front of the people I think if you're you mean crypto are even a step farther than smart cities because they already contain the idea of an artificial world, of world building, of an autonomous world that slowly, gradually, in ways that are not entirely clear, is supposed to replace or subsume to be built over the physical world as we know it. Now, the problem is, in this human-made world that I'm describing, there is no external authority. The engineering power has set the rules in advance and enjoys root access to those rules. In my book, I'm very attracted by this idea of a computer programming language is more helpful to understand geopolitics than any other kind of language I know. And one should wonder why that is the case. Obviously, the answer is that we increasingly live in virtual programmable worlds. Other actors may take the external environment as natural or inescapable. They have no way to access the most important levers and switches of power. The world, in this case, becomes American or Chinese. But in a Chinese world, the outcomes are naturally predetermined to favor China. China has God mode. And conversely, in an American world. The great game, an expression many times used about geopolitics, is a game, but it's a meta game. It's a game whose purpose is to create the rules of the lower-level game. To conclude, I reserve the term superpower for those states that are engaged in a battle to shape the global system everyone else is competing under those rules for the superpowers or the system administrators the power to create the game environment the game world has two main advantages which have been quite obvious during the Ukraine war. It allows the system administrators, the superpowers to set their preferred rules or the rules that best fit their capacities. If you look at the global system today, you know, have no illusions. These rules have been set by the West, have been set by the United States, and they are not neutral. There are rules that favor the capacities that the United States has, and in a way, of course, predetermine the outcomes. You should have no illusions about that, but in a different system, that would be different. And more dramatically, and less obvious perhaps, although it's become very obvious in the last two years, it allows the superpowers to change the rules or the game state when exceptional circumstances demanded in computer programming language God mode is the ability to access the control panel settings of a system the best example of this is when the United States in Europe decided to freeze Russia's reserves Russia's central bank reserves they were of course not physical money they were just an entry in a computer in the Federal Reserve or the European Central Bank. They could be frozen or even deleted with just the stroke of a button and that's what the United States and Europe did two or three days after the invasion. How would you understand this? You know political science struggle to understand what happened but in computer programming language it's very easy. You access the control panels of the system and you change the game environment. At least I would suggest this is what's happening. I'm sure you'd be able to have an even more sophisticated understanding of this. Other countries, what can they do? And I'll conclude with this. They can play by the existing rules, not worry about shaping the rules. You even have countries that are so good at playing by the rules that sometimes they seem to be better at playing by the rules than the countries that shaped and created the rules, which is a funny thing. I think Switzerland and Singapore are countries that are better at playing by the existing rules than the United States is. They can specialize in a certain element or elements of the global system and attempt to shape the rules in that limited area. Russia, I think, has done this for energy, particularly before the invasion, and the European Union has done this to some extent regarding trade. So I'm not suggesting that these systems are built entirely by one player. Again, we go back to the idea of modularity. Or finally, they can align with one of the superpowers and just go along with those plans for world building. The United Kingdom, I would argue, is just entirely aligned with the United States when it comes to the project of world building. Well, remarkably, I finished exactly on time. Questions? Thank you so much for this interesting presentation in fact we have already received a number of questions so I start with the first one so why is it a big deal to be first to create a virtual world isn't it feasible that state with more resources improves on a world that more, more, sorry, more innovative state created and creates its own version? Yes, it's always, the game is never fully determined. We see with China that there's an attempt to, in a way, create a world that is more virtual than the existing one, and therefore more powerful and capable of replacing the existing world. So I'm not saying that the game is finished, but there is a lot of power in being there first. After all, those who want to replace the existing world by another one still have to operate under the existing rules to a considerable extent. I think China is a country that understands this dynamic very well because you play by the existing rules up to a point where you have enough resources to slowly try to change them and change them from the inside. Thank you. Then we have, yes, thanks to the audience for lots of questions coming in. So the next one being, do you believe something beyond the nation state will emerge online, for example, a network state. Yeah, but you know what I'm arguing here is that we kind of already have a network state. I'm arguing that contrary to what we might think, we already live in a purely virtual world made up of connections. And this is built by either one dominant player or two dominant players so I'm I'm still unconvinced that we you know what Balaji talks about I think we already living it it's not entirely in the future then we have another question is there anything that cannot be virtualized and will always remain outside of the control of the game master? I wanted the book to be very ambitious. So in the book, I argue there is nothing. And the effort of the book, why it took more than a year to write, is that sometimes it gets quite difficult to argue, particularly when it comes to energy. But I try to argue that solar energy in particular is a virtual form of energy. It has no supplies, has no waste. It's pure flow, no component parts. Pure flow from the photon to the chip that operates an AI system. So you'll have to read that there to see if I was successful. But my gambit is that, yes, everything can be virtualized. So the next one is a spicy one. USA or China, who will win? everything can be virtualized. So the next one is a spicy one. USA or China, who will win? You know, the great thing I think about my framework is that it's a game. So the outcome is open and depends on the plays that the players make, right? You know, I say that right at the beginning that there's no way to know the outcome in advance. You can know the structures of the game, that's what I try to do, particularly this metagame that I talked about, but for the time being, there's no way to know who's going to win in the end. Can a superpower be decentralized? What I think can be decentralized is the world game. So I see no better solution to the problem of war and conflict than this idea that the rules of the game can be built by different players. I don't think it can be fully decentralized in the sense of, let us say, something like proof of work, because that doesn't exist in geopolitics, but a kind of a proof of stake where the global system is so Decentralized that no power has full control over it and that perhaps is something we could we could aim for We have another question asking who's the referee in the world game can Ethereum or web3 take this role? No, I don't see any referee. I see just a permanent struggle between different programmers. The good thing, perhaps, is that this is a world subject to rules, right? I never argue in my book that this is the jungle. States are not competing directly. They are competing subject to rules, and they are competing to change the rules. But there is a certain stability given by the rules. So if you want to say the referee is competing to change the rules but there is a certain stability given by the rules so if you want to say the referee as the rules yes but it's a referee that is simultaneously being controlled and shaped by the players and with that we unfortunately already have to come to the final question do you see any room for independent communities to remain so should an actor like the u complete a fully pervasive virtual world or will all be forced to contribute to it in some way? If it's a virtual world and if we live it there is no way to escape outside. You know the book is also a call to join the game or join the metagame. There's no other way to live in freedom than to join the competition or join the metagame. There's no other way to live in freedom than to join the competition, to shape the rules, because you're always going to be subject to those rules. Sometimes it might not seem. It might seem like you're just living in the natural world, but no, it's a world shaped by someone somewhere. Thanks so much. Thanks again to Bruno Massas.",
  "eventId": "devcon-7",
  "slot_start": 1731652200000,
  "slot_end": 1731654000000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/171MvUF1M-7FvPkuWLfzY3WGZzA0pW2lZXE-foWeOt4Q",
  "resources_slides": "https://drive.google.com/file/d/1vbPdcrS1cu1U46bIY3zDP8kRxiUs_y2P/view",
  "speakers": [
    "bruno-macaes"
  ]
}