{
  "id": "keynote-unifying-ethereum-through-intents-and-erc-7683",
  "sourceId": "WHYZCD",
  "title": "Keynote: Unifying Ethereum Through Intents and ERC-7683",
  "description": "Ethereum has scaled with a diverse ecosystem of L2s—but this created a new challenge: how can this fragmented landscape of potentially millions of rollups feel like a **unified Ethereum**? In this talk, I’ll discuss how intent-based architectures—and new standards like ERC-7683—can help unify Ethereum while maintaining the benefits of Ethereum’s rollup centric architecture.",
  "track": "Layer 2",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Product",
  "featured": true,
  "doNotRecord": false,
  "tags": [
    "Cross-L2",
    "UI/UX",
    "Intents",
    "interoperability",
    "erc-7683",
    "Cross-L2",
    "Intents",
    "UI/UX"
  ],
  "keywords": [
    "ERC-7683",
    "Interoperability"
  ],
  "duration": 1543,
  "language": "en",
  "sources_swarmHash": "2191e709cbfc256b9d47ddae48814a876c2d304b09cbc7c61b9fe25875504fda",
  "sources_youtubeId": "jjBxfIsTrLE",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67345cf19dbb7a90e14fb5ef",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67345cf19dbb7a90e14fb5ef.vtt",
  "transcript_text": " So my talk here following up on that panel, an amazing panel, and let's give a thank you to Vitalik, to yeah, I think Vitalik, but also Ben, Jesse, Steven. Um, it was an awesome talk. So, uh, we're gonna talk, continue the conversation about how we unify Ethereum, uh, with Intents and ERC 7683. Um, and so I'm Hart. I am the, uh, co-founder of Across Protocol. Uh, we are an intent-based interoperability and bridging protocol. Um, but we're gonna talk about the standard and how we developed it and how we built support for it, which we talked about on that panel too. Okay. So I stole some of the slides from my intro to the panel because they were so good I needed to use them. But I'm going to replay quickly some of the slides just to set the framework for what we're talking about here. So four years ago, Ethereum had the scaling problem. We had 15 transactions per second. At peak demand, Ethereum was so expensive, it was basically unusable. And Vitalik helped us align the Ethereum community around this roll-up-centric roadmap. And this worked. I walked through these slides on the panel we were just on. But look at what we did here. In October 2020, we aligned on the roll-up-centric roadmap. Optimism shipped a couple months later. Arbitrum shipped a couple months after that. ZK Sync shipped a year after that with ZK rollups. We had this like massive innovation in this rollup-centric architecture. And then of course, Blobs came around just this year. So March of this year. And I don't know if you guys just saw the charts or I honestly should have included another chart in here. The cost of transactions on Ethereum just plummeted. And now on an L2, you can do a transaction for pennies. We actually saw this in a crosses data. The median transaction size dropped from about 500 bucks going L2 to L2 when you're bridging is now 50 bucks and we have real consumer use cases because these these L2s",
  "eventId": "devcon-7",
  "slot_start": 1731483000000,
  "slot_end": 1731484800000,
  "slot_roomId": "main-stage",
  "resources_presentation": "https://docs.google.com/presentation/d/1HFUKCdHq2CnGEM-2BvyaHipzeUf2aeP32TKRHPxKnWY",
  "resources_slides": null,
  "speakers": [
    "hart-lambur"
  ]
}