{
  "id": "kickstarting-impact-funding-with-hypercerts",
  "sourceId": "VGZ7PP",
  "title": "Kickstarting impact funding with hypercerts",
  "description": "Create hypercerts, evaluate their content and fund what matters by building on top of the hypercerts ecosystem. Building on top of a decentralised registry of impactful work, the hypercerts ecosystem empowers impact creators to explore novel forms of impact funding and resource coordination. \r\n\r\nDuring this workshop we'll explore the hypercerts stack and help you mint, evaluate and trade your first on-chain impact certificates.",
  "track": "Real World Ethereum",
  "type": "Workshop",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DevEx",
    "RPGF",
    "Best Practices",
    "funding",
    "Best Practices",
    "DevEx",
    "RPGF"
  ],
  "keywords": [
    "Impact",
    "Funding"
  ],
  "duration": 4872,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735e4169dbb7a90e176e775",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735e0479dbb7a90e1e78f69.vtt",
  "transcript_text": " Session of the day. Well done. I think you guys should all give yourself a round of applause for making it to the day three, last session. Well done. Awesome. My name's Mark, Englishman living in New Zealand. Any Kiwis here? No Kiwis? No, they've all gone home. Okay, last session. We're going to talk about corruption, KYC, and the cost of compliance. So Jared Hope, co-founder of Status, and Lagos, welcome, Jared. Cool. All right. Well, yeah, thanks for making it to the end. I'm sure you're hungry. I'm sure you're tired. I am too. So I'm here to talk to you about corruption, KYC, and the cost of compliance. And, I mean, I think a lot of people intuitively don't like KYC when it's applied to them, but don't really have, never really kind of looked into it or maybe some other alternate narratives. So I'm here to give you another narrative form. So let's rewind back the clock, back to September the 10th, 2001. Pay attention to this date. It might look familiar to you, right? Donald Rumsfeld, the Defense Secretary of the United States, held a press conference in which he admitted that $2.3 trillion of the Pentagon's budget was completely unaccounted for, had no idea what it was spent on. In fact, in that press conference, he went to say that the adversary wasn't terrorists. In fact, it was closer to home. It was the Pentagon bureaucracy. Now, the following year, Jim Minery took it on himself to track down just $300 million of this, right? He traveled all over the United States, and unfortunately, couldn't find it. He said, he's on quote saying, we know it's gone, but we don't know what they spent it on. Kind of a problem, right? Now, fast forward to 2015, right? Catherine Austin Fitz, who is the Assistant Secretary for the Housing Department of Housing and Urban Development, looked into her own department as well as the Department of Defense, and found for the year of 2015, $6.5 trillion was known as unsupported adjustments, right? This was 54 times the actual approved spend for the DoD authorized by Congress, which is $122 billion. Now, Mark Skidmore, not sure why he's not appearing there, but he has a face, thought that this might have been some kind of typo, right? Surely it can't point $6.5 trillion. Surely Catherine meant $6.5 billion. So he got together with Catherine, and they really dove into it. What they found through their research is that there was actually 21 trillion dollars unaccounted for between the period of 1998 and 2015. Oh, okay. There he is. Now, none of this would have been... This is old news for Franklin Spinney, right? He was a 1983 military whistleblower who had already come out in Time magazine trying to alert the public of this kind of spending, right? He's on quote saying the books are cooked routinely year after year. So this isn't something that happened just in that period. It's been happening for a long time. In fact, it's still happening, right? So here is something that's from this year where $8.2 billion of improperly valued material went to Ukraine, right? Again, no idea what that material was, it's just the money got spent. And here is Senator Chuck Grassley of 2024 on quote, saying that when it comes to catching fraud, the Department of Defense internal controls are a complete failure. We've known it for decades, And he's looking quite grumpy about it. And the reason for that is because he's basically made most of his term tracking down this kind of spending. So he's found a gas station that was created in Afghanistan that should have cost half a million dollars actually went for 43 million dollars, right? He's found soap dishes that cost $117. Hammers, $400. Pliers, $1,000. Forks and spoons, $57 each. I hope they were plated in gold. But the most comical one is probably toilet seat lid covers. Maybe you remember this, maybe you heard about it. It's happened a few times. Once in the military where they were going for roughly $640 per toilet seat, just the lid, right? Like not the entire thing, just the top part, right? In the Air Force recently, it's gone for $10,000 for each lid. It's a hell of a lid. So how does this happen? How on earth can you spend 54 times your allocated budget in a single year, right? Well, it's actually because of the oldest living program that's still in operation today. This is called MoCos, right? It's written in COBOL. I think it was deployed in 1958. Now, what its purpose is for is for tendering, procurement and so on. But what it also happens to do is it finds unspent money or funds in other programs that have kind of gone stale. This is completely illegal to do for any other governed department, but here apparently everyone seems to look the other way. completely illegal to do for any other government department, but Here apparently everyone seems to look the other way now Just to give you a sense of proportion going into this right on the on the left hand side here We've got the the unaccounted adjustments. I've just been talking about right this 1.2 trillion dollars on average For that's being spent per year according to that time span of six and a half trillion, right? This $1.2 trillion on average that's being spent per year according to that time span of $6.5 trillion, right? Adjusted for inflation, that might be around $2.5 trillion, let's say, right? On the other side, we've got the United Nations estimates for illicit financial flows on a given year, right? It's somewhere between 2% to 5% of global GDP. So that's the 1.6 trillion and the 4 trillion balance. Now, the 3.1 trillion that's on there, this sort of middle bracket, is an estimate of illicit financial flows for last year according to NASDAQ's global crime financial crime report that came out this year right just to give you a sense of proportion right this is just one government agency the entire planet's illicit financial flows okay so going back to that press conference if you recall at the beginning of this right the day after 9-11 happened, right? Tragedy, absolute tragedy. And as those towers fell and hit the ground, the world changed, right? Not only in terms of the surveillance, in terms of like our communications, but also the deployment of financial surveillance around the entire planet, right? In just one month, the Financial Action Task Force issued out the eight of their nine special recommendations, and actually, with the installment of the Patriot Act, they have basically a whole bunch of provisions for KYC and AML, specifically around Sections 311, 326, 351, and 352. So the 311 is about giving the Secretary of Treasury the authority to target specific money laundering and terrorist financing risks. 326 is about establishing minimum standards for financial institutions. So this is why you have to hold your passport up and take a photo of yourself whenever you sign up for an exchange or so on. 351 is immunity for anyone who likes to squeal, right? So reporting, and if there's any issues around reporting, they're kind of immune if it's in the name of this particular goal. And 352 is basically the mandate for financial institutions to implement the program, right? Now, I say this goes around the globe because it was felt in Asian banks. So, according to the LexisNexis Resolutions, the True Cost of Anti-Money Laundering Compliance Survey in 2015, even though local regulations were cited the most frequently as having the greatest impact, it was known that the US regulation embodied by the Patriot Act, which was actually what enforced these particular implementations of policy. Now, we've established agency, illicit financial flows, just to give you a sense of proportion, right? Now, we've also seen that it was implemented in the name of terrorism. Can you see on here the amount that has gone to terrorism? Yet? Maybe? Oh, there we go, right? $11.5 billion have gone to terrorism financing according to the latest NASDAQ Global Financial Crime Report. That's what we sold out our civil liberties for, just to give you an idea of that, right? Now, of course, you might look at that and go, well, you know, it's been two and a half decades since then. Surely we've solved terrorism. Well, actually, if you roll back the clock and look at some of the estimates of what that terrorism financing looks like, the World Bank and the IMF basically viewed the terrorism financing organizations for the entire year of 2001 to be less than half a billion dollars, right? Just to give you a sense of proportion here. In 2005, Rand found that al-Qaeda's annual budget was between $30 to $50 million. In 2015, the Department of Treasury estimated that ISIS generated roughly a billion dollars. And in 2016, Europol estimated that that was doubled to $2 billion. Now, in contrast to that, we have this great report from the Simpson Study Group on counterterrorism spending, right? And they believe that, according to that report, that between the period of 2002 and 2017, this came to a total spend of $2.8 trillion, or $186 billion on average per year. So this spending on counterterrorism is 16 times larger than what our estimates are for spending that goes towards terrorism, right? That's a pretty good margin if you're playing both sides. Anyway. So, I mentioned this notion of illicit financial flows, right? What are they? Well, there isn't really an agreed consensus on the definition. But generally speaking, it comprises of tax evasion, multinational tax avoidance, the theft of state assets, the laundering of prostates of crime, and they cover a broad range of market and regulatory abuses, such as corruption, drug smuggling, and human trafficking, right? And it is important, like I'm not trying to dismiss this at all, right? So don't get that from me, I'm just trying to give you a sense of proportion on this, right? It is important because Donato believes that for every dollar that goes towards crime gets reinvested in crime and therefore you get more crime, right? Perhaps a better analysis of this is actually Bjorn Lomborg who got some of the top economists in the world together and tried to rank the United Nations Sustainable Development Goals on a dollar-for-dollar spend, right? And they found that, you know, addressing illicit financial flows is a top priority. So why is this important? Why is addressing IFFs important? Well, they're basically associated with ineffective state functioning, illiterate use of state power, and they're kind of an international problem because even though you might solve it within your own state or within your own country, that capital will probably flow to other countries that support it in some way, right? At the end of the day, it results in lost GDP, which means there's lost tax revenue, and the argumentation is that that leads to poor governance. And higher quality governance is obviously desirable. So what exactly are IFFs? And, well, that depends just like the definition. So there's a myriad of different methodologies, and it's unclear exactly what comprises IFFs. And this is kind of part of the problem, because it's actually hard to understand what they are due to their nature. So Raymond Baker here basically views that 65% goes towards trade misinvoicing. Trade misinvoicing is like when a multinational corporation will do, say, for example, natural resource extraction in one country, but misprice the cost of extraction and the value of resource that's extracted, and then when moving it to another country, changes those numbers, right? 30% towards criminal activity and 5% towards corruption. The Cardamon view is that 80% goes towards trade misinvoicing, so this same problem, and 20% towards corruption. And the NASDAQ Global Financial Crime Report focuses more on the humanitarian aspects of illicit financial flows. So 25% towards drug trafficking and 12% to human trafficking, with 63% just towards other, which is corruption, crime, and so on. So even though we had the Financial Action Task Force and the Patriot Act implementing these regulations, it wasn't really until 2015, sorry, 2005, that illicit financial flows as an argumentation came onto the scene as a public policy issue, right? And this was actually through Raymond Baker's book, Capitalism's Achilles' Heel. The issue is that he's pushing a model and this idea that isn't well substantiated, and Peter Rudd was quite critical of it in 2015, where we didn't really know much more about the issue 10 years beyond, right? And in fact, there's more people who also feel the same way, right? Even though we use different measures and models to use to estimate money laundering, there is actually no model that can be used to quantify and accept it globally. Even the Financial Action Task Force's own methodology for assessing compliance with the FTAF recommendations and effectiveness of AML systems is completely vague. It relies on the general use of crime statistics, anecdotal evidence, and subjective conclusions. And this is part of the nature of what makes IFFs so difficult to deal with. Now, to their credit, there is an ongoing pilot program by the United Nations that is trying to provide the highest quality data around IFFs. But, yeah, I mean, it's largely focused on drug traffic in developing countries and it's roughly $1 billion we're talking about, some of the bigger ones. So, are follow-the-money methods effective? Well, according to the Financial Action Task Force's own admission last year, less than 1% of global illicit financial flows is recovered. Ronald F. Paul believes that less than 0.1% of criminal finances is impacted by follow-the-money methods. And according to the UN, this is roughly 0.2%. In other words, 99.8% of criminal proceeds are completely unaffected by all of the KYC that we've implemented. So what can we measure? We can measure the cost of implementing compliance, right? And according to the LexisNexis Risk Solutions report, for the United States banks alone, this is roughly $26.4 billion annually. That's double the amount that's going towards terrorism financing in the US alone. In fact, Ronald F. Paul believes that compliance costs exceed recovered criminal funds more than 100 times over. And the banks and the taxpayers and ordinary citizens are penalized more than criminal enterprises. That's you and that's me. In fact, this has been known at the OECD and B20 for several years. In fact, all of those costs get passed on to us. And in particular, when it comes to traditional trade finance, 50 to 60% of these costs, or more than half the price of your trade, is charged to clients. And a large portion of that is associated with compliance. Now, so why am I talking about this? Well, there's another inverse way to think about this. And there's a great thing that we understand in institutional economics, that if we can reduce transaction costs in the abstract sense by 0.1%, this enables a country to be able to quadruple its wealth. That's the difference between Argentina and Switzerland. So we can actually create better and more efficient institutions that lower transactions. I mean, when you line up in the DMV or if you're filling out a form, that's associated with transaction costs in an institutional sense. If you can reduce that by using, say, smart contracts or smart paper or whatever, we can enable more wealth, which will probably lift a lot more people out of... No, it will just make a higher quality of life. In fact, Michael Levy basically says that no one could rationally think that AML controls in general or financial investigation in particular will solve organized crime completely or eliminate high-level offending. For there even to be a chance to achieve that, there would need to be a step in change in transparency and effective action against high-level corruption along all possible supply chains. It's a huge problem. Why is that a huge problem? Well, before I get into that, Amnesty International created a report called Weaponizing Counterterrorism. I highly recommend you read it. But they basically showed how the Indian government has been exploiting the 2010 and 2013 FTFS assessments to target human rights activists, journalists, students, academics, and so on, right? And so this is one of the issues with these kinds of recommendations. What happens is that if you don't implement them on time, you can be excluded from the economic system, right? You can be excluded from member states. And so this leads to rushing bad law through their parliaments. And when they're in place, politicians can then use them for political gain. They've been used to suppress political opponents. It's not just Amnesty International talking about that. It's also the Royal United Services Institute in the UK. This is a 100-year-old think tank, very prestigious and well-respected. They focus on authoritarian regimes, but as we've just seen, it doesn't apply just to authoritarian regimes. So, who is perpetrating it? Are we really ones to blame? Alex Cobham doesn't believe so. In fact, he says that ISS are likely to be, by and large, an elite phenomenon. So the financial and political elite. And the reason for this is because that's where the systems of abuse are likely to be strongest and where the capital is concentrated. They're the ones who make the rules, and therefore they're the ones who can break them. And to give an example of this, you might recall Jamie Dimon, CEO of JPMorgan Trace, is on record basically saying crypto is a tool for criminal drug traffickers and money laundering and tax avoidance. And if he was the government, he would shut us down. There's a certain irony in that, that basically the following year, no, following weeks, I think, after that statement, he was hit for, well, not him, but JPMorgan Chase, was hit for fines totaling roughly $39 billion for doing exactly those things. This was part of the FinCEN files, which basically shows it's not just exclusively the JPMorgan Chase, but many major banks. Now when it comes to financial secrecy, you might think of tax havens and nice, lush, exotic Caribbean islands. You might think of even Switzerland. But I wanted to point out the financial secrecy index, and particularly look at the global scale weight here. The United States stands out at roughly 25%, in contrast to the second position of Switzerland, which has it less than 4%. Their policies are literally, as Rumsfeld said, closer to home. Puerto Rota goes on to say, asking a kleptocratic state to create an effective AML system is like asking the fox to create a better hen house. It is the governing political elite that benefits the most substantially from the weakness of existing systems and controls. And this is a problem, because this kleptocracy issue is real. According to this Bloomberg report, trust in most US institutions has been withering across the board. It doesn't matter where you look. Public, you know, civil society, the public is losing confidence. This is not just happening in the US, but it's happening globally. And whether you look at the United Kingdom or in France, you'll see that trust is declining. In fact, if you look at the OECD reports, the average public trust in governments hovers around just 41%. We can do a lot better in terms of providing quality of governance. In fact, to corroborate the point, Transparency International came out in 2023 saying that over two-thirds of countries score below 50 out of 100, strongly indicating that they have serious corruption problems. Now, why is this important? Well, another way to view this problem of kleptocracy is that government debt is growing. In fact, it's reached unsustainable levels in many of the advanced emerging economies. And this is from the Peterson Institute in International Economics in 2011. Even though they were talking about 25 years, we're kind of already quite into that. And this is also evidenced by foreign sovereigns not buying US debt. In fact, since the 1800s, 52 countries saw a debt-to-GDP ratio above 130%. 51 of those have defaulted, and today the United States is at 120%. By 2033, they're going to be above 130. And that's according to the Congressional Budget Office in 2018. Now, those challenges are also not unique to the United States. According to the National International Council, they projected that many governments of the OECD countries are likely to experience the same economic difficulties. I'm running a little bit over time, but so the Financial Action Task Force is also quite interesting in of itself, right? Because it has a unique form of sovereignty as a non-governmental organization. It has no legal basis. It enjoys this sovereign immunity granted to it by its member states. It has no oversight. Even though it is based in Paris in the OECD building, it is not the jurisdiction of the French government, neither the OECD countries. So they can do whatever they want and have no real pressure to reform unless all member states start participating in that. As I mentioned, if you don't follow them, it results in economic lockout of the global financial system and there's no way to opt out. So why does this matter? Because if we can start solving governing institutions, we can start unlocking trillions of dollars worth of value rather than just disappearing into the ether. There's this great report from the World Bank called Where is the Wealth of Nations? And what they found is that human capital and the value of institutions as measured by the rule of law actually constitutes the largest share of wealth in virtually all countries. This is beyond natural resource extraction. So at the end of the day, what I'm trying to convey to you is that we should stop thinking from a scarcity mindset when it comes to follow the money methods. And instead, what we can actually do is improve our institutions. If we can make them faster, more efficient, and instead what we can actually do is improve our institutions. If we can make them faster, more efficient, and maybe even develop them in parallel, then we can actually create a much better and thriving world and a higher quality of life for all. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731576600000,
  "slot_end": 1731582000000,
  "slot_roomId": "classroom-c",
  "resources_presentation": "https://docs.google.com/presentation/d/1-2n2zwPdIpfxkXDYIJI5vN-Bz4JCM93vP20YXjSCQ4I",
  "resources_slides": null,
  "speakers": [
    "bitbeckers",
    "holke-brammer"
  ]
}