{
  "id": "lessons-and-learning-in-people-ops-at-the-ef",
  "sourceId": "D7V8ZY",
  "title": "Lessons & Learning in People Ops at the EF",
  "description": "In this talk, you will learn more about the learnings of People Ops at the EF gathered after the first two years of its existence.  \r\n\r\nWe will discuss the differences between People Ops in an open and decentralized setting, such as the EF and centralized, traditional organizations, and the required differences in approach and tradeoffs.",
  "track": "Coordination",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [
    "people",
    "growth",
    "open"
  ],
  "duration": 950,
  "language": "en",
  "sources_swarmHash": "6053fc3bc7cfdf2336529c71db16ae75959733a3e1b980d33b9d80fe1c4c42ba",
  "sources_youtubeId": "NAyiWuQX5xg",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736fa4e74749a4b89a25233",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736fa4e74749a4b89a25233.vtt",
  "transcript_text": " Hey everyone. So good afternoon. My name is Jose. I work for PeopleOps at the Ethereum Foundation. I joined the Ethereum Foundation around two years ago. So this has been an experiment. We didn't have people operations before I joined the EF. And I want to share with you some of the learnings that we got for the past two years. So what I'm going to talk today is our experience, as I said, for the past two years, our go-through of challenges, positive aspects and learnings in both recruitment, people experience and development, and off-boarding as well, and especially how these differ from other traditional organizations that exist in the field. But first, I will provide some context on why doing people operations at the EF is a very particular challenge, full of nuances, mostly because of the way that the EF is organized. So the way that the EF is organized is the EF is part of a much larger ecosystem. It is an organization that exists at the frontier of what we have known so far. One that supports a blockchain ecosystem without controlling it. And what that means is also a work in progress. So every day we get to learn more about what DEF is and what kind of organization it needs to be for the present and for the future to support obviously Ethereum's long-term growth. If we zoom in a little bit on how the EF relates to the ecosystem, the EF was new and we didn't know the best way for teams to organize themselves and to relate to the ecosystem. So we prioritized creating an environment where actually different teams could choose to organize themselves differently depending on the goals that they actually wanted to achieve and they thought it was best for them to achieve those goals. So this resulted in having more like a community of teams than actual set of typical company teams that are kind of standardized all across the board. There are multiple ways in how these teams interact with each other and with the other entities that form the Ethereum ecosystem. So there are teams that work at the frontier of the EF, there are teams that work within the EF, there are teams that work externally, there are teams that work with Ethereum ecosystem entities that are, again, at the frontier of the EF. So there are many ways in which these teams collaborate with one another and with the ecosystem. They are largely independent, as I said. Some of them are internally. Some of them work at the frontier. So that is very important in talking about the way also moving forward and how people operations works for these teams. These teams are also largely autonomous. So they work in a decentralized way. We have, and they have a high degree of autonomy. Some decisions such as, for example, roadmaps and priorities are taken by these teams in consultation with leadership. But most of them are also made independently. Aside from some prescriptive decisions, such as for example, legal matters, which obviously need to be complied with all across the board, there is quite a fair amount of leeway for teams to move around and to actually choose the setting, as I said, that are more suitable for them to help them achieve their own goals. So having said this, how does this actually impact people operations? In broad strokes, in traditional organizations, PeopleOps is kind of more structured and has more predictive outcomes. They aim to provide a consistent experience for all the teams within the same organization. At EF, things are slightly different because these teams work independently and they kind of form their own culture internally. We aim to be as diverse as possible to make sure it works for everyone. But we kind of maintain the same minimum threshold to make sure that there's a minimum standard that all teams can meet. Talking a little bit about recruitment and going into people ops directly, so as I mentioned before, teams are independent. So different teams mean different subcultures, mean a different way of working. So this means that working for a certain team at the EF can be substantially different than working for other team within DEF. This reflects on how they communicate internally, ranging from how to when to what platforms they use, compensation philosophy, way of working practices, interactions with the adjacent community, Ethereum community, etc. So what we learned from this is that the best way for people operations to actually facilitate the recruitment process is to let them lead the way. And we are actually helping and holding hands to let them do whatever they want to do, within obviously some limits, but using our expertise to help them achieve their own goals. So this can range from purely operational support. There are teams that get to us and say, hey, I know exactly who I want to hire because I have a very close relationship with the community that works around my team and I want to hire that person and I just need to set up the operational process of it and that is fine. We can obviously help with that. There are other teams who are less sure about what the process looks like. So what they usually do is, okay so I want to hire this kind of profile which can be more or less defined and then they kind of ask for help for doing the process from end to end. So that goes from defining the profile, sourcing the candidates, establishing a hiring process, running the process, helping them run the interviews, until the offer. So it's fairly common for the EF to hire external contributors as I said. This is also a very good way to lower the risk when we hire someone as, okay if this person was an external contributor and was already contributing to the EF, as I said before, working at the frontier between the EF and the ecosystem, that obviously lowers the risk because we know that person from their past contributions, so it's easier to just bring them in and we know that they will have a good fit within the organization. Another thing that we learned that is probably a challenge for us that does not happen within traditional organizations is that whenever we get a candidate that is a good candidate for a certain position within a team, it's much harder for us to share that profile with other teams because as I said, teams work and hire largely independently so we're not always aware of their hiring needs so moving one profile from one team's pipeline to another team's pipeline can be substantially difficult when we talk about people experience and their development there's also a lot to say here so because we are non-structured, well, we're a structured organization, but we are a decentralized organization, and we are a flat organization, so we don't have job titles. In traditional organizations, it's easier for people to feel progression through changes in their job titles. So you know that when you go from junior something into senior something, there is a progression there. So you have somewhere to look for because",
  "eventId": "devcon-7",
  "slot_start": 1731652800000,
  "slot_end": 1731654000000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1pSqd-PaSLhWa3-GQ2HCRVcJCWv_fnu9Z5T4wVlAMT-c",
  "resources_slides": "https://drive.google.com/file/d/10KedOZLHU3N3U74YhH1A1uBpk3CvtNmR/view",
  "speakers": [
    "jose-pedro-cabrita"
  ]
}