{
  "id": "lighthouse-introduction-to-siren",
  "sourceId": "F3ZPRJ",
  "title": "Lighthouse: Introduction to Siren",
  "description": "Sigma Prime would like to introduce Lighthouse's official user interface called Siren. Siren was made to monitor performance, display key metrics and help make lighthouse validator management easy. Siren comes with built in metrics, logging, and other features users will find useful when updating their validator.",
  "track": "Usability",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Stakers/Validators",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Home staking",
    "UI/UX",
    "Accessibility",
    "ui",
    "Accessibility",
    "Home staking",
    "UI/UX"
  ],
  "keywords": [
    "lighthouse",
    "UI"
  ],
  "duration": 388,
  "language": "en",
  "sources_swarmHash": "581e106f3b22dfacc1d56771706969f972348e514d3d6a94afc75aac47317df4",
  "sources_youtubeId": "RhlKmJqk0go",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673338d13a168eb535e44173.vtt",
  "transcript_text": " Good afternoon. I am Maverick. I am a Lighthouse engineer working at Sigma Prime. Lighthouse is a consistent client maintaining around 33% of the entire Ethereum network and today we want to introduce Siren. Before we get started I want to ask a couple of questions. Who here feels confident they can set up and configure a validator all on their own? Okay. Who here feels they would struggle to set up a validator, even if they had a video tutorial and a guide. Okay, if that's you, don't worry. It's okay. It's totally normal to feel like you're not technical enough to maintain a validator. As a matter of fact, Lighthouse has plenty of people that self-identify as noobs validating the network, and we always encourage them to participate and to ask questions when no prior knowledge required. And this is kind of the reason why we, what led us to make Insiren. We believe staking can be easy, accessible, and reliable. If an increase in home validators leads to more decentralization which increases Ethereum security then we must work hard to lower the technical barrier of entry preventing average users from committing to become validators. Okay so this is Siren. With this goal and user profile in mind we created a user interface that will help solo stakers at home. You can track validators, you can track statuses, log updates, and much more all in one location on our super sexy dashboard that comes in light and dark mode. With minimal configuration, Siren connects directly to your Lighthouse Validator client and your beacon node, allowing to communicate and consume data securely. Users have the option to install Siren via our Sigma Prime Docker containers or to download it and build it locally for some of our super users out there. Once activated, Siren allows you to manage your validators from any device on your home network or externally using an SSH or VPN access. So let's go over some features already out on Siren. It's super easy to track your value sync statuses, to get a breakdown of your total rewards, which includes ETH currency rates and earning estimates. You can get an aggregated value list that checks on the status the balance of aggregated of rewards and etc keep track of disk base CPU usage RAM usage on the machine that's running Lighthouse you can see how long your nodes have been running if you have warnings telling you if you're falling behind blocks, peer data. Some key more features are you can get notified of critical and error logs, which includes statistics on rates. You can monitor logs as they arrive in real time and use the search bar and find specific log data to copy and paste log information into the Discord if you need help. So what are some of the key actions? You can update your validator graffiti at the click of a button. For those OG validators with 00 withdrawal addresses, you can use SIREN to execute your BLS actions. And lastly, when you're ready, if you're ready to call it quits, in just a few steps, you can exit your validator safely and securely. All right, so what's next for Siren and what are we working on? Coming very, very soon, Siren will enable validated deposits. For those who already have a home validator, you may have used the Ethereum staking launchpad that create your validator. But through this, you are required to know the command line, you are required to make your own deposit JSON, your key stores, and import your validator into Lighthouse yourself. Now with Siren, there was supposed to be a video here, now withIREN you'll be able to take care of all of that on your own. SIREN condenses the entire flow into just a few steps, allowing full guidance and validation so you don't wreck yourself when you're moving 32 ETH. Hopefully soon 1 ETH when we reduce the fees down to 1 ETH. Okay, so we're preparing for the Pectra upgrade as well, EIP-7251. The upgrade will increase the max effective balance from 32 to 2048. This will enable validators to also consolidate. This will allow stakers to merge their validators together, which will help reduce operational overhead. And so Siren will enable this for all the Lighthouse users to be first in line in the consolidation queue the moment Pector goes live. And if you have any questions or you're interested, I'm going to reach out to the team. Just follow this and join us on Discord. We have a huge supportive community and a deaf team that will like to help out. This was made possible by the Sigma Prime team and that was it. It was lightning talk. I'm standing right behind you. We have one or two questions that I think we can handle in a minute. First question, what's best, light or dark mode? Dark mode. All right. This is rapid fire. Are there docs and how do I start using it? Yes, we do have docs. You can find them on the Lighthouse book. You just follow it and then there's a section for Siren itself.",
  "eventId": "devcon-7",
  "slot_start": 1731408000000,
  "slot_end": 1731408600000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1iWFucLqzajqGIcn5d4YFuRZ1zk1Y8VHURhoTiKQ1T-w",
  "resources_slides": null,
  "speakers": [
    "ricki-moore"
  ]
}