{
  "id": "lighthouse-transition-journey-from-warp-to-axum",
  "sourceId": "ZF79GZ",
  "title": "Lighthouse transition journey : from warp to axum",
  "description": "This talk will explore how to approach a significant refactor of the HTTP framework for lighthouse. \r\n\r\nIt will cover:\r\n- Measuring the performance of endpoints between Warp and Axum\r\n- A concrete plan for implementing the necessary changes",
  "track": "[CLS] EPF Day",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Developer Infrastructure",
    "Light Clients"
  ],
  "keywords": [
    "Performance",
    "Developer",
    "experience"
  ],
  "duration": 537,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67343c729dbb7a90e1adea32",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67343c729dbb7a90e1adea32.vtt",
  "transcript_text": " Thanks Mario. And so I'm Leah, software engineer, specialized in Rust and- You need to switch your slides here, yeah. Okay. Wait, wait, no, you need, yeah. Oh. Oh, but this thing- no, you need, yeah. Oh. No, you need to, I think I need to, not this. Oh, okay. I mean, I can duplicate otherwise. Okay. Amazing. Okay. Okay. Okay. Yeah. Thanks for being here. So I'm a software engineer specialized in Rust. And as Mario mentioned, this project was in fact supposed to be one week's maximum good first issue to start it in Lighthouse. And that's my initial project. So I'm very happy to be here. And I'm very happy to be here. And I'm very happy to be here. And I'm very supposed to be one week's maximum good first issue to start it in Lighthouse and not my initial project But as we are we are all developer and I think one of our defaults is like to underestimate developer time development time so Why so I pick this project of course to go deep into Lighthouse and understand better before transitioning to a more research project. But as a developer, I was interested in big refactor. So why does the team want to move between warp and axiom, but first what is warp and what are axiom? So there are web server framework, crates in Rust, and one has been developed a bit long time ago, so it's a bit low-level, low-level oriented, and a bit less easy to use, despite Axum has been developed by the Tokyo team, Tokyo organizations, and a bit easy to use, and why do they want to move? Of course they want to move for easier use, and because warp types, which is very focused",
  "eventId": "devcon-7",
  "slot_start": 1731474000000,
  "slot_end": 1731474900000,
  "slot_roomId": "breakout-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1xTcTdXk_Eq4KKe0Dg4IQWit5KLqwivJSom49AbKiMFM",
  "resources_slides": null,
  "speakers": [
    "lea-narzis"
  ]
}