{
  "id": "local-build-why-language-is-key-to-decentralization",
  "sourceId": "UHVBNL",
  "title": "Local Build: Why language is key to decentralization",
  "description": "Localization is not a “nice to have” for decentralization: it is a core requirement.\r\n\r\nOver 50% of ETH nodes are between the US and Germany. 90% of stablecoins are USD-pegged. The world we’re creating is stifled by the one that already exists. \r\n\r\nTo be credibly decentralized, Ethereum must be built and secured in the human languages of people outside of the current paradigm. This talk will highlight web3-native problems and tangible solutions in l10n, from the technical to the organizational.",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Decentralization Improvements",
    "Languages",
    "User Experience",
    "localization",
    "l10n",
    "Decentralization Improvements",
    "Languages",
    "User Experience"
  ],
  "keywords": [
    "Internationalization",
    "Localization"
  ],
  "duration": 572,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "oaztuq6hO4c",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673482ed9dbb7a90e1e580fb",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673482ed9dbb7a90e1e580fb.vtt",
  "transcript_text": " We have Laurel and Oliver to give us a talk on why language is key to decentralization. Let's welcome them on the stage. Are we here? Yes, I think we are. Okay. Hi, everyone. I'm Laurel, Internationalization Project Manager at ConsenSys, working mostly on localizing MetaMask. And I'm Oliver. I'm from Customer Success, also at ConsenSys. Awesome. We're going to spend the next five minutes remixing some old, tired cliches to explain why human languages are essential for decentralization of Ethereum. So don't put all your nodes on two continents is our first one. What we mean by this is that over 50% of the active nodes on the Ethereum network are in the United States. And of the top five countries, 73% of the nodes exist between North America and Europe. I think we have a slide for that, right? Yes, thank you. Thank you. And 99% of stablecoins are pegged to the US dollar. Again concentrating DeFi within the influence of the traditional financial system. Right now the tech that we're building may be stifled by the tech that already exists and if our infrastructure mainly exists between two or a few countries and our stable coins are mainly tied to the trad econ systems of those countries, centralization is where we're headed even if the rails look different. But we can avoid this. All it takes is talking to people. And maybe not necessarily the ones that are already in this room. Yeah. So how do we get those people in this room, right? Our proposal is that the users and the use cases are out there. And we just need to get them in here. So let's take a look at the data. This is from A16Z's state of crypto report that came out recently. So until 2020, you can see over there, even if there were people speaking different languages and living in different countries, you couldn't see it, right? It's imperceptible or there's too much signal and noise. And then you can see, like in 2018, It is imperceptible or there is too much signal and noise. You can see in 2018 this big blue wedge thing. That's like we are bootstrapping, getting it off the ground. We are looking at mainly people from the USA. By the time a few years have gone by, here in 2021, we can see these big peaks coming out of Nigerian and Indian and Turkish users. That's that blue wedge up there. So at that point, we're starting to be able to see some signal in the noise. And this next data isn't up here, but it's something Laurel and I have seen at work. So since 2023, if you look just at the Nigerian and Indian readership of the MetaMask support site, support.metamask.io, the combined readership of those two national user bases are greater than the US reader base of that site. So there's just a little complexity though, to that data that we found. And we wanted to pass that on to you when you look at your own internationalization and global user-based data. Which is this space has a non-negligible percentage of paranoid, anon, de-gens that are",
  "eventId": "devcon-7",
  "slot_start": 1731490800000,
  "slot_end": 1731491400000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1zMgBNNs4mjcJlQvsWzcG-01qBLosEtl3W_zPUteNz-0",
  "resources_slides": null,
  "speakers": [
    "oliver-jl-renwick",
    "laurel"
  ]
}