{
  "id": "my-mother-will-not-use-it",
  "sourceId": "HKKFQX",
  "title": "\"My mother will not use it\"",
  "description": "In this Talk, I want to cover the different mindsets designers need to improve and optimize the work for web3.\r\nIf we're going to change the way we interact with each other and aim to profoundly improve society with this technology, we can't think and use the same methodologies.\r\nWe will cover topics such as the target audience (the title of the Talk), testing, the learning curve, web2 to web3, and more.",
  "track": "Usability",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Design",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "inspiration",
    "Design",
    "Design Thinking",
    "UI/UX"
  ],
  "keywords": [
    "Inspiration"
  ],
  "duration": 498,
  "language": "en",
  "sources_swarmHash": "ad423cbfb70b66caa453adc36d1d22548841d8553d166dad612d7ad3d0a943f9",
  "sources_youtubeId": "147hrjj2onM",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673584719dbb7a90e1e74aca",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673584719dbb7a90e1e74aca.vtt",
  "transcript_text": " So my name is Nuno, designer at the foundation. I work for Ethereum.org mostly. That's where I spend all my time and this is my talk. I submitted my talk based on this tweet from Wesley that he said my mom will never use crypto. Trying to optimize for her is a waste of time and this triggered something on me because I used on my other talks this is for each Prague back in June I guess I had one slide with the same title amongst the other things that I normally do and it's something that I it's a rant mostly why that this is something that we hear a lot out there. In other conversations out there, like, my mother will not use it. Oh, this app is not for my mother. It's not for, like, it's something that always gets me a rank that's why my mother, why the elder generation would use this? That's something that it's almost a rank. So let's start with the question. When did a mass adoption of a technology started with an elder generation? Can we pinpoint something? Can we like, top of our mind? I can't. That never happened, I would say. Never ever happened. Like take a drink of salt. I did not research this. I'm just saying out loud like might be something out of this. but I would say that it never started and we are on the brink of a revolution. So let's break even further. So why, who is my mother? Let's try to persona who is our mother. So this is my mother, my mother, Defcon, Defcon, my mother. She's a lovely lady from Lisbon, so nice to meet you all. She doesn't know he's here, so don't tell her. I'm doxing her. So, again, let's see who is our mother. Our mother might be like roughly, if average 30 years old in the audience, if she gives birth at 25, she might be 55 plus, something like that. Let's try to put her in this level. She'll be around this gap, which will make her a baby boomer and a Gen X, beginning Gen X, probably halfway through Gen X. But this is probably our mother collectively. Classifies the generation that we are sometimes thinking of who's being adopted. So she watched this You know what film this is? show hands Okay, some do She grew up This technology this was the technology that she was exposed at an influential level like all of this Probably some of you still use this who who got one, show of hands, yay, some, so was impactful, but in the end, like drilling down that analog generation, high trust in institutions in the sense that they grew up like trusting corporations, trusting governments in some countries, I don't know, But looking forward, post offices, banks, other corporations, was something that was trustworthy. Limits access to technology. They don't know how things work. I ask you, probably to you folks, how things work. And it's a cultural shift for them to onboard new technology, new stuff on a digital level. So this is my second conclusion. Why do we even bother thinking about them when we are building products for Web3? So I'm almost sure that everything that we will build will start with a young generation. This is one of the key points that I want to bring. Regardless of what we build, they will follow. So let's stop talking about, then my mother will use it. So to Wesley's point, this is a waste of time, probably, to think about them as user profiles, as personas on how to target our audience of our products. And even more, to all the Gen Zs and Alphas out there, there's a bunch of you out there that points out, you guys and all your friends and all your relatives about the same generation will be the ones that are going to use the Web3 project that we are building right now. They will have the financial upside very soon. So there's a bunch of information that the great wealth transfer will happen very soon because of the baby boomers through the other generations, they will have the financial incentive to do so. So it's not a question of money to target someone that has money. So we need to focus on the younger generation to build the new set of products. They will be the next billion users. So let's focus on them once and for all. So let's stop saying my mother will not use it. Let's start saying the youth will not use it. My kid, if you're a parent, a young parent, my kid will not use it. Probably the TikTokers will use it. Probably the Swifties. Who knows? They are the ones that will probably use our products. So this is the key point that I wanted to bring you guys. Let's start building because this is to you and for you above all and think about them and don't think about your mother, parents, grandmother, whatever you think like this. And that's what I have to you today. Thank you. Thank you Nuno. We have time for some questions. Raise your hand if you would like to ask one. It can be about your mother. It can be about Nuno's mother. Don't ask me about my mother. You don't want to hear that. Yes, yes, yes. Come on. Last push. There is a break after this. Ask a question and then go out into the world knowing you've accomplished great things at this session. Question, question. Okay, while you're thinking... Everyone is angry, I think. I know, I know. While you're thinking, I'll ask one question of my own. So same as the one I asked before. If you want people to take one thing from your talk, go back to their normal life, what's the one thing you want them to take away? Mostly as a designer, I target designers as well, other builders that are thinking new products. Keep critical thinking on the way you approach. I think we take from granted everything from Web 2.0. And I've seen a lot of talks, even the one before us, that's always like, let's do Web 2.0 way of doing Web 3.0. And it's mostly one of the topics that I bring in my talks. Probably I'm a little bit older. Probably it's my generation. I've built something of Web 2.0 I was around. And we've did a lot of mistakes. And sometimes we are passing those mistakes to Web3 as well. So be critical. Think a little bit beyond just what is presented, what is easy to present to the user. And this is one example. If the maturity of our technology that we're building is going to be like three, five years in a row, like start building for the generation that will use it. Not the elders, not the ones that probably now have the funds to invest in you, something like that. Target the ones that probably now have the funds to invest in you, something like that. Target the ones that probably will use it. Those will be the next billion. That was the thing that brought me to the talk. Perfect. Thank you. Anyone has come up with another question in the meantime? Yes. Amazing. Oh, this will be hard. Okay, yeah, let's do it this way. Okay. hard can maybe okay yeah let's do it this way this is a microphone okay uh what do tiktokers want that's the real question that you all need to figure out that's that's not an easy but we kind of know what they what they look like we can profile them at this point and that's one of the key highlights like we know what they look like. We can profile them at this point. And that's one of the key highlights. We know how they use. We know the interactions. We know what engages them to probably use the product that you're building. We like profiling. As users, we kind of know them already. So we need to understand them better. All right. Another question? Nobody? Okay, on that case, we'll conclude this morning's session. Thank you so much for being here. Thank you, Nuno, again.",
  "eventId": "devcon-7",
  "slot_start": 1731559800000,
  "slot_end": 1731560400000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1phw7po5lIFL6aJaipzIR4HdBRmhdugA212mJKjaQfoc",
  "resources_slides": null,
  "speakers": [
    "nuno-loureiro"
  ]
}