{
  "id": "mycofi-mycelial-design-patterns-for-web3-and-beyond",
  "sourceId": "8CDPFC",
  "title": "MycoFi: Mycelial Design Patterns for Web3 & Beyond",
  "description": "Exploring MycoFi guides readers on an underground exploration into the world wise web of mycelial networks, the most prolific producers of public goods on Earth. This talk examines how the evolutionary adaptability of fungi could help us imagine biomimetic alternatives to status-quo economic systems that demand infinite growth on a finite planet. If we aim to design regenerative economies, what better\r\nplace to start than with the thriving evolutionary patterns of nature?",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Collective Intelligence",
    "Conviction",
    "Consensus Mechanisms",
    "Civil Resistance",
    "Sustainability",
    "Public good",
    "Regenerative Applications",
    "Design Thinking",
    "Civil Resistance",
    "Collective Intelligence",
    "Consensus Mechanisms",
    "Conviction",
    "Design Thinking",
    "Public good",
    "Regenerative Applications",
    "Sustainability"
  ],
  "keywords": [
    "nope"
  ],
  "duration": 544,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "jCgKqbw_S8E",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67333fc33a168eb5350d7426.vtt",
  "transcript_text": " Leonardo Silva Reviewer's The World of Microfinance The World of Microfinance Yes, microfi. I know it often gets read, my coffee. We're working on that with the capitalization here. But really, microfi is mycelial finance. It's microeconomics. It's learning from mushrooms and learning from fungal wisdom for the future of finance. How can we apply these design patterns to Web3 and beyond? And MycoFi really comes from DeFi was decentralized finance. We have regenerative finance. You guys all know this. CoFi, collaborative finance, quite new to the space, really interesting. You should check it out. And my CoFi was kind of a joke that came out of the CoFi conference and has gotten way more popular. I'm sorry, CoFi. So why should we learn from mushrooms? Well, we should listen to our ancestors. Mushrooms are actually our ancestor. We evolved from them at some distant point of the evolution. We are closer related to mushrooms than to plants or many other forms of life. And they have so much to teach us. They are the regenerative economy of nature. There are lots of design principles. These are only six that we identified for this book, Myco5, that we wrote with Kevin Iwaki in the Green Pill Network, along with Scott Morris, Jessica Zartler, a number of researchers, and looking at these six principles in three different lenses. One, how the mushrooms do it. Two, how it works in Web3 today. There's lots of examples of MycoFi, I would say, underground maybe in Web3. And then third, what can we do in the future with these technologies and these principles? So running through them quickly, because we've only got a few minutes here, how our network infrastructures, mycelium and blockchains are actually quite similar. Mycelium is the network of the forest, the wood wide web. I'm sure a lot of you have heard about that. Mushrooms are having quite a heyday and very similar to blockchain networks in a lot of ways. We won't go through everything just to get through all the principles, but you can read a lot more about it in the book. Their fractal nature, self-similarity. There's a lot of efficiency in design for these types of infrastructures. Emergent coordination, how they coordinate from the bottom up, learning from the edges of the network. Things like quadratic funding actually is a really interesting way to gather sort of emergent signal from communities and then allocate funding matching quadratically. Fungi are the original dhows. They share information, they distribute resources, they make make decisions and they navigate change very effectively so we can learn a lot from these organisms dynamic flow there's no locking in mushrooms everything flows all the time continuous resource distribution through the network we can learn so much from these you know there's lots of examples like radical drips pushing funding to dependencies, conviction voting, flowing our voting power. Inverter Network is working on dynamic token issuance. Lots of interesting examples of dynamic flow in Web3 systems today. Mutual reciprocity. 4 billion years of mutual benefit is what mushrooms have delivered to all of these different ecosystems. I don't know if you are aware that mycelium is kind of like the extended nervous system of nature. Trees can recognize, feed, and communicate with each other. They make forests into networks of mesh stability. Up to 75% of plants' roots can be entangled in mycelial webs. Nine out of every ten trees on the planet is connected to a mycelial network. So we have this really strong, resilient, kind of underground socialism through these mycelial networks. And they encourage polycentric pluralism. Diversity weaves that resilience. Mushrooms can have up to 20,000 different genders, if you didn't know that. So very pluralistic. They're experimenters. So why should we learn from fungi again? You know, they have so much to teach us. There's no mono in myco. Moving from monoculture currencies to permaculture currencies. How can we create different baskets of resources to serve different societal niches that are horribly underserved by the current system and what's our goal here if we can take down you know this current system not by um you know fighting it directly but actually by composting it, by breaking down the parts that aren't working, by reutilizing those resources from the bottom up, serving the core needs of community. I think we have a, I don't think capitalism has a fighting chance, actually. So this is the book we wrote. If you haven't read it yet, free copy is on the top, hard copy, if you want to purchase one, is on the bottom. You can definitely check that out. And we have a few copies actually out in Fungi Sink. If you haven't seen the exhibit out in the main hall, great area, lots of really cool art, and we'll be hanging out there talking a lot about my co-fi. Thanks very much, Jeff. That was amazing. And who wants to ask a question to Jeff? And we'll bring the microphone. It's the last session today. Go ahead. Why are they sharing resources with no profit incentive? It is interesting, actually. Mushrooms do exhibit what's called Walrasian market behavior, so they do actually have profit incentives. They've hooked up mycelial mats and meshes to trees with high phosphorus and low phosphorus, and they found that the trading rates actually change depending on how much of the resource is available. nets and meshes to trees with high phosphorus and low phosphorus. And they found that the trading rates actually change depending on how much of the resource is available. So they trade nutrients, minerals generally to the tree and the tree trades sugars in exchange. But if the resources are in scarcer supply, the exchange rates change. So actually they kind of do just in a polycentric or permaculture economy. There's no one currency. It's a pluralistic profit kind of thing. Awesome. We have time for one more question. One more. Someone, please. Are you excited about that? I would say Inverter Network is really exciting. Um, very sort of like modular, composable, um, toolkit. They're working on a lot of these, um, flow, um, tools for flow, um, allocation of, uh, token distributions. Um, I mean, obviously, Gitcoin, a lot of these projects, Giveth, Givebacks. Wow, there's so many really cool opportunities. QAC, if you haven't heard of QAC, everyone here knows D-AC. There's now Quadratic Accelerators, which is kind of a bonding curve cross quadratic funding mix. Really cool innovation coming out of the space. Yeah, there's so much going on here. I'm sure actually this crowd probably knows more than me because there's so much going on here. I'm sure, actually, this crowd probably knows more than me because there's so much innovation between every conference and there's just so much to keep up with. So it's exciting times. That's right. Exciting times with all the innovation we have seen here in Defcon all these latest years. We have one more question time. So who wants to? One more, one more question. Okay. Um, what was that, was it like the modular tokens or something that you mentioned before? I guess, well, if I was speaking about inverter networks, so they're working on modular components, so you can have issuance mechanisms, allocation mechanisms, decision-making mechanisms, but without one hard-coded DAO experience. You can plug in different, you might have quadratic funding for one DAO, but a different group wants to do conviction voting. Some group might want to have a bonding curve for their token issuance. Maybe someone else wants something more like a liquidity bootstrapping pool or, you know, there's all sorts of different modules that can plug in to create more complex token systems. And I think this is actually really, you know, if you think about computing as well, how do we have such an infinite diversity of computing while we have chips? You know, and chips can be combined in all sorts of different ways. And then we get really incredible technology. So I think we're starting to verge on this on the economic institutional side of things. And I think these toolkits are a really interesting way forward. Awesome people. Please put your hands together.",
  "eventId": "devcon-7",
  "slot_start": 1731410400000,
  "slot_end": 1731411000000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/1vPpKjEWNW5rkIevCpxSX6qLuE5usbq91oz2FVQk6gWw",
  "resources_slides": null,
  "speakers": [
    "jeff-emmett"
  ]
}