{
  "id": "neurotechnology-opportunities-and-challenges",
  "sourceId": "EJZNQX",
  "title": "Neurotechnology: Opportunities and Challenges",
  "description": "A one-day summit focusing on the theme of d/acc: emphasizing the values of decentralization, democracy, differential accelerated progress, and defensive tech including crypto security, public epistemics, bio defense,  neurotech/longevity, decentralized ai and physical resilience.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 709,
  "language": "en",
  "sources_swarmHash": "852eaee2e37a13f88b9cbb6db73a2435d4ae6ac9829466f8639a54b6942172fc",
  "sources_youtubeId": "Q5o_IDX9H8U",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673575df9dbb7a90e1ac4199",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673575df9dbb7a90e1ac4199.vtt",
  "transcript_text": " Because you've had three talks so far. Okay, cool. Right, so kia ora, my name is Niamh, I am from Foresight Institute, I'm Chief of Innovation there, and I care a lot about whole brain emulation. So we are a non-profit in San Francisco, we're a 501c3 and we were co-founded by Eric Drexler who's the godfather of nanotechnology and Christine Pedersen who coined the term open source. We're 40 years old, we're currently an all-woman team and we're looking to accelerate whole brain emulation. So we have five key focus areas, nanotech, neurotech, biotech, space tech, and computation with an overarching track called existential hope, in which we hope to build out flourishing futures. As chief of innovation and strategy, I oversee the fellowships, the prizes, and the grants, and I also build out future programs, two of which we will be discussing here today. One is a lo-fi whole brain emulation mouse brain prize, which we'll be launching next year, as well as our whole brain emulation fast grants and grand prize, because we are looking to accelerate this field dramatically. So what is whole brain emulation? You've heard about it from Juan, but essentially it's the uploading of the brain onto the platform. Why do we want to do this? Because with the, you know, short timelines, we think that this is a really great way that we might be able to coordinate and cooperate rather than just, yeah, evolving essentially with AIs, which is what we want to do. We also know that neurotech is super cool and that it's going to help us with modern day science and medicine, cognitive enhancement, space tech, who doesn't want to jump in a spaceship right now and travel two million light years away? I do. I think it's kind of sad that I'm limited to my own physical being right now. And I think also that whole brain emulation is possibly going to help us with better understanding consciousness. Obviously, just like whole brain emulation is possibly going to help us with better understanding consciousness. Obviously, just like whole brain emulation has never been done before, the human brain has never been mapped before, consciousness itself has also never really been defined properly. So we've got a lot to cover, and this is why it really is the new frontier. So I joined Foresight two years ago. One of the first projects that I really built out was our first whole brain emulation workshop. This here was a pretty big deal because it was the very first in the world. And what we did is we brought together the original authors of the roadmap and asked them alongside AI alignment researchers and neuroscientists, like, why is this stagnated? The report was written 20 years ago. What's happened? Is this stagnated? The report was written 20 years ago, what's happened? Is this still relevant? And what bottlenecks do we need to overcome? The biggest thing for them was money. And it was also because money is really hard to get when there's a lot of stigma involved with whole brain emulation. It's kind of seen as a little bit weird, a little bit icky, even though as we've just listed, there's a lot of benefits to actually exploring this. And so that's what I can do and that's how I can help them. As you can see here, it's blown up at Foresight. Our community is like three times bigger than it has been and just keeps growing. We actually had to reject a bunch of people which is pretty sad to do from a workshop. We are already giving out with our AI safety grants money to help people that are working in our neurotech for AI, so safer AI with neurotech. These are some of our grantees. I don't know if you haven't read yet, but Mark posted on LessWrong. It's very, very good, so please take the time to read it. And this is Catalin's first whole brain emulation wet lab for mouse brains. It's a pretty big deal because it's the very first in Europe, and we help fund that with that. So we are doing all that we can to progress things, and we're building out as we go. Why is our community worth somewhat supporting? Because they're pretty cool, and they're pretty good at what they do, and they're all radical moonshots. shots. So we've now had two Nobel Prize winners come out of our Feynman Prizes. As you can see, we've got Sir Fraser Stott out here. He submitted an essay, the exact same essay nine years later went on to win a Nobel Prize. And then this year, we also had Nick Baker win a Nobel Prize with the same work that he submitted 20 years earlier. So a little bit more of a long game there, but we're with him all the way. And as you might see, Jean Herbet, who's a pretty big deal in longevity, the Amaranth Foundation named his work One of the Cornerstones, and it's about essentially replacement therapies for ageing brain tissue. So we're all on the cusp there. Great fellows, including some of our core community. I see Michael Andregs in the audience. He's working on hi-fi approaches to mouse brains at the moment. He's very good at hardware, so, you know, chat to him if you're interested. Please do. I've got some incredible fellows. This guy here, Akash, is working in India using wearables to better understand scent, which is pretty unmapped at the moment. But also these BCIs are directly capturing EEG data and training AI so that we have better diagnostic tooling for cancer, which is pretty cool. Samner Norman is working on ultrasound for BCIs with his technology and his FRO. Not only has he mapped the human brain as best as it has been yet with ultrasound, he's also managed to turn ultrasound, which is normally like the size of a fridge, into a teeny tiny chip, which is this size. And two weeks ago, I stood in my living room with this chip and found my own heart valve beating on my own TV screen with it, which is pretty huge. I mean, this is kind of what happens when you start exploring things, because you start seeing how innovation can just like fly, and that's pretty great for humanity. So there are a lot of enabling technologies already pushing toward whole brain emulation. If you haven't seen yet, we've just mapped the fruit fly brain for the first time. That's 138,000 neurons, which is a pretty big deal. You should watch the video on science if you haven't already. So that's why we think it's possible. We are launching next year a mouse brain lo-fi emulation prize. That will be a million dollars. A, that incentivises researchers to start working in this field. It also just helps progress things all together. We think the timeline for this to be one is two to three years, but actually, simply through positive competition, this might be one sooner than that, which would be even greater because when we're looking at shortening timelines, we need to do all that we can to find progress, and so that's what's happening there. We are hoping to launch a whole-brain emulation fast grants and grand prize. So similar to Metaculous grants and the COVID fast grants, we know that we can stimulate an industry this way. We can help people with their pre-R&D proofs so that they can then go to the VCs with the proof and actually get the money to build it out. But we need a little bit of help first. And so that's where we're hoping to lean in and be able to actually create space for this. And obviously, like, $20 million is, like, the minimum that we're working with right now. If we can grow that further, then we can obviously, like, help more people and accelerate this even further. So that's, like, a big deal for us. Also, a $20 million prize for whole brain emulation of a human brain is definitely going to get people up in Adam. That's what we think. So come chat to me because I know that we're pretty short on time. Sorry if I went a little bit long. If you'd like to know more about what we're doing and also want to get involved with whole brain emulation. There are a lot of risks but we do want to do it the right way and we think we have the community and the means to be that. Yeah, thank you. Thank you, Neve. Again, if you'd like to go outside and have anyone ask questions, please do. Next up, we have our first remote speaker of the day, Milan Czikovic, he's building a startup in Neurotech right now, so can't be with us today, but I would love to bring Milind onto the screen. We'll be ready to go. Thanks so much, Janine. Let's see, can I be heard? I heard a yes. Okay, excellent. Awesome. Well, I'm very sad I couldn't be there in person. The pictures have been absolutely amazing that I've been seeing, but it's an absolute pleasure to be here virtually. My name, as Janine said, is Milan Svitkovich. I'm the co-founder of Integral, a startup based in San Francisco, building deep brain implants to treat severe neurological and psychiatric disease. But I'm not here today on behalf of my company, but rather as an advocate for the entire space of neurotechnology development. I'm often asked to talk about why I think neurotechnology is so important, but you all are very lucky that you have already heard Juan and have Patrick later in this session who are making that case much more compellingly than I'm sure that I would. So I will just reiterate that I think neurotechnology is indeed a critical technology to ensure humanity's successful transition to an AI world. But moreover, even in a world where I didn't exist, I would contend that neurotechnology is definitionally the most transformative sector of technological progress for enhancing the human experience and improving human well-being in as much as the definitions of experience and well-being are that they are things produced by brains. Instead, though, I was asked to talk about opportunities and challenges. So let's get into that, and we'll see if my AV works. Did that slide change? I think that's a yes. All right. So those who aren't familiar, let me just give a far too brief and absolutely non-exhaustive context for the state of the field of neurotechnology as of 2024. So a neurotechnology is any tool that directly exogenously, so not thinking, but somehow externally observes or manipulates the state of biological nervous systems, and in particular the human brain is often the one we care about, although animal communication is obviously an exciting prospect. The definition that I just gave there encompasses a huge range of technologies and also goals that we might want to achieve with them. With respect to the many goals, Juan already went over some of this. And to be clear, I'm not intending anyone to be able to read the list on the left. I made it comically small to make a point, which is one of the actually kind of biggest opportunities and or challenges in the space, which is unlike a field like longevity or climate technology, where at least at a high level, I think there's some clarity and agreement on what the goal of the field is. Neurotechnology is a little bit more like the early days of the internet or speaking outside my expertise compared to those listening for sure. But what I imagined in the early days of the Ethereum ecosystem were like, which is everyone was really excited about building this platform, this fundamental technology, but it wasn't clear at the outset what all the killer use cases would be or even what would be possible or even what will be desirable. And neurotechnology is a little bit like that. It's something of a marketing problem for the field. We can talk about a lot of exciting use cases, but it doesn't pull the imagination to any one vision. So that's both an opportunity and a challenge, depending on how you look at things. On the right hand side, there are a number of existing and emerging technologies that we can use for observing and manipulating the brain. I'll just highlight some important ones and really not go into too much detail here at all. There's not time.",
  "eventId": "devcon-7",
  "slot_start": 1731555960000,
  "slot_end": 1731556680000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1SnBZ54kfiM59nvSu08JQKHZSM7N-GjLiVE_3-95veIw",
  "resources_slides": "https://api.devcon.org/data/slides/devcon-7/neurotechnology-opportunities-and-challenges.pdf",
  "speakers": [
    "milan-cvitkovic"
  ]
}