{
  "id": "opsec-for-the-dark-forest-or-how-to-avoid-getting-rekt",
  "sourceId": "TAEPPF",
  "title": "OpSec for the Dark Forest (or how to avoid getting rekt)",
  "description": "We will focus on the most important things you need to do to have a good OpSec to survive in the Crypto Dark Forest. I will cover: computer, mobile phone, email, telegram, social media, phone numbers, password  managers and 2FA strategy, security software & social engineering.\r\nThis is based on many years of experience and in the cases we see daily on SEAL 911.",
  "track": "Security",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Privacy",
    "Security",
    "Hacks",
    "2FA",
    "dprk",
    "2FA",
    "Hacks",
    "Privacy",
    "Security"
  ],
  "keywords": [
    "OpSec",
    "Social Engineering",
    "Malware",
    "0days",
    "DPRK"
  ],
  "duration": 542,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "nM2BBNlIRe4",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67332a0d3a168eb535728b37.vtt",
  "transcript_text": " Leonardo Silva Reviewer's Reviewer's Name How are you guys? How's everything? Well, today I had a workshop, but they told me, okay, you don't have an hour, you have five minutes. So I'll make it brief, and I'll go to the conclusions. Well, I'm Pablo Sabatera. I do web-free operational security at OPSEC, where we train and audit companies for everything that is not in a smart contract. And I am a contributor of SIL 911, where we do incident response for blockchain. So what are we going to talk about today? Simple things that we can do to enhance our OPSEC, right? So one thing that is very important to know is that it's not so important if I use Windows or Mac, Android or iPhone, Chrome or Safari or whatever. The important thing is how we configure the tools that we use, right? So first thing I want to talk about very fast, two-factor authentication, things that you do not have to do, do it with SMS. And we cannot do it anymore with TOTP apps like Google Authenticator or Authy. Those kind of 2FAs can be phased and they're being phased every day. We need to use YubiKeys, right? But not the YubiKey with the normal OTP mode. YubiKey with FIDO2. That cannot be phished. This is happening a lot in the ecosystem. Next, soldier engineering. We have to be very, very, very careful for this. Like professionals hack people, not systems, right? Today is much cheaper to attack someone and much easier than to attack a system. So be very careful with supposed recruiters, VC fans, investors and journalists that want to invite you to some call or something. Never download anything. Be very careful with PDFs that you open. They are usually infected. And if someone looks, if something looks like strange, it's probably a scam, right? And everything is a scam until proven otherwise, everything. Next, eventually all of us will get hacked. That will happen. It's not a matter of it will happen or not, it's just a matter of time. So we need to be able to contain the damage so that you know when someone in your team has been hacked, the damage will be contained. Even the founders, even the CISO, even the CTO, everyone. Use an antivirus and a firewall. People think that, no, I use a Mac, I don't need an antivirus. Use an antivirus. MacBook is not good with virus alone. There is a good foundation called Objective-C that has many tools for security in Mac. One more thing, the attack will come from a trusted source, right? For example, we saw how they were hacking the Eventbrite of the events at Delcon one hour before the event, and they send a message from the real account to everyone, hey, you have to mint this NFT. You mint it, your wallet is drained completely. You receive an email that says that it's from Trezor, and it's really from Trezor, from their official system, but it has been hacked. They send you a drainer. You are done. One more thing. Use a password manager and never, never, ever reuse a password, right? But let's use password managers, and we have to have them configured very securely but never ever ever and this is very important very important never put a seed phrase in a password manager right for sure many of you have done it yeah and you say oh I did it but it's okay my password by my password manager is secure no it's not if you have ever put a seed phrase in a password manager you cannot use that wallet anymore you have ever put a seed phrase in a password manager, you cannot use that wallet anymore. You have to move to a new one. Use hardware wallets. Hardware wallets are important. Many will think, okay, these things that this guy are telling us are very basic. This basic stuff is the reason why today 85% of lost funds are lost every day, right? In blockchain. It's not anymore due to smart contracts. We have gotten very, very good at security with smart contracts. And money is being stolen like this. So you have to be really, really careful. Well, I hope you liked it. I will be here if you want to talk more about this. This was a very, very, very small resume. But operational security is important. It's the number one reason how we are being attacked by very sophisticated threat actors. Something that is happening is that in the industry, we have one of the worst objects in all the industries worldwide because we don't have regulations so any company does whatever they think that it's okay and it's not. And on the other side we have very very sophisticated threat actors from nation states that are doing this kind of attacks and they know what they're doing so be extra extra careful I hope you liked it thank you Pablo any questions for Pablo yep oh there do you want to give a go this is on your side and do you want to give it a go? Because it's on your side. Do you want to throw? I have to throw it there? You're much better than me. So what would you recommend to people to store their seed phrases securely? Because I think the challenge is, I mean, I'm a CTO as well, you either have to make it secure or you want to prevent people writing it down on a post-it note. I think that writing down seed phrases is one of the best ways to store them. One hack that you can use that is very, very simple, was told to me by one of the guys from the Red Guild, is buying anti-chambering bags, the ones that you commerce use. So you write it there, and wherever it is that you save it, you save it with that. So with that, you are sure that it has never been seen by anyone. If sometime it was seen by someone, they have to break that. So that's another very good way, and I really like Shamir, like having your seed phrase and cutting it in places in three lists, but only you need two of those three lists, that gives you confidentiality and availability. So I think that's pretty good. Thank you. Do we see any other questions? Oh, over there. There was one question. Yeah. All right. I actually wrote down my question. How do you choose a product for secrets like SSH keys, OAuth tokens, et cetera, management across multiple cloud providers? So a product for what? Sorry? A product for secrets management like SSH keys of tokens across multiple cloud providers I don't have a good answer for that. So I'm not I'm not sure what would I use? The guys that are really because I only talk about stuff I am really really good at right and the guys from the Red Guild have a very good guide on that, so they will be maybe able to ask a question from Fargo rather than me. No, thank you. Thank you. What do you think? What is the most secure, multi-sig wallet or hardware wallet? No, I think that safe is good. And regarding hardware wallets, I consider that all of them are also very good, Tresor, Ledger, SafePal. I think it's how you use them, right? But I think that all of them are very good, and I think that safe is also very, very good. Yeah, there's a question over there. You covered a lot of stuff there, but is there any advice you give on browsers or how you deal with browsers? And that's generally where a lot of stealers are sitting. Yeah, browsers, be very, very careful with the extensions you download. Like, we browsers, be very, very careful with the extensions you download. Like, we have to be very, very careful with extensions. There are lots of malicious extensions. And the other good practice is to have more than one session. For example, you use Chrome, you have five sessions, one for work, one for DeFi, one for personal stuff, one for this, one for that, for that. And you also can have another browser, right? Or even better than that is having another session in a VPN, right? So you have it, sorry, in a virtual machine. So you have another virtual machine with another browser if you want to keep it really separate, and that's also pretty good. Okay, thank you very much.",
  "eventId": "devcon-7",
  "slot_start": 1731405600000,
  "slot_end": 1731406200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1jLrqWU4lm17NODOESY5ysFcreo3AXNtlq_mO-78OMZY",
  "resources_slides": null,
  "speakers": [
    "pablo-sabbatella"
  ]
}