{
  "id": "our-cypherpunk-approach-to-self-sovereign-digital-identity-does-not-work-in-real-world",
  "sourceId": "USJSPF",
  "title": "Our (Cypherpunk) approach to Self-Sovereign Digital Identity does not work in real world",
  "description": "For years our community is using cryptography and privacy-enhancing technologies trying to build solutions that will bring people control over their digital identities. How far have we got?\r\n\r\nThis talk would like to expose a gap that exists between our Cypherpunk approach to SSI and what a real world project needs / wants / can do.\r\n\r\nIf we want our SSI solutions to bring control over their digital identities back to people, it seems we need to take a different approach.",
  "track": "Cypherpunk & Privacy",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "ssi",
    "Digital Sovereignty",
    "Identity",
    "Privacy"
  ],
  "keywords": [
    "ssi"
  ],
  "duration": 442,
  "language": "en",
  "sources_swarmHash": "9310afeb1f82b238e351a86f537a6eb43ee59f033defe00ad24d7a0cfec43778",
  "sources_youtubeId": "7q2YD5QUHmo",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67349f549dbb7a90e13a18b4",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67349f549dbb7a90e13a18b4.vtt",
  "transcript_text": " Hello everyone and thank you for being here. I know the party has already started. I'm looking at you, Carlos. Thanks again for being here. My name is Miros. Thank you for the nice introduction. I work in privado ID. And I want to talk a bit about why I think that our, and I say our because I consider myself to be part of the movement, cypherpunk approach to self-sovereign digital identity does not work. So we have been trying for years, right, to build tools that will protect people and to use all the cryptography and technology that we have, but how far have we actually got? We are offering full user control, privacy, decentralization, anonymity, and business that is actually building applications for people to use. And I'm not talking about us, right, in a battery bubble. I'm talking about people here on the street. Well, these businesses, they want UX, they want integration, they want compliance. What are the key challenges? Well, these, right? First one is the usability. Talk about private keys, but if I look at the initials concept, multi-chain, a lot of words that are un-understandable for a lot of people, right? Ease of integration. If we are talking about people that need to use our technology, or let's say businesses to use our technology, decentralization, most probably not going to work or comes with a lot of hurdles, right? And we need to work with legacy systems if we want billions of people actually to benefit from all this. Compliance, sadly, but we know that the KYC, AML, and other stuff are required, right? Like it or not. So the cypherpunk vision of total privacy and anonymity is an ideal, right? And I'm not saying to kill that, right? We need to keep the ideal there and work toward that, but we need to change some stuff. I call for an incremental approach. I'm just going to take one example here, right, an opportunity, but there are much more of these out there, being the European Digital Identity Incentive. So they recognize the problem, right, that the privacy of the regular people, of the common people, is in danger. And their solution is not ideal, right? They offer selective disclosure, data minimization, verifiable credentials. It's a good step forward, but it's not cypherpunk, right? But I think we should join this. We should hop on the bandwagon, because we can influence things. We can try to change some stuff. And actually, this is why I'm here, right? I would like that this debate happens here between all of us and all of you that are out there on the Internet. So what we could win, right? We could promote privacy for standards. We could encourage more adoption. We can actually have more private and decentralized alternatives. Jordi Bailina yesterday in his talk mentioned, and I agree with that, although it's not ideal, right? I would rather trust my private data with a government than with a corporation. Again, it's not ideal, but it is a step forward, right? And no, this does not mean that we stop fighting, right? I invite you all to think critically about building, advocating, or using, right, the solutions that are both streaming towards cypherpunk, right, but are adaptable and can be used in real world, right? Let's please try to balance, right, idealism with practical constraints. So we can achieve more with what we have today streaming towards the ideal world, right? There were a lot of talks, and I like the talk that was here, the previous from Evian and the other one, right? And yesterday, there were a lot of also talks about cypherpunk movement. It is important. All of you need to join if you are not part of that. But again, I advocate for an approach that is incremental, that we think not only about ourselves, but we think about the people that are out there on the street. That doesn't mean that we do not need Tor, that we do not need all the tools for journalists, for people that are doing really important things. That, yes, but also yes for the common people, right? The struggle continues. I'm Miros. Thank you. Thank you very much. Thank you. So we will have some time to ask a few questions. Raise your hand if you have any questions. I can throw the red square at you. Oh, you want to? No, no, no. I mean, I'm challenging. Oh, okay. Any questions? Do you want to throw it? No, no. I don't want to hurt the CSO of my company. Maros, obviously there are a lot of examples that you've described of ways in which things are suboptimal. Now, ourselves aside, who else is doing it right? government leaders, are there enterprises, are there idealists or leaders who we should look to in our institutional structures as potential partners? I think yes. I mean, whoever was on a bunch of all these talks that happened, and they are going to happen tomorrow and the day after, there are people, right, that are trying to do all this. And, of course, I know our team best, and we are trying the best that we can. But I really like, for example, having the initiative coming from the European Union. That's 650 million people that tomorrow can have privacy towards Amazon. Yes, where do I sign, right? But that's not the end game. So there are people, there are things that we can do and and that's it right no you're right absolutely that's a great call out European Union and also shout out to the etherium foundation for showing up this week on this topic too yes and that's a drop mic, literally. Any more questions? Okay. No? Well, thank you very much. Thank you. Please give a nice round of applause to Milos. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731494400000,
  "slot_end": 1731495000000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1tieWVdz2ClCZUAnL4cwbHgtEkk_tNIfgbdodCv6BfoY",
  "resources_slides": null,
  "speakers": [
    "miros"
  ]
}