{
  "id": "popcraft-mud-day-demo",
  "sourceId": "UDJFDV",
  "title": "PopCraft - MUD Day Demo",
  "description": "This is a project demo for MUD Day CLS: onchain games and non-financial applications. PopCraft is a fully on-chain casual click-based game integrating gameplay with financial elements. Currently in single-player mode, it plans to expand to multiplayer. Built on composability, PopCraft uses PixeLAW, TCM, and Redswap. In-game item issuance and trading are decentralized, transparent, and open, allowing seamless integration of any ERC-20 token projects and DEX.",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Autonomous World",
    "Gaming",
    "Not financial"
  ],
  "keywords": [
    "Fully",
    "on-chain",
    "game"
  ],
  "duration": 296,
  "language": "en",
  "sources_swarmHash": "aff1af8d2c9754f3f42ee7832466c60ad90eb9ccfc155e90e1ece97bd6932049",
  "sources_youtubeId": "fV_xf0pac6k",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735888f9dbb7a90e149563b",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735888f9dbb7a90e149563b.vtt",
  "transcript_text": " Hello everyone, I'm Seki from the Matican team. Today I will show our latest 4-length game, Popcraft. Okay. I always ask myself some questions about the necessity, enjoyment, benefits, timing, and the contribution, but using blockchain in this field. So what's the outcome? In this field, a lot of people have to do a lot of exploring. And we want to do something different. So we chose the cross and composability as our core start point, which lead us to create PopCraft. It's a fully composable game, which makes cross-embedded compatibility no longer just a meme. So the gameplay is just like PopStar. You can even rewind by eliminating all items or bots in 90 seconds. Multiple adjacent items can be clicked to eliminate directly. Sequel items need to buy a program to eliminate. Okay. Okay. This is a video, but I cannot to play it. Okay. What is PopCraft? Simply put, PopCraft equals to pixel long plus this custom scene plus RedSwap. OK. So how we build it? Actually, we build two things based on mount. IEVM compatible Pixelon and PopCraft. OK, we just use Pixelon as a game board for Puffcraft, which gives game very excellent composability at a core level. Okay, so we use this custom machine as a game item factory. When we play this custom machine, we think how we can use this material more useful. We end up, came up with an idea of, we just use this material in another game, yeah. Okay, we use Reswarp as a game marketplace. Okay, Reswarp as a game marketplace. Restwarp is DX or Resto, and it makes the game problem price very transparent. So, the problem now is live on Resto mainnet. You can play it anytime. Okay. Also, you can play beyond Popcraft. You can play Popcraft, purchase game proper in Popcraft. Raise the price of the game prop. You can also play this custom machine, produce machine and produce material and sell them on RedSwap. You can also just be a trader on RedSwap, buying and selling T7 material, they are all ERC20 tokens. Okay, you can do, choose any of the above, all of the above. Okay, composability in PopGraft. Okay, we can replace this custom machine as any other project which has ESC20 tokens as a game prop and a game item. Also, we can replace RedShop with any other DEX. One more thing. I think we need to make crypto vegetable in 4.2 game. We might have to do another thing, but we also need to do one thing. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731557100000,
  "slot_end": 1731557400000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/12K7Vn_cc7jQu6WzJS3EQxpVW_8a_ylzYwi82LxCmSBw",
  "resources_slides": "",
  "speakers": [
    "ck"
  ]
}