{
  "id": "programmable-cryptography-and-smart-contract",
  "sourceId": "VJEDLX",
  "title": "Programmable Cryptography and Smart Contract",
  "description": "Overview\r\nIn some use cases, developers may want to execute smart contracts based on the results of FHE or MPC execution. This session will introduce several design patterns for such use cases and show how Programmable Cryptography can be applied to dApps.\r\n\r\nIn detail\r\nThe results of FHE executions are encrypted and need to be designed to be processed by smart contracts. In addition, the MPC+ZK-based method can solve the private state problem relatively easily using the conventional SNARK verifier.",
  "track": "Developer Experience",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DevEx",
    "Cryptography",
    "MPC",
    "programmable",
    "DevEx",
    "MPC"
  ],
  "keywords": [
    "Programable",
    "Cryptography"
  ],
  "duration": 355,
  "language": "en",
  "sources_swarmHash": "17c804065df8bd60c3c0133f7d5ffdea4c30fe373f0ed0d016d0c9351279fb84",
  "sources_youtubeId": "j9YnU1-MeiU",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67343c949dbb7a90e1b18d92.vtt",
  "transcript_text": "音楽通常のクリプトグラフィックスタッフのRCとして今回はZKPとセキュアコンピューティングを オフチェーンエクスクションに基づくスマートコントラクトを 運用する方法についてお話ししますまずはZKPとスマートコントラーって コーディハーブソリッティベイファイアーウェッチネイルと プレディアスベイファイアーコントラークそれキャンベルファイザー gkp オンチェーン トランスファーズアセットエニア次回はZKP、FHE、NPCでのコンピュータを発表します。後で話します。このセクションでは、FHEとスマートコントラクトをどうインテグレートするかについて話します。FHEの基本理由はエンクリプトエバリエーションです。エンクリプトをできる人レーションand only who can decrypt is just clientso it is difficult to integrate with smart contract by defaultif we using smart contractwe need to share the encrypted resultand also decryption key by client sidebut it does not make sense to achieve the secure computingrightおそびでクリアンサイトバーイティズノーメッセンスとアチーブさせてよかんぴょーてぃんばーさまーふぃーはばーそーしょん コンバイウェイズ jkp を mpcそば5 fhe is a カンティークリーンプルーザー fh エヴァレーションアンド b キャンベルファー8音ちゃーんアザイメーション b 4 b ジャイユーザー3 db ファイアーアンマーチケースチーズリトルビッドファーエンスコンセプト s スペインディクションキーアンシェア8ツーザーサーブパティコントラクトは何でもいいです2つのスタッフはとてもクールですがどうしてもスマートコントラクトにインテグレートしやすくなっています時間の証明とディアの問題に重ねています次のセクションはNPCとスマートコントラクトのインテグレートですNPCのコンセプトはコラボレーションを評価することです各パーティーはコンフィニシャルデータを コラボレーションを評価し結果を得るためにコンポジションを 作成しますこの時はスマートコントラクトと インテグレートを使いませんしかしこの問題を解決する方法を想像できます。例えば、ZKPやFHEと組み合わせることができます。NPCのベリファイアは、FHEのベリファイアと同じコンセプトです。NPCのエクスクをベリファイアで、Smart Contractでベリファイアを使認することで、Smart Contractを使用して、Solidity Verifierを使用します。また、コラボレーションスナックはNPCと同じように、ZKPとNPCを組み合わせます。しかし、これはコラボレーションスナックの場合は、コラボレーションナックスの サービスはコラボレーターにプログラムを生成していますユーザーはNPCにプログラムを 送ることができませんではセッションを終わりにしますオフチェーンのエクスクションや クリプトグラフィーのプログラム化クリプトグラフィーで スマートコントラクトを運用する方法を紹介します主なアイデアは ソリッドベリファイアとオンチェーンベラフィーはクールでサイリアムやブロックチェーンテクノロジーをエンパワーできることができます私は何か問題について考えていますプログラムの時間やデーラーの問題以上ですありがとうございましたありがとうございました質問は Thank you. Thank you, Shoki, for the session. Do we have questions for our speaker? No question? Oh, good. I forgot my volleyball lessons. Yeah, I wanted to understand what other implementations are there, like any use cases or example of FHE? Yeah, one of the FHE use cases is kind of evaluation of stats, like off-chain stats, like a bank account or or GPA or something like that I think next question okay next question okay all right since there's no more question I love to get some break you Okay. All right. Since there's no more questions, I'd love to give some break. You know, when the classroom is tense like this, you need to allow people to have some time. So please, you can get up.",
  "eventId": "devcon-7",
  "slot_start": 1731472200000,
  "slot_end": 1731472800000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1dUK2fPW4Yka7X0nBzFRlJXDKOPHcZn0iLzNpS3rUVcI",
  "resources_slides": null,
  "speakers": [
    "shouki-tsuda"
  ]
}