{
  "id": "project-mirage-mud-day-demo",
  "sourceId": "BVANRC",
  "title": "Project Mirage - MUD Day Demo",
  "description": "This is a project demo as part of the MUD Day CLS: autonomous worlds, onchain games, and non-financial applications. Project Mirage is an onchain island management game where players build, expand and trade their islands.",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 206,
  "language": "en",
  "sources_swarmHash": "447ea7e3caa545f9b9abe80a90fee1ee9304096a65c62f14a199a99ec90b97e2",
  "sources_youtubeId": "YEZN8zdHRx4",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673591ec9dbb7a90e1f51b8b",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673591ec9dbb7a90e1f51b8b.vtt",
  "transcript_text": " Steal someone's identity Xavier? No, no, okay. Hey, my name is Xavier. Closer, closer. Closer, okay. Hey, my name is Xavier. I'm the owner of Project Mirage. Project Mirage is an island building game, and we are using Redstone Garnet, testnet, and we are building Foley Ahmad. So let me demo the game. So when you begin, it's not like that. It will be like an empty island with a city hall in the middle. You have to pave road. Yeah, you have to pave road and add more buildings. You can see there are drop downs. We have a road pavement. You can drag. You can save the road and add more buildings. There are various categories of buildings. There are residential. The first thing you need to build is like resident buildings to add like laborers, but you also can build like different commercial, industrial, civic landscape to like fulfill certain requirement and produce certain resources. So for example, I can put like a house here and put like a commercial building nearby. You can view the details by clicking into the buildings. We have some red ones here. Oh, now, oh, level up. Unlock some buildings and put some names, like X island. By reaching certain levels, you will see something like this. This is my own island. So I have built like virus buildings. We also have like a functionality called summon. So I don't have like resource to summon any character right now, but you can view the character here. For example, I have this one. We have some description. And you can actually produce resource by assigning the character. So for example, this one, he can plus 4% onto the resources. Yeah. He can plus four percent Onto the resources. Yeah and also we have a functionality called shares so for example if I visit my co-workers Island I Can trade shares on her island for to become like a shareholder on different people's island you gain profit by gaining resources when the other owners produce resources. So you gain a certain percentage. And also you can trade shares. And with the priority of the island coming up, the share becomes more expensive. Yeah. We can also visit other people's island. There's a leaderboard on our game test. For example, this is one of our top players. And we can see his island's much larger than mine. Yeah, that's it. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731557400000,
  "slot_end": 1731557700000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1d-1krZg7I-YltJPVKWhfg0Tl6wSDlA4A7_wN3qi3s3M",
  "resources_slides": "https://api.devcon.org/data/slides/devcon-7/project-mirage-mud-day-demo.pdf",
  "speakers": [
    "y77cao"
  ]
}