{
  "id": "proof-of-personhood-panel",
  "sourceId": "GVML7H",
  "title": "Proof of personhood panel",
  "description": "A one-day summit focusing on the theme of d/acc: emphasizing the values of decentralization, democracy, differential accelerated progress, and defensive tech including crypto security, public epistemics, bio defense,  neurotech/longevity, decentralized ai and physical resilience.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 1226,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "42cJ6IZlhMk",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673592a79dbb7a90e1088fac",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673592a79dbb7a90e1088fac.vtt",
  "transcript_text": " Hello, hello. Great. So we just had a nice overview of the three protocols. And what I want to do in this small amount of time we have is just challenge each one. I think there's something to learn from each approach here and see if we can come to some greater synthesis. So I'll start with Remco. So Remco, I actually wrote a critique of proof of personhood. It's called Compressed to Zero, The Silent Strings of Proof of Personhood. And what I did is I looked at a parallel protocol to WorldCoin, a different authentication mechanism. But they had succeeded in verifying unique individuals through cognitive tests. And they had avoided the problem of account trading, which WorldCoin has had to grapple with because each account has money. And then, of course, there's an incentive to sell accounts early on and so that's something you're grappling with. They had solved that with this novel mechanism called sublinear identity staking, which I'm happy to talk to you about later. But they were still left with this information game theoretic problem around puppeteering, which is that when you have an account and it has monetary value, it has a UBI stream coming towards it, which is one of the goals of WorldCoin, you create incentives for other people to try to control those accounts and extract from them. And so the kind of pithy way to put it is when you try to differentiate humans from bots and use UBI incentives, you actually create an unintended consequence of humans trying to control other humans as if they were bots, right? And so the control problem becomes an information problem, and it's an information game theoretic one. So I want to know how you think about this challenge, because there are two goals that are very explicit with WorldCoin. One is both UBI and a kind of rails for democratic governance and even maybe even AI alignment. But if ultimately, you know, pursuing both of those goals ends up in coalitions and oligopolies and basically politics, right? And one person, one vote breaks down very quickly in a coalition. It's like, how do you deal with that? How are you thinking about that? So we're at 16 million users now. 16? 8 million in the highest tier or verified unique human. And in the process of growing to this scale and being active in dozens, if not nearly 100 countries right now, you kind of see everything that people can throw at you. And while the vast majority of people is honest, there are some very dishonest actors out there and you have the Byzantine generals' problem of you need to make your system resistant against malicious actors. I think this is not, as you mentioned, this is for every proof of personhood primitive out there. There is this issue. As I said, proof of personhood is not a CAPTCHA. So there is this idea that you can delegate an account. This is not something I think we should prevent, but it is something that you need to give the user the tools to properly manage, which means that it needs to be explicit, it needs to be consensual, it needs to be revocable, and so on. So I think the emphasis is on developing those tools, empowering the user to control their world ID in the way that they want to control it. Blockchains as a whole are not particularly good at the moment at these kinds of things because a lot of decisions you make on chain are one-way streets. But there are a number of things we are already doing here, like allowing you to recover your account by going back to an orb. One thing we've rolled out that is very powerful is using the phone's front camera to do additional interactive face authentications to make sure that the wallet hasn't been stolen. It's still in the possession of the original human that signed up and so on Right Maybe I can Comment there directly so I made in this presentation my claim that I think this absolute identity They're actually not that many use cases for it and kind of just to give the extreme example Why I'm making this claim is let's say somehow North Korea does get hold of one of those orbs and and can can we are properly authenticate they're all there 25 million I'm not exactly sure how many people they have probably no one knows but 25 million people so let's just say in WorldCoin now you go from 8 million fully verified to now 32 but 25 of them are just people from North Korea where it's not even clear whether they have control of their key or probably it's somehow centrally organized that someone ultimately has full control of those keys. Now you have 32 million properly verified actual humans. The question is, for what application would that set be useful? So my claim is, in absolutely most applications, and probably actually this gas subsidy that you're doing is one of the few where I think it is useful, but in absolutely most applications, I would say you need more context than just being human. If you want to go even more extreme, we can think of this Matrix movie where they're literally, I mean, in the Matrix movie where they're literally farming humans, or it kind of has those farms of humans that basically just sit there and yes, they might have an eyeball, you might be able to scan that, but that's really not what you want. Right, and even just to add on, as long as there's money at stake, I mean, we have synthetic biology, it could also be just sort of synthetic eyeball forms to hack the system. Okay, hold on, there's like a couple different things going through each other here. Static eyeballs don't work because with biometrics it's critical that you verify that it's actually part of a real live human body. If you get possession of an orb and you abuse it, while the signup process between the user is absolutely anonymous and privacy preserving, the orbs themselves are not. Their behavior is public and there are methods you can use to actually revoke the fake accounts that might be... But there are no fake accounts. Okay actually revoke the fake accounts. But there are no fake accounts. Okay, that's the second part. If they are not fake accounts, then the system works as intended, in a way. And you make a very good point that proof of personhood is just a primitive, and you need a richer ecosystem of things around it. The example I like, a very simple one, is let's say you have an on-chain DAO. You want to implement one person, one vote. If you just do this and allow all of the world ID verified users to vote on this and your social community is only 5,000 people, you can easily get swamped. You don't have a very strong governance system that way. So you do need to incorporate this in more complex systems. Lascha? I 100% agree. Lascha? Can I add something? I kind of like... I get all the points, but I think like forgetting the orb or the eyes and stuff. So I agree that overall identities, and I don't believe in universal identities, because identities have to be built for the governance purposes. So we should come up with frameworks that increase the coordination quality among the humans and then decide the depths of the identity, how it should be built. When we talk about the proof of personhood, it has like two dimensions, right? One is the proof of uniqueness. And I agree for the real world and especially in multiple cases, just uniqueness proof and badge does not guarantee the quality of decision making or coordination. And then we have to rely on passports or like citizenship or the age or like all the other stuff. And the thing is that like if we, like for example for voting, refer to the passports, the dependency on these document is so big that we can generate the uniqueness based on data and we might not need any type of biometrics additional to it. And I think, in a way, that's the purpose of identity. So I don't believe in universal identities. I believe of defining whether we like fighting AI or we like fighting the misinformation stuff. The only systems that are dynamically evolving and improving are the ones that have this kind of fluid identity aspects and not just the universal ones. Like on the example of Twitter and the community nodes. So just labeling is just creating this very low barriers in terms of defining the permissions. What you can do or or you can't do as a human or not. And like you said, yeah, there's a kind of North Korea scenario. There's kind of a dystopian scenario where we might be like creating market, right, for the eyeballs and stuff. And like you got two kidneys, you got two eyes, and then what happens next, right? Well, what you raised is an interesting point about governance, right? Because in some sense, the point Martin was making is highlighting an enforcement problem, right? And this gets back to the information problem. Yeah. Right? And so even if you do succeed in authenticating unique individuals in North Korea, how do you actually enforce that? And what you're saying is, well, you need richer governance mechanisms. We need to express identity in different ways, right, as a complement. And if you just have that one identity system, ultimately enforcement would require surveillance. And, of course, surveillance results in everyone becoming informationally the same. So I want to shift gears, Martin, and poke a little holes at circles. I think it's a great experiment. But one of the things I noticed on your slides is, you know, you're talking about currency and money. I think of them almost as community currencies and like nested networks of cooperation building in a nation states and like, you know, even the globe. But, you know, not everybody in a community should receive the same amount, blood, sweat, and tears, and contribution. It shouldn't just sort of be like an hourly rate. That's another kind of UBI that has its own pitfalls because it's not tied to incentives. And you mentioned a 7% interest rate. These things seem arbitrary, and they don't seem to leverage incentives or people's voice, choice, and stake in a community. So how do you think about that? Yeah, I mean, should they receive the same amount? I would say if a bunch of people together comes together and decides to use something as money, then just that coordination effort to some extent creates value to whatever they decide is money. And I would argue that the fairest form of distributing this value that has been created by just this coordination effort would be to distribute it equally among those that join this coordination effort. Super important to understand that that doesn't mean that everyone needs to work for the same hourly rate or doesn't need, I mean, that's absolutely not the case. So it's just that the coordination effort is in a way or the benefit of that is equally distributed. Sorry, there was a second question that I... Just, you know, non-equal distributions within, you know, acknowledging that there's different levels of contribution. I believe it's the 7%. Yeah, 7%, right. So that is probably the only parameter in circles that has been set and that's therefore debatable. And yes, you could say every community should be able to set that themselves. That would make coordination much, much, much harder. Why? Well, because then you would need to, or in circles, it is meant to be so simple that I issue circles, and then I know I can kind of trust that other account. I can exchange my money to their money one-to-one because we are issuing under the exact same rules. If everyone could define their own rules it would be much harder to negotiate of how much should my money worth compared to yours. So I would say for a stable equilibrium, the goal of circles is to have the stable equilibrium where the exchange rates between circles are just one-to-one. The goal would be to say one circle is one circle, and it's kind of abstracted away the fact that under the hood, we have all those different... Just like in the dollar system right now, technically speaking, if you have a dollar at one bank and a dollar at another bank, those are not the same dollars. But the system is built in such a way that usually it feels like one-to-one because if everything goes well, you can exchange them one-to-one. But if it breaks, you will realize, oh, the dollar at the bank that just went bankrupt is different from the other one. But the US and Euro have floating exchange rates. Why can't you... Say again? The US and Euro have floating exchange rates. Oh, no, no, for sure, for sure. So, in circles, yes. I mean, the expectation is they are within a connected cluster, the exchange rate is one-to-one. But, yeah, there can be different clusters where within the clusters the exchange rate is one to one but between the clusters there are floating exchanges. Why not just rely on supply and demand? Well it will be I mean the price between those clusters will be defined by supply and demand and what we are actually supposing in our upcoming relaunch I'd say, or restart, or reactivation, it's a continuation of the system, is that people or groups can back their very own circles with reserve assets they want, Bitcoin, dollar, whatever they want, and then there will be a free floating exchange rate for those circles, so defined by supply and demand. But as long as people trust each other, then they are essentially creating additional one-to-one demand between those currencies. Maybe we need to go back to the identity topic. No, but you're expressing identity in a different way, and so I just want to dig on that. But I want to turn to Lasha now. So how do you see yourself and Rarimo in this constellation of identity protocols? What like differentiation do you see that you're bringing? I think we try to use the both sides of the world, such as passports as an instance first, but then extended with graph and capture more depths of the interactions. What I would say is how we try to solve the identity problem or enable the buildup is very use case centric and like I said, the identity problem or enable the buildup is very use case centric. And like I said, the governance centric. The fact that we understand this voting stuff has to be done that way, it gave rise to solving the uniqueness problem in a certain way. But this doesn't mean that the same uniqueness should be reused universally across other use cases. And so going at a primitive level of these kind of registries and the building blocks and having more like this kind of flexible framework, I think that's the way forward. And as well as we've seen mostly on the regulatory pressure or this kind of collusion risk, I think the permissionlessness and empowering of the users going forward should be this kind of collusion risk. I think the permissionlessness and empowering of the users going forward should be like this kind of core principle that no one should kind of violate or cross the line for. So we only have three minutes left. I want to quickly do one minute each on where, you know, AI is a part of identity is helping us leverage AI to communicate with each other, also to govern AI. So starting with you, Remco, where do you see the most immediate use case with WorldCoin in the near future? And world or world ID interfacing with AI will, you know, open AI, for example, grant free access if you have a world ID. What is the sort of immediate near-term goals on that interaction? I mean, I can't speak for open AI, but we do share some money in common, so we'll see what happens there. Regarding AI, I think we need to embrace the fact that it's going to be some sort of human-AI hybrid operator. I'm a big believer of AI is just making humans better versions of themselves. So this is why I think it's so important that you distinguish between a CAPTCHA and a proof of personhood, which are different primitives with different use cases. And we might not even be that interested in the CAPTCHA use case. What is going to be a very important problem is distinguishing real world sensory data from faked data and authenticity. I don't think proof of presence alone is a solution there, but I do think it can be an important part of a functioning solution that allows us to authenticate content and information. Lascha, any immediate applications? Yeah. In my world, I don't have this like us humans and AIs and kind of like the separate camps of the camp. I more see and question like, okay, what is the first thing? Like I own multiple AIs. So the first dimension is how do I control it so how do we build this my me my AI and identifying these relations and control and then zooming out like all the AIs of individuals or like the systems how do they coordinate and what are the mechanism for us so I don't know like lower down the computational capacity or shut certain things down and abstract them. This is the next level of governance problems that we should be figuring out. That's where the identity aspects will be born uniquely. Martin, I know you're thinking a lot about AI? Yeah, I think it's certainly good to have a robust identity framework in place that also is relational because, yeah, for the reason in the very beginning. So I like to see a version of something like Circles that's completely permissionless as a base layer built on this trust graph. But then, yeah, projects like DK Passport permissionless as a base layer built on this trust graph, but then projects like DK Passport or WorldID that can essentially provide additional attestations, what I would call it, to those open base layer identities can bring us a very robust system overall where humans can coordinate if necessary maybe against AI. Will each circle have its own AI agent? That's a good question whether AI agents will also use circuits or not. I don't know yet. They could. Alright, let's give them a round of applause everybody. Thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731559800000,
  "slot_end": 1731561000000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1jVtcSZgrBxcYG4lFAatpVuooVRxzUpgPKggpcsgETVM",
  "resources_slides": null,
  "speakers": [
    "lasha",
    "martin-k",
    "puja",
    "remco-bloeman",
    "vitalik-buterin"
  ]
}