{
  "id": "protocol-alignment-governing-like-a-protocol",
  "sourceId": "JDKAJD",
  "title": "Protocol Alignment: Governing like a Protocol",
  "description": "We define a protocol as aligned when all stakeholders in its network agree:\r\n1. The protocol’s objectives\r\n2. How to measure progress toward objectives\r\n3. How to achieve the objectives\r\n\r\nIn this talk, we'll explore both new and old decentralized mechanisms that governance leads and protocol designers can leverage to address misalignment in governance.",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Governance",
    "Futarchy",
    "Mechanism design",
    "Futarchy",
    "Governance",
    "Mechanism design"
  ],
  "keywords": [
    "n/a"
  ],
  "duration": 548,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "I_lMVnDgxvk",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6734816a9dbb7a90e1cffacb",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6734816a9dbb7a90e1cffacb.vtt",
  "transcript_text": " Thank you everyone. Perfect. I am not your handle, also known as Vaughn. I'm going to be talking about protocol alignment, governing like a protocol, which sounds really, really strange, but trust me, it will make sense in a second. protocol, which sounds really, really strange, but trust me, it will make sense in a second. First of all, I'm going to start out by talking about why we need governance. I think most people think they understand what governance is. I'm pretty sure in the context of crypto, they don't. So here's at least our picture of governance. So thinking about governing a piece of software is fairly strange. So what I like to think about is governing something people kind of have a good model for, which is a vending machine. There's actually an incredible picture somewhere in Hokkaido that has done the rounds on Instagram. I love it. But you can think about a blockchain protocol as being kind of like a vending machine. It's fairly simple. It defines some rules. You can interact with it. And it does something every single time that you try and interact with it. And if you think about the box, the box is kind of like a set of rules. And they just specify how anybody can interact. And the value prop, at least from my perspective, is that protocols are great because they make the future more predictable. Nobody can come to a vending machine and do anything but put money in and get products out at a predetermined price. Now, governance, the job of governance is to extend this. We need a set of rules that specify how we can also make changes to that protocol. If we could make any change we want, that means the protocol would no longer be able to give us any certainty about the future. The future would become less predictable. The value prop is that protocol governance also makes the future more predictable. If you have bad governance, then the future becomes less predictable. And there we have governance failure. If you think about a vending machine, a vending machine's job is to give you exactly what you want. And if you go to a vending machine and no one's been able to update it, right, as in put more products in, you'll find that the vending machine no longer does the job you expect it to do. The vending machine slowly starts to lose its value and again you no longer interact with the vending machine or protocol. So we need protocol governance because otherwise our protocols would no longer get users. You can think about the action space of all the things you could do in a protocol, right? Or with a protocol or in life. And then you can think about a set of actions being aligned with the goal of a protocol, right? Updating the products in a vending machine is aligned with the goal of the vending machine. Punching a hole through the front of a vending machine, not aligned. So you can think about governance as being that ring. It's the rules you put in place to govern the set of aligned actions allowed to occur in a protocol. So governing like a protocol, from my perspective, is really governing four buckets of actions. If you think about a protocol as just being a set of functions that you can call, one for Uniswap could be something like swap or add liquidity, and then another function, which is just how you update those functions. And that's what we call the governance. And the governance really governs protocol upgrades, making changes to the code itself, adding parameters or changing parameters, which is changing parts or variables in the code, policy updates, so anything that's like soft governance, any rules and processes we have around the protocol itself. And then, of course, resource allocation. Another way of thinking about governance is it's a set of state transitions between different versions of the protocol. So you can see participants sending messages in, they're voting, they're putting in proposals, and over time we're agreeing which versions of the governance to change, so upgrading from V1 to V2, or indeed if we change a function, having the first version of protocol and changing it to the second, the third, the fifth, and so on. Now what I wanted to do is very quickly run through some ideas. They're going to be fairly rapid-fire, and we can tackle them in the questions if that's interesting. We've, at Butter, have been looking at loads of different types of governance systems. Now, one of the ones that we have already is token governance. We like to vote on proposals. We use our tokens to provide some information about our preferences, and we gather those all up, and tokens to provide some information about our preferences, and we gather those all up, and we make decisions. Great. This is a vote that took place very recently for Tally. We all know Tally. We love Tally. Tally wanted to put a proposal into Uniswap that basically asks for some resource to be allocated to them, and this passed. So when this passes, we say there's 38.8 million uni voted for this. We have to ask ourselves what happened, and one of the things I want to get into your mind today is that the way that we vote is based on our preferences, which is also based on our incentives. And most people in the world are dangerously long themselves. Most people are self-interested. They care about the maximum return to themselves. So if you think about those people turning up to vote, this is how you have to think about them. And as I said, a token holder vote is a token weighted average of stakeholder interests. So that's what you're getting. You're getting this kind of as an average, a token weighted average. Some other mechanisms you could use include auctions. You could, for example, auction off proposals. I wouldn't encourage you to read the text I put on the slide. I just put it there because I thought it was interesting. But if you look at that, I think most people understand how auctions work. You have a seller, they're selling something, people are bidding for it. So imagine bidding for a proposal. We actually decided to design one of these, a proposal market, and it turns out people didn't like the idea of bidding on proposals. But you can imagine the idea that you're bidding to buy the right to pass a proposal. And you can imagine all the ramifications of doing that. And come and speak to me if you'd like to know more about Mae'n ddiddordeb arall. Mae'r un arall yn priddio cymryd ymchwil. Dyma lle mae llawer o bobl yn edrych ar rywbeth ac wedyn yn penderfynu a ydynt yn credu bod yn ymgysylltiedig neu ddim gyda'r golau. Gallech ddweud bod cymryd ymchwil togen yn deby. Ac mae hynny i'w ddweud, mae llawer o ffyrdd eraill o gwneud i bobl wneud y rôl hon o ddewis pa ffyrdd sy'n cyd-dweud y nod o broscoll. Un o'r pethau rydyn ni wedi bod yn hynod o hyd yn oed yn ystod ystod ystod ystod ystod ystod yst One where you make decision A, B, C, or D. What you can have people do is speculate on the value of you... Sorry, speculate on the probability that you achieve the outcome you want in any of these worlds, and you can use the probability to determine which world that you want to be in, and you can use that to actually make a decision. This works interestingly well. It's something that we're trying out. We'll have some trials actually going live very, very soon, maybe in the next couple of months. And you could imagine a market for making a decision on who to hire as a prediction market. So you can predict who would get the result you want, which is the amount of engagement with a particular proposal, with a particular piece of work, and then you can sell the potential outcomes as tokens, and people can bid on them, and they'll give you the probability that each of these events will happen and then you can use that to actually make the decision on who to hire. So a futaki ELI 5 is if markets believe an outcome given decision A is more valuable than an outcome given decision B, choose decision A. And ideally, decision A will be very aligned with the goal. So what we like to do in governance is build a system where being long yourself Ac yn dda, bydd penderfynu A yn gysylltiedig â'r nod. Felly, yr hyn rydyn ni am ei wneud yn y Llywodraeth yw adeiladu system lle mae bod yn hir eich hun yn yr un fath fel bod yn hir ar brotocol penodol, mae hynny'n golygu eich bod chi'n g prosiect, felly mae ganddo tali yn hytrach na phosib arall arall, yn gwneud cynhyrchu'r cyflogwr, a allai fod yn y metrig rydyn ni'n ei hoffi. Mae gennym bobl yn fudio ar y tokenau hynny, ac maen nhw'n cynhyrchu cynllun, neu dd Mackenzie from Butter and please come and speak to us about Futaki and decision markets. Thank you. And let's take some questions from the audience. We can pass around the mic. Anyone has a question for the speaker? Oh, we do have a question over here. Oh, we do have a question here on the first row. Hello. My question is how, I don't know if I, is, I'm going to say, well, how Futharchi works on DAOs? Absolutely. So a DAO could decide that it cares about something such as sequencer revenues, for example, and it could then decide to ask a question about whether a particular decision, say, if they choose to invest in a particular protocol or if they choose to roll out a particular program or make some decision, if that's more likely to increase sequencer revenue. And then you can compare the probabilities and you can make a decision based on which the markets believe is most likely.",
  "eventId": "devcon-7",
  "slot_start": 1731490200000,
  "slot_end": 1731490800000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1n1_ahUlOLb7iuUb9uaTE_CyPbh0s7FZKpQGTyQ4xxps",
  "resources_slides": null,
  "speakers": [
    "noturhandle"
  ]
}