{
  "id": "quarkid-bringing-south-america-on-chain-with-ssi-and-account-abstraction",
  "sourceId": "QXCTMB",
  "title": "QuarkID: Bringing South America on-chain with SSI and account Abstraction",
  "description": "QuarkID is a Self-Sovereign Identity protocol bringing millions of South American citizens on-chain. Citizens in Buenos Aires, Argentina, Monterrey, and Nuevo Leon, Mexico, are using government SSI deployed on ZKsync Era through the QuarkID protocol. Driver's licenses, birth certificates, and over 50 different credentials are secured by Ethereum technology in the world’s first case of governments using Ethereum’s permissionless blockchain to meet their identity needs.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "2FA",
    "Account Abstraction",
    "Identity",
    "Open Source Software",
    "Political systems",
    "Politics",
    "Public good",
    "Use Cases",
    "Validiums",
    "Zero-Knowledge",
    "ZK-EVMs",
    "ZKP"
  ],
  "keywords": [
    "Sovereign"
  ],
  "duration": 1183,
  "language": "en",
  "sources_swarmHash": "b778c903f53cea71812ed118675883effd57f913af3ef91ebe387eecd6c274a6",
  "sources_youtubeId": "5c43HjCcZeg",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736bbe99dbb7a90e1323fe9",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736bbe99dbb7a90e1323fe9.vtt",
  "transcript_text": " Thanks so much for being here. Let me share with you the... My name is Diego Fernandez, I'm the co-creator of QuarkID. And let me start by showing some hard facts about what QuarkID is. First, it's a self-sovereign identity protocol. It's open source under Apache 2.0 license. It's a digital public good enrolled in the Digital Public Good Alliance. It was launched in October the 21st in Buenos Aires City with 3 million inhabitants, and we onboarded almost 165K users in less than one month. And we have 80 million users in the confirmed pipeline, and that comes from three cities in Argentina and in Mexico, four subnational states, both in Argentina and Mexico, who are doing two pilot projects with national governments in El Salvador and in Argentina. And we have onboarded also two major banks, which is Banco Macro, the second biggest retail bank in Argentina, and Banco Santander, as well as one of the biggest telco companies in America, which is Tomex, with more than 100 million users. Why did Buenos Aires City start the QuarkID journey? Our vision was first governments should pay the friction to create highways of trust because it will bring enormous value to society. And that highways of trust should be open, non-permissioned and available without any government oversight to everyone. And that should give users the ability to decide how, when, with whom and what information to share. And we did this in collaboration between governments and startups. And we found and we discovered that that creates a thriving web-free ecosystem that we believe will bring prosperity to society. What were, in my perspective, the three key decisions that we needed to make? Well, the first, decentralized versus centralized. The second, open non-permission versus private permission. And the third, open source versus proprietary. And this is pretty important because governments, unfortunately, usually choose the downside of these options. Centralized, private and permissioned, and proprietary. And we believe that that sort of waves are starting to change. And of course, we chose decentralized, open permission, and open source. Very briefly, what's QuarkID tech stack? QuarkID again is a protocol which runs on top of the CKSync stack which uses Ethereum as a security layer. But when you are planning to deploy a system to millions of people using decentralized non-permission technology, you face an evil dilemma, which is users use today centralized Web2 applications, which have an amazing UX. And when we migrate to Web3 world, we're very familiar with that, UX is so terrible. Just claiming an NFT requires you to go back and forth in wallets and signing transactions. It's so hard, so hard. UX rules the game. If we don't have a simple approach to UX, so hard, so hard. UX rules the game. If we don't have a simple approach to UX, there will be no adoption. What is the evil dilemma solution that we found? Well, we give users the choice. You can download the open source wallet from GitHub even and compile it yourself, or you can download it from the App Store. It's an open source, non-permission self-custodial wallet. But we implemented QuarkKD technology within the government application, which is running on decentralized railways, utilizing CK-SYNC era and Ethereum, but it's a self-custodial wallet for users which are not so used to deal with this type of technologies. Our way of thinking is, hey, what application will use my 85-year-old mother when she wants to download a new application in her iPhone, she calls me and says, hey, son, this application is safe. That's the level of users that you need to understand that we will be a substantial part of your user base. So we need to give users the choice of having a very simple custodial solution that runs, again, on decentralized railways. Or you can go full decentralized encrypted. That's your choosing, not ours. And it's always a use case. And I think that we as a community need to understand that people don't buy technology. Decision makers in governments and institutions, they don't buy technology. They mostly don't care about technology. They buy use cases that solve real world problems. We need to think, and that's my perspective, as technology, we need to think in technology as a tool, as a means to an end, not an end in itself. From real world decision makers, if we have the use case, which is pretty simple, a policeman, and that is happening in Buenos Aires today, a policeman, instead of asking you for a piece of plastic, shows you a QR code, you scan it with your wallet, and that gives the policeman the proof that you're able to thrive in. For decision makers, for a major, a governor, the president of a bank or whatever, 99% of the decision relies on use case. Of course, we use Ethereum as a security layer, CK-SYNC to provide CK proofs. We have native account of fraction. I will follow up on that because it's pretty important. And users control their information, not institutions. But decision makers will see use case. We love technology. Decision makers make decisions based on use case. And the question is, how do we get billions of people on chain? Today, according to statistics, we have almost 600 millions of people. There are 8 billion people in humanity. How do we solve this problem? I like to think that the Quark ID mission is adoption, adoption, adoption. This is a very famous quote that Steve Ballmer gave once, you know, this champion all over the place, we probably all saw that. And of course he was saying developers, developers, developers, and many of us are developers here and of course developers are crucial. But when Steve Ballmer was saying developers, developers, developers, his company, Microsoft, had 95% of the user base using Windows. So then it's easy. He already had gained adoption. We as a community haven't yet and we need to get there. And in my perspective, and this is kind of radical, we need to try and horse the system. And I don't mean this in a bad way. We need to find a way to gain adoption through the system, not against the system. And I am positive that that Trojan horse, that positive Trojan horse, is self-sovereign identity using account abstraction. And why is that? Because, let me go back there. Account abstraction is crucial because each user, when he gets an identity minted in QuarkID, they are using account abstraction and they have an account in CK-Sync era. It's as straightforward as that. And that enables a lot of use cases. And I was discussing the other day, next year, Buenos Aires City will be piloting the chance of giving subsidies. I mean, the city gives out subsidies to several different things, something like $35 million a year to different type of beneficiaries. Buenos Aires is evaluating the chance of giving subsidies using their identity wallets, using a token. And there is a great advantage when you're dealing with subsidies. And that is being done because of account abstractions. That's a great opportunity. And why are governments so, so important? Because they provide us, or they may provide us, with a reverse adoption life cycle. If governments can't help to create the necessary railways of trust, we as an industry should help governments to achieve this goal. And for me that is crucial. We need to focus on that. We need to understand that there are champions, there are government champions, there are institution champions out there that have shared the same ethos that we share, that believe in a future with self-custodial basis, decentralized, non-permissioned, censorship resistant and they need help from our side and we should provide their help. I firmly believe that a decentralized, non-permission, open-source future is possible. And I'm convinced that we need to do that with governments and with institutions and not against them. And that's our goal. Thanks so much. That was quick, man. I got 10 minutes left. We can do a lot of Q&A. We can definitely do a lot of Q&A. We can definitely do a lot of Q&A. Well, feel free to send all your questions here, but let me go to the first one as well. How does the open source nature of the project impact business model and perhaps monetization? No, there's no business model for Croquet. This is an open source protocol, which is being used by several governments. It's not a business. I see. Going through the top questions, is it possible to interoperate with other protocols? Yeah, definitely. I mean, two things here. Of course, we... Over here. Great, thanks. Sorry. So, of course, we have two things there. First is the W4C standards, which define DIDs, which is Decentralized Identifiers and Verified Credentials. And that gives you a level of interoperability. But, and I'm happy to say this, this is the first time in any DEVCON that we have a specific workshop of self-sovereign identity. And all of us in the industry are meeting today this afternoon in order to precisely work on interoperability with the cash from privado and so on and we think that there's a bright future in doing that. All right next question why Buenos Aires West start there and I can recall that you are planning to expand to Argentina, Mexico and Colombia. Perhaps you talk about the country expansion plans and the different regulation challenges in each jurisdiction as well. I have a very particular view on regulations. First, Buenos Aires is an extremely crypto-friendly city. You have a great pool of talent. Many of the most important projects in the Ethereum ecosystem and in the crypto ecosystem came out from Buenos Aires, just to mention a few. Open Zeppelin, NAMIC Foundation, I don't know, Crecimiento and Aleph and so on. We have very, very important projects coming out from Buenos Aires. Decentraland, one of the founders of Sandbox. I could keep on mentioning a lot of projects. So Buenos Aires has this amazing talent pool. We are so focused in the crypto industry. And when I, as my former role of Secretary of Innovation of the city, made a call out to the startups and to the innovators in Buenos Aires, everyone started collaborating and we came up with this solution which we're really proud of. Okay. Crypto-friendly city. Where else besides Buenos Aires? Well, I mean, Buenos Aires is a crypto-friendly city, of course, and we are working as a community very, very strongly and now Milagros from Crescimiento will share that with you. We think that Buenos Aires and Argentina could become one of the first, if not the first, crypto country. We're struggling to do that, we're sort of working to do that, and of course we'll need your help. All right. Can you describe your level of partnership with other protocols, maybe some strategic planning, maybe other companies that you're looking to collaborate with? Well, I mean, of course, and we shared that yesterday in a panel that we were with Evan and Anthony from Privado ID. Something like three to four years ago, there was basically nobody speaking about identity but Privado and Disco XYZ by that time. And our vision is there are 8 billion people in the world. There's so, so, so much space that we should work together. Okay. There's a question that we'd like to ask. Sure. The answer there is, where are the credentials stored? On-chain or off-chain? If off-chain, if on-chain, how do you handle? Privacy risk. No, not on-chain. Not on-chain. Never, never, ever, never, ever, ever you can put personal information on chain. The technology behind the standards of digital identifiers and verified credentials work this way. What you have anchored on chain is a digital identifier. That's the only thing which is anchored on chain. Credentials are minted and stored off chain. So just to give an example, you have the DID of the City of Buenos Aires or any other government or institution, and you have your own DID. So when you want to mint a new credential, and those are anchored in our case in CK Sinqueira, and when you need to mint a new credential, you ask the issuer to give you that credential. That happens on a peer-to-peer basis using a protocol which is named Ditcom. And what you are doing is you're signing a JSON digitally signed by this DID in favor of this DID. And that is stored in the personal device that the users have in their hand. So when you need to verify that credential, what you do is you check that the credential is valid, that is not new, that is not void and that it was signed by the issuer in favor of the holder. So you rely on on-chain security but the data is store-of-chain. How does QuarkID plan to maintain its technological advantage in the long term? Well, basically, as any other open source protocol, expanding our user base generated interest. The amazing thing is that when you do this again reverse adoption lifecycle and you start to have millions and millions and millions of users, developers start to build on top of it and we have several startups and several companies building on top of the protocol and even expanding it. Just to give an idea, when we were involved in the, this is a very small thing but it's quite nice when we did the the left pop-up city in august the the passport for entering lf was a credential minted in qwerkyd and one amazing guy his name tule he's not, I guess, did this extension of the protocol, connecting it with an Arduino device in order to open a door. So when you access the hub, you scan that, show your credential, and the door got open, which was so nice. And that is, I mean, the community building and developing. Can we squeeze in a question about competition? How is this project different from ProvidoID or PolygonID? I don't know in such a detail the stack of ProvidoID and how they are working now with this Coxyz because they recently merged. But again, we of course believe in competition and we respect each other very much. And as I said before, I don't think... You need to have the technological basics that you need to implement. But this thing is not about technology. This thing uses technology to gain adoption. So what's our focus? Adoption, adoption, adoption. And perhaps on the final question on adoption, since we have a few more minutes remaining as well. Can Argentina's adoption by both its government and citizens serve as a model for other Latin American countries? I wouldn't say serve as a model, but when we're dealing with such border innovations, and the other day I was thinking, isn't there a more obvious case where innovation is needed than identity? We are sending or trying to send rockets to Mars. Elon Musk is catching rockets falling out of space in mid-air. We're discussing artificial general intelligence models, if they're going to rule or not the world. And when we need to identify ourselves, we pick a piece of plastic and start doing like this on camera. And my God, that's so stupid, so stupid. We need to change that. Now, of course, it's identity. Institutions can feel fear. And finding some governments and big institutions as Banco Santander and MACRO that were able of taking the first steps, of course, makes every other one in the place, hey, come on, take a look at those guys. They did it. Why don't we? Alrighty. So that concludes our session. Can you do a quick wrap-up about what you do? Come on, take a look at those guys. They did it. I don't win. All righty. So that concludes our session. Can you do a quick wrap-up about what you do, a key takeaway, maybe a high-level description, and for the audience before we conclude the session? Yeah, of course. I mean, for me, the most important part is if we are going to achieve what we think is the ethos and we feel the ethos of this community, of having decentralized non-permission trust and value being exchanged over the Ethereum network, identity is the way to go. Governments and institutions are the adoption path for going from 600 million to 7, 5, 6, whatever billion people in the next 3, 4 to 5 years. And QuarkID and my team is trying to achieve that or help to achieve that with all of the other players in the industry. Thank you so, so much. Thank you. Please give a round of applause to Diego. That is QuarkID bringing South America...",
  "eventId": "devcon-7",
  "slot_start": 1731556800000,
  "slot_end": 1731558600000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1nZf4Y4ZKlAYK_rEfdGkjjq6S4WGbMxpwSUXYgi9pq-M",
  "resources_slides": "https://drive.google.com/file/d/1u5k2F3znVW_oBeyBhxBascv83UEbEwQb/view",
  "speakers": [
    "diego-fernandez"
  ]
}