{
  "id": "quarkid-bringing-south-america-on-chain-with-ssi-and-account-abstraction",
  "sourceId": "QXCTMB",
  "title": "QuarkID: Bringing South America on-chain with SSI and account Abstraction",
  "description": "QuarkID is a Self-Sovereign Identity protocol bringing millions of South American citizens on-chain. Citizens in Buenos Aires, Argentina, Monterrey, and Nuevo Leon, Mexico, are using government SSI deployed on ZKsync Era through the QuarkID protocol. Driver's licenses, birth certificates, and over 50 different credentials are secured by Ethereum technology in the world’s first case of governments using Ethereum’s permissionless blockchain to meet their identity needs.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "2FA",
    "Account Abstraction",
    "Identity",
    "Open Source Software",
    "Political systems",
    "Politics",
    "Public good",
    "Use Cases",
    "Validiums",
    "Zero-Knowledge",
    "ZK-EVMs",
    "ZKP"
  ],
  "keywords": [
    "Sovereign"
  ],
  "duration": 503,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736bca59dbb7a90e1384f32",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736bca59dbb7a90e1384f32.vtt",
  "transcript_text": " Leonardo Silva Reviewer Reviewer Hello everyone. Thank you so much for being here. I only have five minutes, so I'm going to speak super fast. I'm actually not going to try to make the most of these five minutes. So I'm going to talk about Argentina's opportunity and the case for a special economic zone. So let's divide this by topics, which is what is this economic and technological opportunity? How Argentina is related to it, special economic zones and where we're at. And I think that all of us here, we can agree on something, which is that technology is one of the strongest drivers for human progress. Therefore, so are tech companies. But do tech companies thrive everywhere? Technology can be created anywhere, but for tech companies or start-ups to be able to develop, they tend to go to the places with the best conditions. Therefore, blue zones. Why would they stay in a place where they pay maybe too much taxes or that the government is not stable enough, right? So there's going to be this tendency for big, important companies to go.",
  "eventId": "devcon-7",
  "slot_start": 1731556800000,
  "slot_end": 1731558600000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1nZf4Y4ZKlAYK_rEfdGkjjq6S4WGbMxpwSUXYgi9pq-M",
  "resources_slides": null,
  "speakers": [
    "diego-fernandez"
  ]
}