{
  "id": "running-ethereum-node-in-africa",
  "sourceId": "XT8ZWL",
  "title": "Running Ethereum Node In Africa",
  "description": "Running an Ethereum node in Africa presents both challenges and opportunities. It enables participation in the global blockchain ecosystem while contributing to network security and decentralization. Key points to highlight include overcoming infrastructure limitations, leveraging community support, the potential for economic empowerment through staking, and fostering local innovation and adoption. Emphasize the importance of education, collaboration, and strategic partnerships to",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Stakers/Validators",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Home staking",
    "Distributed validator technology",
    "Decentralization",
    "diversity",
    "geographical",
    "Decentralization",
    "Distributed validator technology",
    "Home staking"
  ],
  "keywords": [
    "Geographical",
    "Diversity"
  ],
  "duration": 611,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735c1c39dbb7a90e1f43d28",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735c1c39dbb7a90e1f43d28.vtt",
  "transcript_text": " Hi. Okay. Okay, I want to start by asking a question. How many of us want to be here in the next, let's say, 10 years, 20 years, to see that Ethereum has gotten to the great potential it should be? How many of us? Okay, good. Awesome. So I think we are all in one spirit. I'm David. I'm David Uzotuku from Nigeria and I'm here to really spoil our hearts to see how we all come together to make Ethereum truly decentralized, right? And I'll be talking on from my own perspective as a participant and as a user and someone who who believes in the future of the ATM network what I'm trying to do and how I'm doing it so I live in Africa in Nigeria Africa and Africa has some few unique challenges and it has a lot of potentials. So today I'll be talking about running nodes in Africa and other few things. So why geographic decentralization is vital for Ethereum? If Ethereum has to be truly decentralized, It means we need to have these nodes, the information infrastructure points, distributed. And it has to be distributed from a geographical perspective. So currently right now in the world, we have like seven continents. And Africa is one of it. And just to also add, I believe in one day that some of us, one day, possible me or you, might go to Antarctica to actually run a node. Right now, in Africa, we have less than 1% of node operators in Africa. But in other parts of the world, we have more than 30% in other side part of the world. And that's not true decentralization. True decentralization is where we have a good balance to these infrastructures running together. The interesting thing about Ethereum vision is it has a vision of security, trust, resilience, but all of this can happen if we don't have true decentralization. Because one, if we have an imbalance, right, it means the majority will actually have high rules or policies, which might not favor the rest. So we all have to be like, it has to really be decentralized for us to really have this vision come to pass. Geographical diversity is also one thing, one of the vision or core vision of the Ethereum network itself. Seeing Ethereum really, really being decentralized is what the network needs. So, this is just a map showing us the nodes we have in globally. Just like I said, we have less than 1% of nodes in Africa and also Latin America. So these two continents kind of have similar unique challenges. So I'll be talking on some of these challenges also. One question also I want to or another thing I will be talking about is why should we also think about or supporting Africa in trying to run nodes, right? Because of the potentials. At the moment in Africa, we have approximately about 1.7 billion people, right? And majority of this, a good number of this number is they are all youth, right? And one thing I love saying is in Africa, we have a lot of challenges, right? Where there is challenges, that's where you talk about finding solutions to solve these challenges. And one great solution right now, it's the Ethereum network, it's the Ethereum blockchain. We solve challenges we face in Africa so that tells that there's a great potential in Africa and that's why also we want to see more nodes running in Africa. Building a decentralized future, our work at NodeBridge. In trying to solve this issue of true decentralization, from my own standpoint, I came up with a community called NodeBridge. The idea right now is just to see how we kind of have more home node operators, right, support people's minds to also be participants of this network in a way to really make this Ethereum truly decentralized, right? Some huge challenges we have in Africa is education, lack of internet infrastructures, lack of power infrastructures, economical issue, right? So, and, you know, in my own small way, right, one of the things we try to do at NodeBridge is to also break this barrier, right? And we find a way to also break this barrier by, for instance, doing workshops. I've been doing a lot of workshops in a few African countries, also educating them, finding better ways to actually tell them that, yes, we all have to be part of this network, making this network resilient again. And then also, power. So because we have to find a way to also, like, use a very small system, so it's sustainable and it's actually also solved the problem. So this is just like a Raspberry Pi running on an arm, which also solves that problem. So I also, like, custom build all of these things to solve the problem for an African person who is not able to actually buy this infrastructure. Who is not able to buy this infrastructure. Because setting up this infrastructure is quite expensive. Yeah, this is some of the workshops also we kind of get to do. Yeah, this is also some of the setups. We've seen more Africans running these nodes, right? So they kind of have different setups. So actually at the moment, we also kind of use styling. We use power solar systems to generate power for sustainability. And also with the custom nodes we put together. Also, yeah, this is like the whole power system, the styling, some of the node operators we have at the moment are actually using. Also, education. So why security depends on global node operators and solo stickers, right? So, just like I said, we all have to come together, right, to really see, to push Ethereum to be truly decentralized. And then, the point here is, Africa is trying to solve its own problem. But because we're trying to solve a global problem, which is trying to solve its own problem. But because we're trying to solve a global problem which is trying to solve decentralization, we all have to be like, all of us have to all come together, like helping each other. For instance, there are different system right now, like the DVT system. Okay, so like the DVT system, which actually you could also delegate to permissionless system, you could actually have like a cluster to delegate also your stakes to a particular node that is sitting in underrepresented location, right? So we all have to come together to actually do these things together because it depends on us all, not just one geographical point, but it all depends on everybody who loves this network and who is ready actually to see this network in the next 50 years to come. Yeah, how you could also support, like, there are different ways also you could also put this support, just like I said. Supporting node operators from your own point of view, let's say it might be you delegating your nodes, it might be you delegating your stakes, it might be you setting up some resources, which is for education and its likes. So I also just want to quickly ask, what does true decentralization mean to you? And we can think about it in the next session. I'm sorry, David, but the time is up and we have a really tight schedule. If you want to talk to David, I think the work he's doing is absolutely amazing. Definitely connect with him.",
  "eventId": "devcon-7",
  "slot_start": 1731575400000,
  "slot_end": 1731576000000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1buMXIg1gOhRzKk22wUllHQbcl9xVPk1mQ7_JHDKF_oQ",
  "resources_slides": null,
  "speakers": [
    "david-uzochukwu"
  ]
}