{
  "id": "satellite-based-cryptographic-layer-extra-terrestial-extension-to-ethereum",
  "sourceId": "SZBQLK",
  "title": "Satellite based Cryptographic Layer - Extra-terrestial Extension to Ethereum",
  "description": "Using nano-satellites with edge compute units we will show how we intend to build an orbital compute layer with unique properties. We will propose a novel cryptographic applications layer built with vision to space explorations.\r\n\r\nTypically public blockchains enable cryptographic primitives for the digital commons on earth, we will share novel implementation of cryptographic applications that will extend the digital commons into Low Earth Orbit (LEO) and import cryptographic resources from LEO.",
  "track": "Cypherpunk & Privacy",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Network State",
    "Use cases of cryptography",
    "DePIN",
    "space",
    "frontier",
    "DePIN",
    "Network State",
    "Use cases of cryptography"
  ],
  "keywords": [
    "space",
    "frontier"
  ],
  "duration": 593,
  "language": "en",
  "sources_swarmHash": "7f0a508bddf0c6ec3d9a6daf5707ab211837a4da389a507c6bc1e223da4741bd",
  "sources_youtubeId": "AJq7z4eLYm0",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736dec174749a4b89942272",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736dec174749a4b89942272.vtt",
  "transcript_text": " Leonardo Silva Reviewer:\" Elisabeth Buffard Hello, Earthlings. So, Ethereum is great. We want to take it to more planets than only Earth. And when we think about space frontier, often nerds think about the space frontier as some sci-fi or alien technologies. Or for some other people, it's just an empty void, which is slightly less inspiring. The reality is that if anything of value is going to come out of it, we need to get nuanced and work with the complexities. So what we have seen is that in the last two years alone, more satellites have been launched into orbit than in the previous five decades combined. So finally, after decades of stagnation, we're entering a space acceleration era. And this is the time where democratization of the space industry is happening and plenty of startups with wild ideas are finally taking a stab at implementing their stuff. With SpaceCoin, what we're building is orbital route of trust. It's literally out- this world secure hardware, out of reach of physical attacks. It's space-based trusted execution environment, or we call it Space TE. And this serves as infrastructure for Celestial Compute Marketplace, payment layer for satellite services, and from Earth, we'll be able to access it via RPC nodes for EVM and other networks. This is a real photo from a launch not long ago. What we've built with the Space T is infrastructure with our aerospace partner, CryptoSat. We basically designed, built, and launched satellites into orbit since 2021. Last year we contributed to the EIP-4844 with the trusted setup ceremony, the KZG, aboard the satellites. And the latest satellites are equipped with the Iridium connection, which is reachable from any place in the planet. And now we're preparing a set of nodes that will be equipped with more iridium antennas, C-edge nodes. And essentially this is immune to any kind of attacks there. The architecture is Yang Wang's session. Okay, thank you for mic. Thanks, Laj. So this is actually what you see is like the network architecture which actually is like network resilient. So we are using the Iridium satellites, which have like the 66 pieces distributed across the planet with the nine in the backup. So there's like the first line of our communication path we are using. Then we are using the Aptos Orbital, which is like the, provides us the computation infrastructure currently. And thanks to this, actually, we are building the space coin on the top. So what actually we can build on thanks to this is actually like the protocol with specific hardware capabilities. And it will be like resistant to any kind of the DDoS attacks and the censorship and in the future we believe there will be like much more a lot of communication the paths we can use and the computational capacity we can get. So this is basically like a brief diagram where actually the satellites are reachable any single moment so you can see like in any kind of the intervals some satellites are actually reachable where actually the ground stations are the proposing and then actually the electing and the voting back and the broadcasting back on the ground stations. So what we are using this, because there's a lot of constraints in the environment, is actually we used the modified HotStuff1 with the instant finality. And thanks to this, we actually, we've retrofitted for our lower bandwidth with the least amount of the messages needed between the satellites. So and actually opens us the requirement like we just need for the connectivity only one node designed as the leader. So this is briefly like the diagram. So how actually it will be like working in the future and what we are looking forward to implement currently. So we have like the pre-finality on the L2 with the pre-finality with L2 as with the L1 backup whereas the state is posted on the L1 which is actually good for the low value transactions and for full finality we'll be using the L1 where actually it's good for the high value transaction and actually the state will be fully committed to the L1 on the satellites. So for the security services thanks to this we can like offer like the space T the copcessors, which enable FHG cases. For that, actually, we are looking forward to offer the Secure Custodian for the various key management systems and schemes. Then actually, we are looking for the Cosmic Entropy and the VRF. And thanks to this, actually, we can offer some kind of the security deletion because the hardware is inaccessible for the inspection and the eternal bulletin board. So what we're actually looking forward up there is that we'll be implementing the support the EVM compatibility and we'll be looking forward to the initial deployment focusing on the bridge contracts and for future extensibility through the WASM risk and the VM based stuff. So we are looking like for the L1, L2 foundations, MPC wallets, and the validators, and especially entropy providers as well. So thank you for the attention. Please give us the follow on the Twitter, and I think now it's time for the questions. Thank you. It is, it is. Man. Peace among worlds. So, we have any questions? Remember to stand up your hand and I will toss this to you. Yeah, we can have any kind of questions. We can also have some physics. Oh. We'll be delivered to you. Don't worry, it doesn't break. So, this is fascinating to see, so hats off for building it. What happens, is it harder to patch because it's in satellites? Like on Earth, I guess you could upgrade the hardware or switch over to a different operating system. If there's a vulnerability in the OS that's running on your satellite, I imagine that's a lot harder to go and fix. So how did those challenges come in? And the second one was, what happens if one of the satellites fails? And can you still maintain connection between your L1 nodes? So there's redundancy, right? You have actually on each of the units, you have two Linux, like hardened Linux machines, and then eventually both you have the redundancy in case one satellite goes off. But with regard to patching, ignoring for a moment the hardware-related stuff, which is a longer conversation, but for software, we're actually looking at potentially implementing some kind of committee sign-off. So, essentially, you have it both peer-vetted and also it's not just like a centralized entity that patches and pushes potentially man-in-the-middle unnecessary things. If I understand correctly from your slides, you use Iridium's satellite? Correct. Okay. I understand SpaceX has a lot of low orbital satellite. Why do you choose Iridium over SpaceX? Okay. Yeah. So for currently, the Iridium is like this. It's most oldest, but it's actually most real you can get right now It's also Expensive, but it's actually thanks to it where is actually the constellation is actually quite have a long Sustainability of the networks, but yes the Starling and other providers. They're actually coming in the path So we believe there is actually in the market of the optical terminals And but we are just wait the satellites being up and ready. So now Starlink will offer for the satellite providers, but it takes time to implement in orbit. So once we have more viable and, of course, cheaper options, we will switch to that or so. And I like the redundancy. Thank you. Any more questions? Last question. Thanks for the presentation. What are some first use cases you envisage and what are some really moonshot or literally moonshot use cases that you can see potentially or what could be the coolest use cases you can foresee? It's a bit of a long story, but I reckon just some of the use cases, cosmic randomness for VRF, secure deletion, MPC application with co-signing, secure co-processing, these are the things that are applicable already today. What's maybe moonshot and very interesting is, as we showed, there's so many launches now. There's an entire new space-native economy. So we foresee a scenario where there's going an entire new space of like space native economy right so we foresee a scenario where there's going to be ai agents in space making decisions without having to download um data to earth so eventually like there's a lot of security that is required for for this to happen like we've seen with planet labs how it influenced uh security Earth. And with more assets in space, it's becoming much more sensitive. So we foresee it as the backbone for expansion of Ethereum into more planets eventually, or at least outside of pure bounds of Earth. I would like to say the Moon cases is like the payment network between the satellites. So that's how we see it. All right. Please give a big applause to these guys. That's a wonderful presentation.",
  "eventId": "devcon-7",
  "slot_start": 1731648000000,
  "slot_end": 1731648600000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1Net_UwG69ncJlQvHg5qG_nefAW16HDrDDKf-9OaDpsw",
  "resources_slides": null,
  "speakers": [
    "daniel-bar",
    "matej-yangwao"
  ]
}