{
  "id": "scaling-clean-air-now-and-the-future",
  "sourceId": "RKA9MF",
  "title": "Scaling Clean Air: Now and the Future",
  "description": "A one-day summit focusing on the theme of d/acc: emphasizing the values of decentralization, democracy, differential accelerated progress, and defensive tech including crypto security, public epistemics, bio defense,  neurotech/longevity, decentralized ai and physical resilience.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 758,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735b4a09dbb7a90e12f4f30",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735b4a09dbb7a90e12f4f30.vtt",
  "transcript_text": " I have some money to do stuff around air quality, indoor air quality, especially I'm an engineer by trade, so I write software. I wrote the software on the toy that you saw in the booth out there. And I got tagged in to give this presentation, so you're going to have to bear with me on that front. So here's a question. And we're going to do price is right rules. So closest without going over. You eat about 1.8 kilograms of food a day. You drink about 2 kilograms of water a day does anybody know how much air you consume a day hands somebody give me a hand yes 11 000 liters i want it by mass i heard 10 kilograms. Who was that? Yeah, all right. Toss them one. Yeah, let's say 12 kilograms a day. That's a lot of air, and there's stuff in that air. Stuff in the air. Bad air is a bad time. So this is from a study about decision-making versus carbon dioxide content. So if you ever see, you know, you know about hypoxia's effect on the brain, long before you ever get to anything like passing out, you start making really bad decisions. So if you wouldn't sign on a house drunk, you probably shouldn't sign on a house above a couple thousand ppm of CO2 or you will make terrible choices. The inverse effect is also true. Bad air is a bad time also because it leads to airborne infectious disease. We all know about COVID, but there's plenty of other stuff, tuberculosis, chickenpox, measles, all that stuff. Some of it, there's great vaccines against some of it. Nobody really knows. And you really don't want to catch it even if you have a not particularly symptomatic case. There's a really interesting talk about that you can stick around for. Also, the economics of it are incredible. Trying to do clean air-based interventions is an excellent way to reduce things like sorry, heart attacks. Children's test scores, air purifiers in classrooms are one of the most economically effective way to boost test scores compared to anything like teacher training, other interventions. You can find direct links between indoor air quality in education spaces, absenteeism, and eventual health and economic outcomes for the people in those spaces. So at Entropic Engineering and Open Aeros, we think this is pretty cheap and easy to fix. You can have some really high-impact effects. Masks, especially with fit testing. This is another place where we received some funding from Balvi to work on open-source condensation particle counters that can make it really easy to do this kind of work. Portable air cleaners. You can see one in this picture of our office. Windows. These ones don't open, but if you're in a place where it's thermodynamically acceptable, you can open your windows. That's an excellent way to do some mitigation of this kind of stuff. Simple HVAC upgrades like dropping in better filters, making sure you actually change your filters. And we also do some work with skin and eye safe 222 nanometer UV light like this one here. There's also one on the display table outside on the front. Unlike earlier 254 nanometer technologies, this is stuff that's relatively easy to deploy because the threshold for skin and eye damage is much, much higher. It's something that you can retrofit into existing spaces a lot more easily. It's an excellent drop-in mitigation. Here's the real question. If this stuff is so cheap and easy, you know, we've got filters in this room, we've got UV lights outside, why isn't it already fixed? Well, we think one of the big reasons that it's not already fixed is it's invisible. Literally. When we're talking about particulate in the air, we're talking about particles that are so small that measuring them requires innovative technologies to make them grow physically large enough in the device that we work with via condensation to make them countable because they're so small they don't meaningfully reflect enough light to count them even under laboratory conditions, let alone with your eyes. Like, think about when you see smog outside. Well, that is the aggregate effect of looking through a bunch of particles in the air. When you're inside, you just can't see it. And you can't tell what kind of particles they are, how big they are, and you also can't tell what CO2 concentrations are like. So you can't tell the extent to which your judgment is impaired and you're going to expect poor health outcomes like that. So what I'm here to talk about is U-crit air, also known as the clean air Tamagotchi, is something we've been working on for the last five or six weeks. This is a portable air quality device that includes a virtual pet. So the idea is in low power mode, there's an e-ink screen on top, which will wake and update periodically. You've seen them on the Kindle, so that supports really low power operation. We hope to get at least a week or two out of it. The hardware we have outside is pre-production hardware. But we are eventually hoping to sell these things. So take that with a grain of salt when you play with them. But they are fun to play with because on the bottom screen, when you wake it up into higher power mode, you have a virtual pet character. And the whole pitch of this is that when you think about air quality, especially indoor air quality, it's something that's really easy to ignore. Like you can sit there at work and think to yourself, I have kind of a headache whenever I sit in this conference room, but I got some dials to pay attention to. And that builds up every time you're exposed to higher CO2 levels, every time you're exposed to high particulate concentration. The chronic health effects of all of these are cumulative, which means that you can ignore it and ignore it and ignore it until 30 years down the road. It turns out that you've had sequelae from multiple low intensity viral infections, or you have developed chronic lung problems from exposure to particulate matter. So the concept that we have here is a sort of gamification approach where you and the virtual pet are exposed to the same air by virtue of it being with you. It has onboard sensors that can measure carbon dioxide concentration and particulate concentration and a couple other fun things. Except the virtual pet reacts in real time much faster than you do. So what we're doing is sort of hacking your judgment to say, well, you know, you know intellectually that there's going to be long-term negative effects to bad air quality that you're exposed to. But if we make those long-term negative effects happen on a very short term to this little guy, especially if he's cute, it's sort of a way to hack that decision making process. So you can play with him, you can arrange furniture, you can buy for him various clean air interventions like those that we have here, you can buy him a HEPA filter, you can buy him UV lights, you can have him wear a mask, all of that fun stuff that we think are sort of straightforward, relatively easy and effective interventions. You can also apply to your character. And the idea is let's take this thing that on the human time scale and on the human health time scale is essentially invisible, make it very visible, especially in a relatively fun way, make it make a lot more sense to pay attention to that. So that's the concept. I'm not going to try and do it during the talk because I was very politely informed that they're going to drag me off stage with a shepherd's crook if I go over. You can catch me after the end of this track out front and we'll probably do a little bit of trivia and give away the units that we have that are pre-production. You can find more information about them at ucritter.com slash error or there's that information outside? Yeah. So those are all pre-production. You can tell. 3D printed case. We assembled them in-house. So they're a little bit of a precious commodity but we're going to give them away. Fun little bit of a crash project. Blew the in-seat power circuit breaker on the plane which apparently they can restore. Got to do some laptop power management limiting to get back on the road building these things. But some other cool tricks that they have up their sleeve compared to other commercial air quality sensors is they do barometric compensation for CO2. So if you live anywhere other than sort of median height in terms of elevation, or if you're on a plane or you're climbing a mountain, your air quality sensor that you already have is almost certainly lying to you if it's not barometrically compensated. So this is a fun little trick that we do. This is me flying from the last leg from Korea to here, where you can see that without barometric compensation, you're underestimating carbon dioxide concentration in the cabin by a couple hundred ppm so we think that's a fun little bit of special sauce that went into this project they also have a barometric pressure sensor on board so if you want to climb a mountain you can track your altitude as you go and the other trick that we think is really cool and should become something that people expect in mitigated spaces is on the topic of uh these airborne you know these air quality problems being invisible if you if you buy something like these hepa filters how do you even tell if they work well one way you can do it is you can keep track of the carbon dioxide or particulate concentration in the room for hepa, you're looking at particulate, but for ventilation to outside air, like you're going to open the window, you want to look at carbon dioxide. And you can do something. You can affect an intervention like open a window, or you can affect an intervention like turn on a HEPA filter, and you can watch the rate at which these airborne contaminants drop. And with a little bit of math that is baked into the Eucritters, you can calculate, you know, what the CO2 concentration change or what the particulate concentration change tells you about the mitigation choices you've made in your space, usually measured in air changes per hour, which is sort of one air change per hour means volumetrically all the air in the room would be cycled through once an hour. That's great for measuring CO2. So if you're going to affect some mitigation like turn on your HVAC, you can watch the change in CO2. You can see a drop. And if you have a U-critter with you, it's logging. So you can compute the effectiveness of that intervention. And if you're going to switch on HEPA filters, you can take your U-critter and look at the recorded particulate concentration information and compute what's called an effective air changes per hour number. So I think that's the last cool trick for the U-critter right now. Oh, it also works as a Bluetooth sensor. You can talk to it over Bluetooth and pull out current air quality readings. But it has Wi-Fi hardware, and we're excited in the future. We're hoping to ship some updates that will let us do privacy-preserving aggregation of air quality statistics, sort of like existing air quality sensor networks, but that extend to places that might not otherwise be reached, like the places you go in your daily commute that fixed sensors aren't appropriate for. This is open source work. We're still in pre-production, so you can't ‑‑ I don't think the schematics are up there yet, but if you pester them in the Discord, maybe you'll get them to post them. So if you have feedback, we'd love to hear it. The website is out there. It's also in the firmware if you get one. Please reach out if you'd like to collaborate. I'd also like to say thanks to Balvi, thanks to the Ethereum world. I'm not a crypto person personally, but the work that we've been up to at Entropic working on the Clean Air Tamagotchi but also at OpenAeros and the other efforts wouldn't have been possible without you guys. So it's something we really appreciate. I think I'm going to wrap it there. Thank you so much, Lewis.",
  "eventId": "devcon-7",
  "slot_start": 1731570600000,
  "slot_end": 1731571500000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1ZJZJ_2zvDgnrKFG8JEZo8VMp_Z1mb0btmMRtR2j0Vv0",
  "resources_slides": null,
  "speakers": [
    "louis-goessling"
  ]
}