{
  "id": "scaling-community-lessons-from-building-base",
  "sourceId": "P73W8S",
  "title": "Scaling Community: Lessons from Building Base",
  "description": "Drawing from experiences as a Base core contributor and Base community lead, this talk is about building scalable Ethereum communities. Learn strategies for engagement, growth, best practices, and key insights.",
  "track": "Developer Experience",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Security",
    "community",
    "Layer 1",
    "Layer 2s",
    "Values"
  ],
  "keywords": [
    "Community",
    "Discord",
    "Farcaster",
    "Building Community",
    "Community Management",
    "Community Security"
  ],
  "duration": 574,
  "language": "en",
  "sources_swarmHash": "4e8c46194a8800b5909aeb01cc6c0324728e82519f7c0ad031cb1149411d564e",
  "sources_youtubeId": "7T9YaSIAk2s",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67331c173a168eb535311ae1.vtt",
  "transcript_text": " Tanya Cushman Reviewer Reviewer Hey everybody. Can everybody hear me okay? Pretty good? Alright. Thank you so much for coming here and being here today. So, hello friends. My name is Will Binz. I also go by W Binns. They're smashing my name together. I lead communities at Base. I'm also a full stack developer at Base. We're one and a half year old, layer two on top of Ethereum. Our objective is to build a global open economy that spreads equality, opportunity, and freedom around the world. We just processed our one billionth transaction this past week. It's still day one. And across Discord, Farcaster, GitHub, and X. There's millions of people that are part of our communities. I said hello friends, but we don't know each other. We're different genders, different skin colors. We come from different countries. There's all kinds of things that make us different here, that fracture us, that drive us apart, that lead to a lot of the conflict that we see in this world right now. But we're here. We're here together. All of us here left something behind that really wasn't working so well in some way. To look towards something better for us, for our friends, for our families, for our loved ones. And that, I think, is something that all of us can build a friendship on. And I think that's, in the context of this lightning talk, high level, our future is the most important part, focusing on that in building a scalable community. An open economy that anybody can be part of. Being able to work from wherever you want. Being able to live where you want, equality, all those things I talked about, all those things that make us different, all those things that don't matter, transparency, verifiability on chain, not having to take each other's word for things, freedom, and hopefully, in what we see these days in the future, more peace in the world. But how do we do that? We have to make space for everyone. Builders, creators, lurkers, people that are just curious, speculators, gamers, even scammers and spammers. There should be direct paths for all of these people. And in order to do that, we have to create opportunities for everyone. I just said scammers and spammers. And I think one of the most important parts of creating opportunity for scammers and spammers is being empathetic. There's people that are born just by the lottery of life in some part of the world where they can't even leave their town. They wish that they could get on a plane to come somewhere like this, to sit next to us today, but they can't do that. The opportunities in front of them led them to that path. It's up to us as community builders to build something better, to help people discover new apps, new opportunities, new jobs, learn, educate them. For some people, it's just to make friends, new friends, in a real world where they don't have any. And in all that, all of us, a better life. In order to do that, we have to focus on the fact that these problems in the world, these problems that we have with each other, across this EVM even, these things that make us different, these sub-communities that split us apart, that we see disagreements in, those problems are what unite us. They're not what should drive us apart. This EVM, Ethereum, is what connects us together. And so you as builders, building community, people, building apps across the EVM, across on-chain, an app is just something people download, but a community is something that you come back for. So what do we do? We have to realize and admit our mistakes when we have them. We have to realize we're not kings and queens. We're not royalty. Being in this space is a gift from the universe. But it's also a challenge. What am I? What are we? What are you going to do with this gift to be here today? To be able to fly here to Thailand. To be part of this community when others can't leave their own. To build something better. And there's a quote that's often cliche, but it's so true. Alone, we go fast, but together, we can go far. And so in that vein, I set up just a Telegram group. So anybody here, there's no difference in networks. We're all part of this Ethereum community. If you'd like to be part of this telegram, I'm an open book. People in our base community are open books. We're trying to build a better world together. Let's share our knowledge. Let's build a brain test. People watching this recording later, come to this group. Let's work together. Let's go through the things that we can't talk about in a lightning talk. How do we build safe, secure communities? How do we scale communities? How do we make sure that everybody has their space? So thank you all for sharing your time to be here today. Thank you so much, Will. Thank so much Will. Any questions? Please raise your hand I will throw this cube to you. Oh there's one there? Please help me. It's not a question, but a word of gratitude. Thank you for your talk. Thank you for your time. We highly need this kind of speech in the space like that. I just went out from a very different conversation. Respect. Thank you. Yeah. Thank you. Thank you. I see another question over there. Hi, Will. I saw you in person. How do you see communities like base Latin, base India, base Africa impact those communities? I think that thinking about like how all communities start, they start small. And in time, they grow. Some succeed, some fail, but if we think of things like on a cellular level, how human life imitates itself in the form of how we build communities, the ones that continue to get bigger and bigger and bigger, they divide and become their own communities. Taking Costa Rica as an example here, there's many builders in Costa Rica as an example here. There's many builders in Costa Rica, but in that, there's also many people with differences. There's people that want to build on chain, that just want to play games, they just want to trade, they just want to work on infra. And a lot of those people, they don't want to have anything to do with each other. That doesn't mean they don't like each other, they're just not interested. So for us as community builders, it's important that within the first 10, 15 seconds when they come into our community, we're helping them get to the right place. And so in the context of this question for based LATAM, which we're referring to here, which is based communities in Latin America, it's continuing to build more and more smaller and smaller and smaller communities until eventually we reach the grassroots. So that's my answer to the question.",
  "eventId": "devcon-7",
  "slot_start": 1731401400000,
  "slot_end": 1731402000000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1Z6KNA8npIjlvXcTWwPrFhWHFQ9A2gd2wkiaNRb-bwuQ",
  "resources_slides": null,
  "speakers": [
    "wbnns"
  ]
}