{
  "id": "secondhand-liberalism-a-story-of-microdosing-internet-freedom",
  "sourceId": "TB8DG7",
  "title": "Secondhand Liberalism: A Story of Microdosing Internet Freedom",
  "description": "Liberalism isn't the default. For those growing up in non-Western societies, liberalism is often \"secondhand\"—it's imbued in Western cultural products and present in software and the internet which in turn service liberal ideals. What if it's no longer the case?",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 543,
  "language": "en",
  "sources_swarmHash": "f8394bbfe10b82dd021769ebea02f6110bf67078d9fd2f93fefe403b06ac7639",
  "sources_youtubeId": "QWr8sgwt21Y",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673700f51b0f83434db18b94",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673700f51b0f83434db18b94.vtt",
  "transcript_text": " All right hello everyone how's everyone going how's everyone doing good Good? Okay. Let's cheer up. Okay, today I'm going to talk about a title called Secondhand Liberalism, a story of microdosing internet freedom. It has little things to do with Ethereum, but has a lot of things to do with Ethereum at the same time. And this lighting talk also is going to contribute to a larger panel at 2 p.m. in the same room called From Western Liberalism to World Liberalism. Okay. So when I hear the word liberalism, it really hits differently when I speak in my native language in Chinese. Liberalism translate as . The literal meaning is freedom principles or freedom doctrines. This translation actually encapsulates a very brief but remarkable period of China's internet history which I was fortunate enough to live through. To notice, the story in the next five minutes I'm going to tell you is a very simplified version of the history of Chinese internet. To acknowledge the nuance and the complexity due to the restriction of time, I'm going to tell a very, very nutshell version of it. So I want to take you back to the early 2000s. It is a time when posting a meme like this, Winnie the Pooh, on the Chinese internet was still legal. And it is unthinkable right now, because as soon as you post anything of Winnie the Pooh on Weibo, the Chinese Twitter, the post will very likely to be deleted in a few seconds. So during this period, China experienced what I called second-hand liberalism. What I mean by that is China didn't have democracy or election at the time, and there wasn't this freedom of speech to be free, that breast freedom. If you picture millions of Chinese citizens gathering in those digital town squares, I'm talking about sites and forums like Tianya, Bullog, Weibo, and Renren. They were not just social media sites, but they were intellectual playgrounds. Chinese netizens were diving into discussions about liberal democracy, about human rights, about social justices, and this is non-thinkable today. And growing up in China, I never actually learned about liberal ideologies from my textbooks. But I absorbed liberalism online. It was everywhere. It was tangible in the cyberspace, but it was invisible in practice. The internet at the time buzzed with hate today. We're talking about government corruption. We're talking about labor rights. We're talking about government corruption. We're talking about labor rights. We're talking about environmental issues. We're talking about the forced relocation before Beijing's Olympic. And we're also talking about the controversy regarding the Wenchuan earthquake. Those are all red flags today. When censorship began tightening, the Chinese netizens began posting puzzles and codes. They developed a very sophisticated system of communicating with each other and understanding in this hidden language. It was about building a community with shared hidden meanings. If you're in crypto, you're going to be really familiar with this. Building a community with a shared hidden meanings. If you're in crypto, you're gonna be really familiar with this. Building a community is all about inventing those metaphors, inventing those images and shared memes so you guys can understand each other. And this was Chinese internet in the early 2000s. This brief period, I'm talking about from 2000s and early 2010s, fostered what scholar Yang Guobing called contentious public sphere. It is archipelago of critical discussions about political awakening and about intellectual exploration. These spaces encouraged what researcher Angela Wu called reading dispossession for changing political understanding, and thus creating solidarity very briefly. President Bill Clinton said in 2000, March 8th, saying, China is trying to crack down the internet. That's ridiculous because cracking down the internet is like trying to the wall. It's impossible. And President Clinton said, good luck, Chinese censors. It's impossible to censor the internet. However, guess what? It was President Clinton's naivety of something a scholar might call techno-solutionism. It turns out you can nail a jail to the wall. Right? There is something called the Great Firewall today. And the technology, as someone would imagine, that would inevitably bring China into liberation, proven to be just another infrastructure, could be controlled and can be monitored. This transformation has been very stark. The golden age of the Chinese internet freedom only lasted, I would calculate, for 15 years. Today, the Chinese internet is, as you can tell from the chart in the first picture. And the Great Firewall has been nearly impenetrable. This vibrant intellectual discussion, this vibrant discussion about civil rights and all the issues in the society have largely disappeared behind the layers of surveillance and censorship. And the brief window that I lived through when I was a teenager, when I was a child in China, has permanently closed. The term liberalism, freedom principle, has become pretty much stigmatized in China. If you ask a Chinese citizen on the street, what do you think about , what do you think about liberalism? People will be like, this is Western, evil Western infiltration. This is a Western ideology we do not like. Liberalization is hypocritical and it lost its meaning. So this story is like this, and I want us to think about this story. Not just like a cautionary tale about technology and control, but it really reminds us that liberalism, we're talking about freedom of expression and freedom of choice, is very precious and precarious. So the internet of the technology and underneath are not inherently liberating, as the Chinese internet today is highly constructed and a lot of censorship mechanisms are artificial features. So to those of you who are building technology, the story of the death of the China's free internet is really sad. It really reminds us that technological progression doesn't bring liberation automatically, but but rather technology is a result of ideology based choices made by governments, corporations, organizations and eventually individuals. Thank you very much. Please give a hand to Afra. We are already slightly over time.",
  "eventId": "devcon-7",
  "slot_start": 1731650400000,
  "slot_end": 1731651000000,
  "slot_roomId": "stage-1",
  "resources_presentation": "https://docs.google.com/presentation/d/1l0E0bgrVT-d4Vqx2zZeLBbCopXsf2glznve9weGlx2U",
  "resources_slides": "https://drive.google.com/file/d/1tqYaGOQ-8lCOmEupzwnwcnX7cbCICLwP/view",
  "speakers": [
    "afra-zhao-wang"
  ]
}