{
  "id": "solarpunk-vs-lunarpunk-the-evolution-and-integration-of-these-movements",
  "sourceId": "SFY3FB",
  "title": "Solarpunk vs. Lunarpunk: The Evolution and Integration of these Movements",
  "description": "In this talk, I will explore how the ideals of solarpunk and lunarpunk can be integrated to address privacy, inclusivity, and justice.  We will explain how combining the strengths of both movements we can potentially create a cohesive vision for a sustainable, equitable, and free future.",
  "track": "Cypherpunk & Privacy",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Coordination",
    "Anonymity",
    "Solarpunk",
    "Ethereum for Good",
    "Social",
    "culture",
    "Anonymity",
    "Coordination",
    "Ethereum for Good",
    "Social",
    "Solarpunk"
  ],
  "keywords": [
    "Lunarpunk",
    "Culture"
  ],
  "duration": 567,
  "language": "en",
  "sources_swarmHash": "ec3e42c5c5bdbed8c1e3b858f53d8832afe881cea558c321fb3a1c657e542700",
  "sources_youtubeId": "2SYWYVJonuk",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6734a1589dbb7a90e1486e16",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6734a1589dbb7a90e1486e16.vtt",
  "transcript_text": " Hello everyone. Thanks for coming today. I'm going to talk a little bit about the solar punk versus lunar punk, the evolution and integration of these movements. So before we talk about solar punk and lunar punk, maybe we go a little bit on history. Actually thanks to the NIMH guys, yesterday they did a sick presentation about the punk movement. Thank you for that, shout out to them. So yeah, let's start very quickly here. So the punk movement in the late 60s and the mid-70s actually started as a music movement. Who knew here that actually the punk movement was a music movement? Okay, perfect. There's a lot of people that do know that, which is really good. What happened there is that there were people that were a little bit depressed because, or not depressed, just not happy with the state of the rock scene. The rock scene became a very commercialized thing. So the punks, they were against this commercialization. They were against all this mainstream and this anti-establishment. They were like basically anti-establishment. So they came up together and they started to create their own environments. They started to create their own culture. They started to create their own way of dressing up. They started to create their own ideals and so on. And the main ethos of the punk movement was do it your own ethic. Valuing the self-expression, the personal responsibility, and the direct action. Then, after that, we had in the early 80s, we had the cyberpunk movement. And the cyberpunk movement was, it started first like a sci-fi type of thing. So basically, someone, I don't remember exactly the name, wrote a novel about cyberpunk. And cyberpunk started to be mentioned more and more in literature in the early 80s. These sci-fi stories that were being created were basically anti-authoritarianism and kind of like showing like a resistance against the state or against like any form of coercion. And yeah, another thing that is important to mention about the cyberpunk movement was that this, let's say, movement was created thanks to a lot of literature, a lot of movies like Blade Runner and more and more and more, more, let's say, films and different, let's say, forms of media that was basically showing to the world that we're going to be living in a world where where there's going to be a lot of oppression and that there's going to be a lot of oppression and there's going to be a lot of control by the different organizations. And not necessarily the state, but actually the corporations. Then, in the late 80s, there was also, again, a new sci-fi term that came up, which was steampunk. And the steampunk was kind of weird because it came after the cyberpunk. The steampunk, it came after the cyberpunk. Again the cyberpunk was like this idea, this futuristic dystopian scenario where you know corporations were going to attack the individuals and basically were going to be surveilled and so on. In the steampunk, they were imagining themselves, even though they happened in the 80s, they were imagining themselves that they were in the Victorian era and that they were imagining in the future how, let's say, the steampunk type of culture would look like. The steampunk, for those that are not aware, they usually use a lot of gears, a lot of mechanical things. If you Google quickly steampunk, you probably see that a lot of people have been going to festivals with this type of, let's say, how would I call it, aesthetic. Then the cypherpunk. The cypherpunk came in the early 80s, and basically was with the idea of creating more encryption and creating, let's say, more tools that would allow people to communicate directly to each other, end to end. And yeah, yeah basically the main ethos is privacy, freedom through encryption and digital autonomy. Then came up the solar punk movement and the solar punk movement was in the mid 2010s and the idea of the solar punk movement was basically to have kind of like a more optimistic view of the future and how we can use technology for the betterment of humanity and then uh later on in 2020s uh the lunar punk movement came out which was a movement which is a movement that was basically uh around a lot of mysticism uh when it comes to um privacy and also um the balance between the light and the dark or the shadows or what they call it the dark forest and this movement emphasizes cryptography and privacy tools this is the first video that actually explained a lot about the rise of the lunar punk. I'm not going to show you the video because I don't have time, but afterwards I'm going to share with you the slides so you guys can see. But one of the things that they say in the video is that solar punk hackers are creating transparent infrastructure for funding public goods. And that was kind of like one of the things that they said that is not necessarily good. Also, that the Lunar Pong has been forced to break away from the Solar Pong legacy, which is basically all of this technology with Ethereum that is very transparent and very open for everyone. And, yeah, basically I started tweeting to the people that created this video and say, hey, actually I find that you guys are kind of like being a little bit populist and using a narrative against the solar punks, when in reality, a lot of the solar punks, we do care about privacy. And actually, Rachel, who is the person that is behind the lunar punk movement, she started replying to the tweets and saying, well, the article is merely pointing out authoritarian tendency within the Solarpunk ecosystem. And yeah, basically she was saying that proof of humanity and Gitcoin are not necessarily really aligned with our values. Here there's also a video that talks Solarp Punk versus Lunar Punk with Kevin Iwaki. Also we have it in the slides, you guys can check it afterwards. And yeah, basically what happened afterwards is that when we started having this conversation with Rose, we realized that a lot of the things that the Lunar Punks believe are very similar to the things that the solar punks believe. I myself, I was calling myself a solar punk for a lot of years until this new, let's say, narrative of the lunar punk came out. When this new narrative came out, I stopped calling myself a solar punk because it was not really clear what a solar punk was and so on. And I'm saying all of this to you guys is because it's important to understand that we are creating these movements. We are creating them using language and using, let's say, narratives. So that means that we need to be very aware and very conscious of the language that we use when we're creating these different type of movements. So as I said before, we realize that a lot of the values that the lunar punks said that they have and the values that I consider that I had as a solar punk are actually very similar. But if we extrapolate all of the things that the solar punk or lunar punks are saying, one thing we have in common is that the solar punk, cypher punks, cyber punks, or any of those punks' movement, the only thing that they care about was protecting their community and having a better world for their community and having a better world for their community and for their humanity. So again, if we extrapolate all of the differences between all of these different movements, the main common denominator is that word, care. They care about their communities. So what is the highest form of care? To me, that's love. And that's basically why I'm calling myself a love punk. And that's it for today. If you guys want to learn more about the presentation, there's a lot of videos there, very informative videos. Check out the QR code and connect with me. And yeah, let's chat more about it.",
  "eventId": "devcon-7",
  "slot_start": 1731496800000,
  "slot_end": 1731497400000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1Zg48147sw4ud8uPsdsYKyuXSSdSVDoJZ0LSxumOJZ4o",
  "resources_slides": null,
  "speakers": [
    "manualzuru"
  ]
}