{
  "id": "sybil-proof-mechanisms",
  "sourceId": "7QENZH",
  "title": "Sybil-Proof Mechanisms",
  "description": "I discuss a fundamental impossibility result on proposer selection mechanisms: If different actors can generate different value from block proposal (or sequencing) rights, the only sybil-proof and incentive compatible way of assigning proposal rights is through an (arguably centralizing) auction. In other words, any proposer selection mechanism can at most satisfy two out of three fundamental requirements: incentive compatibility, sybil-resistance and decentralization.",
  "track": "Cryptoeconomics",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "PBS",
    "Mechanism design",
    "Game Theory",
    "MEV",
    "apps",
    "Game Theory",
    "Mechanism design",
    "MEV",
    "PBS"
  ],
  "keywords": [
    "APS"
  ],
  "duration": 534,
  "language": "en",
  "sources_swarmHash": "128d8549b9f6be7505306f18e50a994b8b3afbd30a997bae8bf236e23af9240c",
  "sources_youtubeId": "ifMRDZvV2kU",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673468089dbb7a90e18442a0.vtt",
  "transcript_text": " All right, here we go. I wanted to pitch my favorite theorem of 2024 in mechanism design, very subjective. That's joint work with our brilliant intern and flashbots Minghao and Akaki over there. and I want to also tell you a bit about how it relates to Ethereum roadmap stuff like PBS and so on. So here's a question have you ever wondered can we have a decentralized builder market under any mechanism that we can use to select a proposer or builder And how can we make this question more precise? How can we think about it from first principles? And we wanted to turn it into a mechanism design questions. So we are wondering, okay, could we have an allocation mechanism to select a proposer that proposes blocks? And we operate in a permissionless system, so we worry a lot about symbols, right?",
  "eventId": "devcon-7",
  "slot_start": 1731486600000,
  "slot_end": 1731487200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1zjLtbzOM-9p0FmUus6R7GhQq9rHDQj5paePedPnL_rA",
  "resources_slides": null,
  "speakers": [
    "christoph-schlegel"
  ]
}