{
  "id": "tackling-east-asias-population-decline-issues-with-local-coops-subsystem-for-local-governance",
  "sourceId": "QKMVPC",
  "title": "Tackling East Asia's Population Decline Issues with  Local Coop's Subsystem for Local Governance",
  "description": "Local Coop envisions a world beyond nation-states and capitalism, fostering mutual aid and co-creation. It promotes self-reliant community autonomy and public goods, targeting East Asia's declining population. The system includes digital resident IDs with NFTs, democratizes emissions trading, and manages resources sustainably. Partnerships with local governments facilitate transferring public goods and services to Local Coop, optimized through technology and resident participation.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Local/SEA",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Public good",
    "Local Impact",
    "service",
    "public",
    "Autonomous World",
    "Local Impact",
    "Public good"
  ],
  "keywords": [
    "Population Decline",
    "Local Government",
    "NFT",
    "Public Service"
  ],
  "duration": 558,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735bb619dbb7a90e19e862b",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735bb619dbb7a90e19e862b.vtt",
  "transcript_text": " Thank you. I believe that the most important thing is to implement new ideas and mechanisms into society. If you ask me the way to start the implementation into real society, I will answer in rural area of Japan where the population is rapidly declining. And Japan's population peaked in 2018 and has continued to decline and it is fair to say that Japan is one of the countries in the world with the most declining aging population. And it will become a serious issue not only in Japan, but also in East Asia. Thailand is about to enter a time of population decline. The map of Japan is colored by red by local governments that predict it to likely disappear by 2050, but 40% of the more than 1,700 basic local governments are in danger of disappearing. We have decided to focus our attention on Japan's local community and local government to develop and implement a new community operating system, Local Coop. By taking back the laws previously left to government agencies and putting them in our own hands, we will build a foundation for a more flexible and fulfilling way of life. Numerous small communities will be created, and the people who move freely between them will solve problems and create new values through co-creation and mutual assistance. Local co-op is truly a mechanism for funding local commons whereby local assets such as vacant houses and best forests in a community can be made accessible and nurtured as commons while raising funded external resources. The goal is to optimally redistribute and invest common funds without the involvement of the former government or council in governance. Now let's describe the specific case study. The first case is Yamaguchi village, a type of depopulated area in Japan. Currently, Yamaguchi village has a population of less than 770 and is facing difficulty in maintaining the infrastructure that is essential for daily life. With a sense of crisis that their village will be disappeared if nothing is done, we are contacted by the villagers about three years ago and offered this proposal. Let's let people around the world know what is going on in Yamakoshi Village and get our friends. So let me show the video. This is the rural community of Yamakoshi, Japan. In 2004, a massive earthquake hit this part of Japan. Many left and never came back. If my parents and mother are gone, if the young people don't come back, this village will be destroyed. To help deal with this, Haruka's got some ideas in the digital space. To avoid losing our identity, I started using NFTs. When you buy an NFT, it's almost like your passport to be a digital villager. How many do you have now? There's 1,012 people. There's 1,000 and a half people that have bought these NFTs. Yes. Whether you live in Japan or in the world, anyone can buy an NFT and become a member of Yamakoshi. It's worth not underestimating the value of that legacy. And I hope Web3 technology can help bridge the divide between young generations and historical legacies. Currently the number of the digital villages both domestic and international exceeds 1,700 more than double the number of the real villages. The second is about a relationship between the sustainably regenerated nature in the sustainable local community. We have focused an abundant of nature in Japan. 70% of the country land is forested and the archipelago is surrounded by the sea. On the other hand, as a result of the decline of the forestry and the other industry planted as a result of the decline of forestry and other industries, planted forests have become desolate, creatures are disappearing, fish are harder to catch, and the risk of landslides and other disasters is increasing. It is important to guarantee economic feasibility while restoring the cycle of nature. SINLA makes it possible to raise funds for the maintaining of Japan's local forests and the oceans by allowing pre-holding rights for the carbon credit to be created to be exchanged on the blockchain. By using the funds raised to maintain natural resources, carbon credit can be created. The project is also promoting the democratization of the emission trading so that individuals as well as companies both domestic and international can participate in the trading. As our first site for creating a carbon credit we have a partnership with Oasis City. On the other hand, carbon credit are not only things generated from forest maintenance. We are working to create biodiversity forests and restore the nature that humans have destroyed. To create a watershed where diverse creatures can return and disasters are less likely to occur. is now in the position to generate carbon quality worth 330,000 US dollars per year. This model, which can be financed by caring for the local nature, is beginning to be deployed in other regions. Local coop, the practice is still in the process process but we have discussed with a specific example. We are forming the common fund with a steady stream of the funds as a resource through the multiple channel. The common funds are matched using methods such as a quadratic funding. In Japan, we are currently conducting demonstrations in four areas and plan to conduct demonstrations outside of Japan in the near future. Local coup is a strategy to start by creating a subsystem of local government in Japan, which is facing the rapid population decline, and it is an excellent opportunity to design the original radical self-government. We intend to develop local coop as the main system to implement a plural world where people freely move between multiple communities and help each other, creating the communities that are self-serving but necessary for survival. Thank you. Thank you. It's very interesting because some of the community members in Taiwan actually gather resources to buy one of the NFT. So we're technically one of the villagers. Any questions from the audience? Anyone? Okay, death. I'm going to throw it. Oh, oops. Very far. I'm going to throw it. Oops. Very far. Nice. Thank you so much for that very brief overview. I'm wondering if there's ways for people outside of Japan who maybe don't have a Japanese passport to participate in these kind of schemes. Is that part of the conversation? Is there any way to design in digital nomads to come in and experience even for short periods of time? In Japan, there's some kind of discussion about the digital nomad visa ID, but it's kind of separated. So now we are just for example, Nishikigoi NFT is just digital resident certificate NFT. So you can participate in a discussion and you can participate in voting. And also you can visit to the village and stay and talk with local residents and people and participate in a festival, something like that. And it's interesting. There are so many elderly people over 80, 90 years old, but they all realize digital villages. So if you're a digital village and and go to the Yamakoshi village, probably elderly, the little grandmother, grandpa, but they realize the relationship between the local resident and the outside of people, digital visitor. That's wonderful, I think. Thank you for your question. Thank you. I'm sorry, but we only have...",
  "eventId": "devcon-7",
  "slot_start": 1731573600000,
  "slot_end": 1731574200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/105LJog6X4qLZc6Fr_TdY9gMTLhUukbrbE677s9fsW6E",
  "resources_slides": null,
  "speakers": [
    "atsushi-hayashiatsu"
  ]
}