{
  "id": "the-future-of-web3-grants-learnings-from-studying-30-programs",
  "sourceId": "F9YCZY",
  "title": "The Future of Web3 Grants: Learnings from Studying 30+ Programs",
  "description": "This presentation will cover learnings from studying almost 3 dozen grant programs across multiple chains and ecosystems. I will present an overview of the state of grants across Ethereum as well as Bitcoin, Cardano, Solana, and other chains. I will present on the most pressing challenges for grant operators, feedback from grantees on their experiences, and will present a potential path forward in terms of collective priorities that can help all programs improve.",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "capital"
  ],
  "keywords": [
    "Grant",
    "Allocation",
    "Capital"
  ],
  "duration": 437,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736f1cc74749a4b8923840a",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736f1cc74749a4b8923840a.vtt",
  "transcript_text": " Hello and good morning, everyone. I'm Eugene Leventhal. I'm currently working on governance at scroll and I'm a research director at MediGov. Today I'll talk about some of the research that we've been working on over the last two years at MetaGov in trying to also get a qualitative understanding of the nature of grant programs in our space. And so we can better interface with grant programs beyond Web3 as well. So today, I know we don't have a lot of time, so I'm going to run through some quick context, some takeaways, and kind of what I'm thinking might be happening as we go into 2025 and beyond. And so to start with some context, you know, as part of this research, as mentioned, we've covered a bunch of different grant programs. This is just a sampling of some of them. So you'll see it's, you know, a lot of the major programs in the Ethereum world, as well as some other L1 ecosystems as well. So we're lucky that we're getting a view well beyond any kind of single set of programs and a lot of these folks have very different priorities so it is really interesting to capture that. And this year as well we expanded to not just cover programs but we also got into covering grant tooling as well. And as you'll see here we aren't covering any of the grant stacks themselves, we kind of chose to focus on tools around the ecosystem that can make it possible for grant operators to perform better, for grantees to better understand how they're performing relative to others, and so that we can all just have a better sense of the data infrastructure around the space. And so I wish I could just point to a slide with a 100% confidence of this is the amount of grants shipped. And that's actually its own challenge is because a lot of the data is fractured and siloed. Not all programs are on chain. Even the ones that are need a little more sense making. There aren't perfect databases. You know, from the programs that we've covered, we've seen over $1.2 billion USD go out. We haven't covered the formal RPGF programs and the Arbitrum and Tyco and some of the other very large programs out there. So, you know, there are multiple efforts, including Open Source Observer and DAO IP5 from MetaGov and DAO Star Star where we are trying to improve this landscape. So I hope at DevCon8, wherever we'll be in the world, whether me, Shinya, or anyone else working on these problems, someone will be able to show off this wonderful new database of clarified information. Let's get into the actual takeaways from studying these programs. One thing is on the mechanism side. We see that basically, you know, perspective grants, I'm giving you money to go try a new thing, and as of more recently, I'm putting in at least some milestones in there. That's kind of the norm right now. And in the last, you know, six to 12 months, we've definitely seen more and more experimentation. I feel like thanks to Optimism, the retro programs are definitely getting the most attention. But if anyone caught Rafa from zk-sync presenting in the GovHub yesterday, you saw like 15 different little experiments running. There are a lot of cool mechanisms being created. I think Ohwaki in his book charted around 50 plus potential mechanisms to utilize. And we're going to definitely see a lot more experimentation in the coming months and years. Also looking backwards, recognizing that we all want to better understand our impact, but what we actually mean by impact and how we go about studying it has been a huge challenge. And so at the very least, as a space, there's that recognition that we want to understand the impact. We don't feel like we really understand the value of all the grants shipped, but we don't know how to do it. And related to that is also thinking about, well, great, you gave someone a grant. Was that actually enough to help them succeed? Right? A lot of grantees actually need more than just money to ensure that they're able to accomplish their desired outcomes and impact. And as mentioned, we're seeing more tooling and infra. And as we start thinking about the future, you know, just the tools themselves are great, but they're not always enough. We need more documentation of what's happening. We need more both qualitative and quantitative analyses. We want to see more experiments happening. And I personally think in this next year, we're going to see a strong embracement of pluralistic grant programs. So a single funding entity might have five to ten separate programs running with various levels of coordination between these programs. single funding entity might have five to ten separate programs running with various levels of coordination between these programs. And, you know, I think we will see kind of some data and operational coordination across programs, but then letting each program kind of run their own thing. In the context of impact, and if anyone had a chance to drop by the grant hub yesterday, you know, we had a whole day focused on impact because, again, there is this recognition. And so some groups are getting open to embracing this program evaluation model where we better understand what are the outcomes, right, the milestones you commit to, what outcomes do those produce, and over time, how does that play out into impact? But we need more accountability of the grant programs, of the grantees, and throughout. So definitely looking for more improvement and adoption of some of these tools and use cases. With that, unfortunately, the time is up for today, so I'll just shift over to questions, and if anyone wants to geek out on grant programs later, please always feel free to find me. Thank you so much, Eugene. We see that there are no questions yet. So please scan the QR code to submit your questions. But while I have Eugene on stage, I'm really curious, are there any key takeaways from grant programs run by other chains that you think the grant programs in the Ethereum ecosystem can really learn a lot from? Yeah, I think the first thing, and this isn't exclusive to Web3 individually, you know, we have already run some events where we've had traditional foundations and re-granting non-profits show up. I think it's just the recognition that impact measurement is hard for organizations that have been doing this for a century. So we shouldn't feel bad that it's hard for us. And especially going back to one of the questions that I saw Shinya got, right? A lot of grant programs might only have one person running the entire program full time. That's not enough to both build really good systems, build relationships and figure out your impact. So if you actually are trying to deeply commit to doing grants, you have to be willing to commit to the operational overhead that inherently comes with doing it well. And I see the questions pouring in now. So look at the first upvoted one, tips and tricks to find good grants. Yeah, so I think for the most part, the days of free money are over. You know, for those who have been applying, you could just like show up, vaguely express interest, and then magically money appears in your wallet. At this point, you definitely need to focus on having a clear vision of what are you trying to accomplish and what does that mean for the ecosystem that you're applying to. Don't focus on spray and pray applying to every program you can. Pick one, maybe two or three that you could deeply commit with and work with and talk to them about, well, how does this help you? How can this be a two way relationship? Thank you so much, Eugene. Unfortunately, that's all the time we have. So let's put our hands together for him.",
  "eventId": "devcon-7",
  "slot_start": 1731641400000,
  "slot_end": 1731642000000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1kRi6qfFHeK8txYMq58KLUaOTV4stHccKNP0m-WyZWWg",
  "resources_slides": null,
  "speakers": [
    "eugene-leventhal"
  ]
}