{
  "id": "the-silicon-hospital-and-a-new-way-to-make-medical-devices",
  "sourceId": "D8UTDS",
  "title": "The Silicon Hospital and a New Way to Make Medical Devices",
  "description": "Could silicon be more effective for medical treatment than drugs someday? We think that day could be soon.  Openwater has spent nearly 9 years developing new tech to treat a range of diseases.  It's not pulse ox, fNIRs, HIFU or EEG ... it's new hard tech and it's open-source.  We will demo the tech on stage, and share with you our clinical results to date and explain how the technology works.  We expect to be in over 100 clinical trials next year.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DeSci",
    "Open Source Software",
    "Scalability"
  ],
  "keywords": [
    "Healthcare",
    "",
    "Medical"
  ],
  "duration": 939,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "hNFQtpNHufk",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735bf739dbb7a90e1c73a9e",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735bf739dbb7a90e1c73a9e.vtt",
  "transcript_text": " Tanya Cushman Reviewer:\" Peter van de Ven Hi, great to be here. Just first a brief intro to myself. I'm a hard tech pioneer in moonshots. I've created multi-billion dollar products on the hairy edge of physics. Former MIT professor, Brown University PhD in physics, and about eight years ago I started my latest project, it's called Open Water. And in rooms like these we've been building, trying to look at this idea of using the fact that our bodies can be penetrated by infrared light, ultrasound, and electromagnetics, and a belief that maybe we could leapfrog current healthcare systems and even drugs by modulating the phase of light and sound. So we've been doing that for a while. And the reason that I did it is I've shipped a lot of innovative silicon chips. So using silicon manufacturing that's coming online in consumer electronics and phase wave steering, I knew that we could steer beams of light, decode phase with interference, and even selectively select or destroy certain cells or stimulate certain cells. So we built these systems up for about four years, got pretty interesting results, filed a bunch of patents, a lot of work, and decided in early 2020 to get them into hospitals, start testing this on people. And the results are somewhat spectacular. First in stroke, large vessel occlusion stroke is the number two killer in the world. If you could diagnose that stroke in an ambulance, you could get the patient to the one of less than 5% of hospitals that could treat that stroke to the one of less than 5% of hospitals that could treat that stroke so the person wouldn't die so we built a portable that gives higher specificity and sensitivity for large vessel collision stroke than we can find published anywhere in the world that's 6.5 million lives per year now we go over to number three glial we gave some mice glioblastoma and treated them and move these mice into remission and on autopsy found that we didn't harm any healthy cells Charles River couldn't find any while we were waiting to get into humans for that we take that same device and put it into humans for severe depression and a 20-person trial and we were able to Turn off the over firing neurons in the default mode Network sending these patients into remission So with that we're pretty excited It was time to go get more money We've raised a hundred million dollars today and we're announcing today, for the first time, that Vitalik gave us $50 million from the Shiba Inu coin. Woo-hoo! Thank you. Nondilutive. And it's made all the difference. With that money, we've been able to reduce those carts from really a laser the size of a room to this that's going into production next month and those carts that were the size of the size the room as well to these to little consoles and all that's going into production next month this is a platform with a life-saving pan disease potential for not just stroke but all cardiovascular disease not just glioblastoma but all cancers not just mental disease but potentially all mental disease and beyond so open source is cool we're all believers but where this impacts the health care is even if you make hardware and software open source we open sourced all of our patents you still need approval to use it on somebody it's FDA it's regulatory approval the reality is in a comprehensive paper published recently the average cost of a novel therapeutic medical device approval is now 658 million dollars in capitalized cost and 13 years. So even if you open-source it, huh, what do you do? Well the key is here. 85% of that cost isn't in clinical trials. It's in the device. So that takes a lot out. Further, another 7% of that is in safety. So share the safety. Do we want a safer device or a less safe device? Will the regulator be able to approve a device, pan-cancer disease with lots with a hundred times more safety data will that make a choice easier or not will a doctor and patient find it easier to be able to access the safety data we think it's yes on all of those running those numbers our hypothesis is we take 653 million dollars out of the cost of developing a novel medical device with a de novo approval. So down to 5 million sub-three years. So how does this work? Phase wave modulation. Well these are the waves in light and sound. And what we do, for example, on these yellow emitters is we delay the phase from emitter to emitter so we can focus that sound near or far right or left up or down anywhere we wish to in the brain or the body so glioblastoma cells can hide out among healthy neurons and the neurosurgeon you know that you can't take them all but these cells have a mechanical property that no other cells do all aggressive cancer cells have really large nucleuses and small cytoplasms and we can exploit that like an opera singer can ping this wine glass hit that note and destroy that wine glass and harm nothing else in the room so that's what we're doing with glioblastoma. We did sonification parameter sweeps, found the frequencies. This is low-intensity ultrasound. Lower intensity than used for diagnostic reasons on pregnant women and their fetuses for the last 50 years in rich countries. But these cells can't take it. We're destroying them. And here, at a different frequency, I can tell you the frequency of our open source, this is 400 kilohertz, the other one is 150 kilohertz, we're able to turn on, stimulate, or destimulate neurons. And that's been helpful not just for non-invasive brain computer interface but also for pulling people out of mental disease addictions and so forth it's all together I think we're enabling read write brain computer interface while we're trying to solve mental diseases it's they're impossible to separate so another module this is our read module, uses that laser I just picked up that we've reduced down. This laser and a bunch of camera chips, four camera chips that are in your smartphone. And those camera chips are super small. We take the lens off and they've got, they're cheap, because they're small. They have pixel sizes, the size of the wavelength of light. So we let that light go into the head, and what we see on that camera chip is this. And it looks like the waves on the ocean, and we can read the waves on the ocean like a sailor can read the waves on the ocean and know where the fish are, know where the land is. Here we interrogate a blood vessel and the pattern changes because where the light hits the moving blood cells, it ricochets differently changing that pattern. And we can read blood flow very accurately with this way. In fact we can read it 20 times more accurately by some measures than multi-million dollar MRI or CT scanners with this laser and some camera tips. So that's not just good for stroke, but all cardiovascular disease and all micro motions of the body, we believe. So to get this far, we've been working with a whole bunch of great institutes, but everybody wants it, so that's why we shrunk the system down and decided to go into production. And also, you can build it, it's all on GitHub, you can build it yourself if you'd like to. Everyone that wants it, you can all have it, you don't need permission, go to our website, take it. I want to mention here there's also evidence we may be able to suppress cytokine storms as amy just discussed the impact of them treat inflammation even deactivate covid with the same way we're deactivating leoblastoma cells there's some evidence we're working on that in our labs and we're using our devices to do research on long COVID and microclots. We can see if we can ID them and if we can break them apart. So as we discussed, this is the problem. $658 million in 13 years. It's why we don't get any new devices. It's why healthcare... We've got 20 to 40-year innovation modes. So here's what we're doing about it we're flipping it on the side to make a open source generally general-purpose platform and the apps on top it is either treatments so those are the ones with regulatory approval three years five million dollars then we get into the call to 510 K substantial equivalents said one million, sub one year. So the question, we're a for-profit company, I hate to be crass, but people sort of scratch their heads and ask me quietly afterwards, and so I thought I'd just come out like, look, it's free as in beer, it's free as in speech, not free as in beer, like you can publish the recipe of the beer. You can go make your own at home. Most of us just go to the store to buy it. But by making more of something, it's cheaper. We enjoy a portion of that savings as profit. We engender trust. That's new. We don't charge $1,400 for an EpiPen one day. If we misstep on something, if we screw up, you can go get it made yourself. But we ensure quality standard that's IRB ready and FDA ready, we're ISO 13485 compatible, by safety sharing. We have the cost of clinical trials and double the speed for our customers. Plus, everybody just benefits. That's a cycle of innovation that's not a 20-year moat. So here are these new units. I've got them out here, LIFU and OpenMotion. All the electronics are going into the mechanicals and being tested, so they'll be ready next month. Here's more. And this brings me to a moment. We also did something just to save another $150,000 using our smartphone. And Vitalik, are you going to come up to get scanned in? So this is just in, so we prepped a little in this so this is the whole unit that's replacing that room and so if we put this on you I can actually turn it on see it so and then I will oops the strapping is being perfected it's Belka I don't think it's sticky enough. Can you? All right. So what we do, whoops, thank you for doing this. Oops. I just opened the wrong nap. Oop. So, I'm just putting in a number here, and then I start, and, Just putting in a number here and then I start and it's just saying unable to focus, okay. Try again. Okay. Okay. So I'm just taking some pictures of him with the camera. That's all you have to do is walk around and then we have to get the top of his head. Okay. That's it so it's all so we can take this off now although we should leave it on if we were actually going to sonicate him so now we scan him in and Vitalik has an amazing brain and we get to look at it right here although this is the interesting part a bit this is an MRI he did last week and what we're gonna do is pick a spot for target the interior singlet is gonna make him happy we know that and so okay with standard so these are what the pictures look like. And then this is making him 3D. And this is so we can know where the... I'll show you what this does. So here we overlay the 3D MRI with a scan so we match his bone structure. And then we look at where the transducers are and we know exactly where they are. And now we set the target and we compute what phase delays we need on the transducers and then we nail that target. I would love to sonicate him on stage but we don't have permission from the Thai government yet. However, I met somebody that got permission to do 200 people at Esalen recently. So next year, we'll do something. But yeah, this is how it works for any part in your body. And the interesting part is, as we develop our read part, the part seeing blood flow, we can get away from the MRI machine and use different scanning technology that's lower cost. So with that, this is somewhat like a smartphone moment from 20 years ago. Smartphones changed our lives. Look, a silicon hospital can happen. If you think of your smartphone, there's a dozen radios in it, four cameras and so forth. As we populate this, it can treat us for the diseases we have. Again, you might be asking, can I have one? My country, whatever. Yes, everybody can have one. Everyone has permission. You can build your own. I'll be showing these prototypes out in the hall shortly, and thank you.",
  "eventId": "devcon-7",
  "slot_start": 1731574200000,
  "slot_end": 1731575100000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1cscUxEQdkm5QVkLDeEDz09MWGMPqPDhGH5xZlEf1yRQ",
  "resources_slides": null,
  "speakers": [
    "mary-lou-jepsen"
  ]
}