{
  "id": "the-dacc-vision-balancing-progress-and-protection",
  "sourceId": "AA8SRQ",
  "title": "The d/acc Vision: Balancing Progress and Protection",
  "description": "A one-day summit focusing on the theme of d/acc: emphasizing the values of decentralization, democracy, differential accelerated progress, and defensive tech including crypto security, public epistemics, bio defense,  neurotech/longevity, decentralized ai and physical resilience.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 594,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67356cb99dbb7a90e15f86d1",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67356cb99dbb7a90e15f86d1.vtt",
  "transcript_text": " I will get straight into the one slide that I have today. So last year I wrote this post that introduced this concept of DIAC and in general was basically responding to a lot of the discussion that was happening at the time around techno-optimism, the need to be more optimistic about technology and to appreciate the very positive impact that technology actually has had over the past 10 millennia, and also the extremely positive potential that it has over the next century. And at the same time take seriously some of the risks and also really focus on which technologies are going to do the best possible job of giving us the kind of future that we want while at the same time minimizing and even actively fighting against the risks. One of the arguments that I made is basically that there is this important phenomenon which is the offense-defense balance, right? Basically is it easier to attack or is it easier to defend? And if you have an environment where it's easy to attack, then you almost inevitably have this kind of dark Hobbesian choice between a very powerful sovereign and a very destructive state of anarchy. And it just inherently creates all kinds of very bad political effects on top of creating constant ongoing risk of suffering, right? And at the same time, this is all happening under this backdrop of this discussion about is AI itself, and particularly super intelligent AI, this very big and massive risk? If it is, should we try to slow it down? But then if we do slow it down, then slowing it down forever basically just creates a world that becomes more and more unstable. And so what is the actually resilient and actually long-term stable future that we could be aiming for? And I think this to me is a near and mid-term part of the answer. So in the post that I made last year, I split up defensive technology into four categories. So the first split was the split between the world of atoms and the world of bits. So very famous distinction, might as well just grab it and use it. And within the world of atoms, split it up between macro and micro. And so macro defense, basically you think about physical resilience. And we'll have some very interesting talks later today, including topics on how to massively reduce casualties if some kind of extremely terrible disaster happens to humanity. Micro-defense basically means biodefense, so anti-pandemics. And both myself and a huge number of other really fascinating people will be talking about how we can make our environments vastly more resilient against actually existing and even potential pandemics all without requiring significant changes in individual behavior so you might be pleased to know that this room is actually already passively airborne disease resistant so for example over here you have this i mean box, and the box is HIPAA filter. We have a bunch of these all around the room. And so basically this room becomes vastly more safe against COVID, against any kind of future airborne virus that comes up without requiring anyone to actually notice. And this is one example of the kinds of open and widely accessible, easily deployable, and freedom-preserving technologies that we can deploy that can give humanity an orders of magnitude boost in its resistance against these kinds of threats. These are things that we are not doing today, and these are things that with a surprisingly low amount of investment we could actually do a much better job at. So then on the other side we have the world of bits. And the world of bits, this is a distinction that is I believe unique to me. But I talk about the distinction between cyber defense and info defense. Cyber defense is defense against threats where all reasonable people agree who the attacker is, right? So if a DeFi protocol gets hacked, then obviously the DeFi smart contract doesn't agree that it got hacked, because if it did, it wouldn't have sent any money out. But all reasonable people looking at the situation will agree that, well, yes, there is a hacker, or at the very least, someone who used a very unintended mechanism to get coins out of that system. And so we can talk about cryptography, we can talk about formal verification, blockchains, zero-knowledge proofs, what I call the Egyptian God Protocols, FHE and obfuscation, and also another important thing, hardware security, and actually deploying all of those technologies and actually even applying them at the level of operating systems and making sure that things are much safer than they would be today. And then info defense. So this is where reasonable people can actually disagree on who the attacker is. So one man's misinformation is another man's unjustly suppressed valid point and we need technology to actually help filter through this information and help people identify what kinds of content are more likely to be actually positive and what kinds of content are more likely to be misinformative, misleading, things that even they themselves, if they better understood it, would not want to see, and do so in a way that does not involve empowering a centralized elite that decides on behalf of everyone else what is good and true and what is bad and false. Now, that is all a vision of defense. I think one thing that is also important to talk about here is I added a third dimension in the year since then, right? And I call this the survive-thrive dimension. And here we talk about not just the technologies to protect against the bad stuff, but also actually enabling the positive future, right? So in the bio side, we have longevity. Who here is excited about longevity? So now longevity, and then beside longevity, we also have BCI, and BCI is kind of conveniently beside longevity and open decentralized compute, right? So on the left is making sure a compute is safe, or at the top, making sure a compute is safe. At the bottom is making sure a compute is amazing. And compute and biology together, we get BCI acceleration. And I think one of the really important points that we're going to make is that there's actually a lot of ties between these different spaces. It's all one very big integrated field. A lot of the viral persistence research that's being done in the context of long COVID right now actually has a lot of tie-ins that are very applicable to aging, right? So there's recent new theories that viral persistence actually is a thing that's a very big contributor to Alzheimer's. And then BCI, better medical technology, it contributes to fighting diseases, it can contribute to living longer under, quote, normal conditions, and it's also a BCI accelerator. Now, physical abundance. So we want the big silver punk cities, we want housing to be affordable. We want, you know, housing to follow Moore's Law instead of following Eroom's Law, for those who know what those are. And then, you know, we want to go to space. We want everything about our physical environments to not just be resilient but also be affordable and amazing. And finally, collaboration technology. So even in situations where people are not attacking each other, where you actually do have reasonable people and communities that have high trust between each other but they do want to be able to more quickly and more effectively agree on things and come to new consensus if we want agree on things and come to new consensus if we want decentralized collectives to like actually be able to act like life players and make bold choices and keep adapting themselves to rapidly changing circumstances without that collapsing into a dictatorship then much more powerful collaboration technology. So this includes all of the stuff we've been doing around public goods funding. It includes quadratic voting, other forms of voting, futarchy, all kinds of different governance ideas. So basically I think there are natural tie-ins at all sides of this between technologies that can create an environment where everything is much more safe and much more resilient by default and an environment where we have open, distributed and widely available progress for everyone. And so this is what all of the speeches that we're going to see today are going to be about. And I'm very excited to be with you and listen to them. Thank you. And so now I'll introduce our next speaker, Eli Dorado.",
  "eventId": "devcon-7",
  "slot_start": 1731553200000,
  "slot_end": 1731553800000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/105T9qheqDS91uBB6zsLjkTZKkqteIemZL0l9pkz8eJo",
  "resources_slides": null,
  "speakers": [
    "vitalik-buterin"
  ]
}