{
  "id": "the-longevity-acceleration-roadmap-a-technical-plan-to-solve-aging",
  "sourceId": "V9BA8B",
  "title": "The Longevity Acceleration Roadmap: A Technical Plan to Solve Aging",
  "description": "The Longevity Acceleration Roadmap: A Technical Plan to Solve Aging",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DeSci",
    "e/acc"
  ],
  "keywords": [
    "Longevity"
  ],
  "duration": 476,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "yT7L3bPpbEw",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67357e839dbb7a90e1096ef2",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67357e839dbb7a90e1096ef2.vtt",
  "transcript_text": " Take it away. Hi, my name is Nathan Chang, and I'll be talking about the Longevity Acceleration Roadmap, a technical plan to solve aging. This roadmap is a foundational project at the LBF and it's intended to help guide newcomers to the longevity space. I can only do a speed run now, but if you're interested in the full thing, check out the link below. Okay, so the LBF is a non-profit that I co-founded to mobilize the world's top talent to work on solving aging. But why work on aging? Well, simply because life is good and death is bad. And if you ask what is the thing that causes the most death, it's aging. So by far, aging causes the most death. 75% of deaths worldwide are caused by aging. And this comes in the form of age-related diseases like heart disease, cancers, Alzheimer's, etc. And this is an emergency. All 8 billion humans are on an exponential trajectory towards physical and cognitive decline and ultimately death. But if we can solve aging, we can envision a future where people can live for as long as they want in peak health and function. But if you want to see this future personally, we need to do something about aging today. So where's the plan to solve aging? Well, when we first started, we couldn't find any clear plan to solve aging. So we had to make one on our own. And in our plan, we wanted to have three key features. So one, we wanted to exclusively focus on direct research and technology paths that could solve aging completely. And two, we wanted to focus on specific, well-defined key technical objectives. And three, we wanted it to be actionable. So have a good overview of projects in the space so that people could easily join or start them or fund them. Okay, so we got a lot of input from scientists, researchers, and entrepreneurs in the field and we identified three main strategies that could plausibly solve aging. So one is biostasis. This means pausing biological time and this is typically with cryopreservation at low temperature or chemical fixation. Two, replacement, so replacing old parts with young and most promising full body transplants plus gradual brain replacement. And three, advanced bioengineering, so understanding and modeling biology and aging and also developing genetic and cellular engineering tools. aging and also developing genetic and cellular engineering tools. Okay. So one mental model to kind of understand these three technology paths is a two by two matrix. So in one axis, you're trying to solve aging or by time. And the other axis, you're either trying to understand aging or bypass aging like the complexity of aging altogether. And just as a side note, some of these technologies can also be thought of general defensive biomedical technologies. So for example, in like replacement could be useful for things beyond aging. So if you got in a car accident, replacement could be life-saving. Okay, so let's take a look at biostasis. So the strategy here is to pause biological time until the future where medical that, but also to prevent thermal fracturing. So when you're trying to bring a body or a brain from low temperature back to room temperature. So there's a number of different projects and startups in the space, but there still needs to be a lot of work to be done. Okay, let's talk about replacement. So this strategy is really divided into two parts. So there's replacing the body with a clone body and knockout of the brain. But then, too, for the brain, you gradually replace the brain with young neural tissue graphs, bit by bit, kind of like in the style of the ship of Theseus. Now, in the body, this really has only become within reach since 2018, when Chinese scientists demonstrated the first successful cloning of primates. And it's plausible that this could be extended to humans. Okay, but you can create a clone body, but you don't want to create a brain at the same time a person so you'll need to construct a genetic construct to ensure that the capacity to have consciousness never forms in the cloned embryo. And there's actually already a natural proof of concept for this. It's a birth defect called hydra and encephaly, where cerebral hemispheres never form. And these bodies actually never have consciousness, but can develop to full maturity. And last, to put it together, you have to do some sort of head transplant. And these have been done experimentally in the past in mice, dogs, and monkeys, with survival in some cases lasting days to months, but still needs to be improved. Okay, so let's move on to the brain. As I said before, you can gradually replace the brain with engineered neural tissue graphs made from a patient's own iPSC stem cells. And neuroplasticity of the brain allows migration of brain functions away from damaged areas or if done slowly. And just recently, the US ARPA-H program hired the leading researcher in brain replacement, Jean Haber, to lead a $100 million moonshot program in this strategy. There's a number of key technical objectives in our V1 roadmap. Most of the hard stuff is in the brain, but also in spinal cord reconnection. And there's a number of startups working in this field, but most are still in stealth. Okay, we also asked researchers to estimate the time and cost to get a reasonable attempt on this roadmap, and they came up with a figure of $3.6 billion in about 10 years. they came up with a figure of $3.6 billion in about 10 years. Okay, last, bioengineering. So this is the longest and most uncertain road. It will require the convergence of four different prongs. So one, large-scale data collection, something like a protein data bank, but much larger scale. Two, computational modeling, which could include AI models. And then three, design of genetic or cellular interventions. And four, delivery of genetic interventions or cells. Okay, next steps. So clearly, there's a lot of work to be done to solve aging. But unfortunately, there's very few people or resources devoted to trying to solve aging. But unfortunately, there's very few people or resources devoted to trying to solve aging. So if you feel an intense desire to defeat aging, definitely join the LBF. We're the biggest community focused exclusively on building for indefinite lifespan extension. We run highly selective intensive workshop retreats. Our next one is in March in Berkeley, California. But fighting aging is not just for biotechs and scientists. We need everyone to get society aligned on allocating Apollo program level resources to fighting aging. And so if this resonates with you, I'd encourage you to also join the vitalism community where we're building a social political movement to make fighting aging and death humanity's number one priority. And our community is organizing the biggest longevity event in the world. It's going to be a two-month pop-up longevity city in Berkeley, California.",
  "eventId": "devcon-7",
  "slot_start": 1731557580000,
  "slot_end": 1731558000000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/160SSgpDZHkjg4YniAuH3mYD1hx7hZuv_Qp2ip0zoRso",
  "resources_slides": null,
  "speakers": [
    "nathan-cheng"
  ]
}