{
  "id": "the-history-and-philosophy-of-cypherpunk",
  "sourceId": "8JVYCQ",
  "title": "The History and Philosophy of Cypherpunk",
  "description": "Rather than bend to knee to Donald Trump, the goal of the cypherpunk movement is to abolish the state in order to maximize human freedom via privacy-enhancing decentralized technologie. After reviewing the history of this deviant group of programmers in the 1980s, what philosophical and technical lessons do the cypherpunks hold for Ethereum today? Censorship-resistant digital cash was only one the start, and the missing parts of their legacy: mixnets and anonymous credentials for identity.",
  "track": "Cypherpunk & Privacy",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Anonymity",
    "Censorship Resistance",
    "Digital Sovereignty",
    "cypherpunk",
    "mixnet",
    "cryptoanarchy",
    "Anonymity",
    "Politics",
    "Values"
  ],
  "keywords": [
    "mixnets",
    "cypherpunk",
    "cryptoanarchist"
  ],
  "duration": 1555,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "prXQJSp_H8A",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673351433a168eb5355b5f3c.vtt",
  "transcript_text": " Okay, so we are here to basically bring back the cypherpunk roots of blockchain technology. I'm Harry, CEO of NIM. And I'm Max, Senior DevRel for NIMH. So also if you want to talk about building anything with NIMH, come find me over the rest of the conference. So I would just like to begin this talk saying that I'm actually very proud of Vitalik in the blog post where he decided he was not going to bend the knee to Donald Trump just because Donald Trump was going to pump everyone's crypto bags. Donald Trump and authoritarian states are the opposite of cypherpunk. It's the opposite of our ethos. The ethos of cypherpunk is based on meritocracy without borders, right? Not nationalism, not kicking out immigrants and all sorts of other complete nonsense. So I think it is a good time to kind of go into the history of how cypherpunk came to be. And we're going to do it a little bit differently. I've seen a lot of talks about, you know, Phil Zimmerman and Eric Hughes and the original cypherpunk movement, but there's a lot of stuff left out. So that's what we're going to go through. I'd like to just give a shout-out to the father, the inventor of the term anarchism, Pierre Proudhon, who had, at the dawn of the Industrial Revolution, many core concepts that now we are only seeing come to fruition. For example, do you know in 1863, Pierre said we can replace the monarchy with self-governing communes and collectives and individuals who will coordinate via contracts and create their own popular banking systems. Of course, he was taken out by Marx, and generally, kind of no one looks at him academically anymore, but there's really old roots. And then a lot of the questions that we are facing today came forward in what's called the socialist calculation debate, where the question was, how is it that we can reorganize society? Should we use money or not? Should we plan in a centralized way or not? And most of Austrian economics, Hayek and Van Mises and all these folks came from this debate as a reaction against the socialists from Vienna like Otto von Neurath who claimed that money does not capture all the externalities in the well-being of population. So it's a really old history that predates cryptography and the invention of computing about these topics. Should we organize in a decentralized way, returning sovereignty and power to individuals and to smaller communities or should we centralize power? If you're interested in more tons of philosophy work here, but the general thesis is that the spread of cryptographic techniques, which were originally the domain of the nation state, because the nation state is based on hierarchies, on the keeping of secrets, keeping of secrets around agriculture, keeping of secrets around military, cryptography let this spread into the general population, and this has been perhaps the most defying change in sovereignty since like essentially ancient sumer go for it max all right so this section of the talk we're going to go through a couple of let's say the more basic like um technological advances that have happened and then i'm going gonna then, these are things that we imagine that kind of everyone here knows about, but we'll do a quick overview and then we'll really jump into the more like the social side of cypherpunk and how this is, how it feeds back into the technology it creates. So in 67, Whitfield, Diffie and Martin Hellman, they kind of introduced public key cryptography into the public domain right so it's just the idea that you can for the first time then you could create a shared secret key with which you could have like secret communication uh over a non-confidential channel beforehand one of the massive problems of actually like setting up any kind of encrypted comms with people was how do you initially share this secret between both of you right this is the public key cryptography as well as being the basis of like tls ssl it's also obviously like the basis of so much of the crypto that we use today uh can we do the next slide all right so then in 79 david charm invented mixnets with untraceable electronic mail return addresses and digital pseudonyms right the t TLDR of this is how do you create an anonymous, untraceable communication network that protects the data of your comms, right? As well as the metadata. So can you create something wherein you can't tell who is talking to who and when? Next one. There we go. And not too long afterwards afterwards he then came out with another concept which is that of anonymous credentials to defend against a dossier society so this first line of this paper from 1985 I think sums it up better than a lot of stuff still sums it up today so computerization is robbing individuals of the ability to monitor and control the ways that information about them is used. So in 85, Charm was already talking about the lack of agency that people were having with regards to the data that was about themselves and how they communicate in the world and could already see the kind of possible dystopia on the horizon. So finally, we had Diffie-Hellman. They allowed people to create, to envisage stuff like Miss Next, which allow you to communicate privately. And then also we have credentials, which allow you to transact privately. These two kind of key cornerstones of like cypherpunk tech that then can be used to envision this kind of better society that we're talking about here. So that was the stuff that I kind of imagined everyone would already know. Now we'll go on to the more fun stuff. So this was Resource One's project, Community Memory. This was the first computerized public bulletin board system. So the first introduction that a lot of people would have had to computing in general uh it was in the people's computing center in san francisco and it was the yeah like i said the first pbs so the first way that people were able to like freely share and spread information using computer systems this is interesting because one of the people who is criminally under talked about in this space uh was also key in not just resource one but also the creation of the people's computing center and that's Jude Milhoon so otherwise known as Saint Jude she was actually the originator of the term cypherpunk itself so the title of this Congress and everything else owes that to her and as well as being a founding member of the Cypherpunks mailing list, she was a civil rights activist. So actually this picture from the Montgomery Police Department is after she got arrested in Montgomery, Alberta, on a civil rights march in 67. And it was broad civil rights activism throughout her entire life. She was also a senior editor of Mondo 2000, which is now Wired, so you can see how both tech and culture is constantly feedbacking, the feedback cycle is tight, basically. And a couple of choice quotes of, hacking is a martial art, a way of defending against politically correct politicians, overly intrusive laws, bigots, and narrow-minded people of all persuasions. These are some of her publications take a picture they're all really fun and good but we don't have that much time and a lot to get through so another piece of culture that fed back into the early cypherpunk movement and became part of as well its true names by Verna Vinger this is a novel which actually has the original use of the word nim in terms of pseudonym or hidden name and was even though it was written in a1 thoroughly predictive of government surveillance of parallel online spaces this then fed into one of the kind of like the author of a series of seminal texts within this, right, which is Tim May. So not only just True Names and Crypto Anarchy, which was an essay that then actually Vinger enjoyed so much, it was included in the late 90s represses of True Names. He was a founding member of the Cypherpunks mailing list, and his, let's say, predictive power to understand both the potential of this tech, so providing the ability for individuals and groups to communicate and interact with each other in a totally anonymous manner is something to bring attention to. Finally, a lesser known, let's say, strain of thought that I think is still foundational to a lot of the cypherpunk ethos that we want to push forward today is that of agorism. So agorism, until fairly recently, when it was revitalized by the Agorist Journal. So check that out at agorism.xyz. Then this was a relatively little-known strain of political political thought but still had a massive impact on the cypherpunk culture this is the idea of a counter economy right so possibly a different way of thinking about what we would maybe call parallel societies or these kind of like non-state these non-state market structures right so his was very much based in anti-statism and kind of went all the way from black markets to gray markets to just unregulated people helping each other out and the novel that's included here alongside night is you could almost think of it as kind of a dramatized thought experiment of a young man who as society is kind of crumbling down, his kind of journey through the agorist underworld to regain, I suppose, freedom in the way that Konkin described it. And I'll kick it back to Harry now. So where things all started getting real for the cypherpunks, it was interesting concepts and everyone here is inheriting this tradition. It was actually, hilariously enough, as the early internet took off, people leaked the secret beliefs of the Church of Scientology, who you may know as a lot of lawyers. And they started trying to go after some of the cypherpunks and crypto-anarchists. And this led to the invention of what was called the Cypherpunk Anonymous Remailer. So you took emails, put them in PGP, sent them to the computer, stripped off the header and sent them out. However, unfortunately, those Cypherpunk remailers were attacked. And this led to the first implementation of MixNets called MixMaster, an anonymous remailer, by Lance Cottrell, who I don't know what happened to him. I've heard various rumors. And Lynn Sassaman, who people think could have been Nakamoto. And effectively, you would send your messages through a series of computers and mix them up together. That kind of unlinked the messages. And this eventually led to Tor by Roger Dingledeen, whose talk you should all see, I think, on Thursday. And they basically said, well, you know, mix that to really slow. Can we build something faster that does web browsing but goes through multiple peer-to-peer relays? And that's the anonymous solution that most of us still use today. And I remember discussing with Roger once. He was like, ah, you know, this hidden services thing, what's it, could it be good for? And then, well, it was good for Wikileaks, right? So Wikileaks let, uh, Chelsea Manning, who, and, uh, folks like Edward Snowden, leak documents securely revealing the scope of the mass NSA surveillance and the failure of the Iraq war, so forth and so on. So WikiLeaks is effectively a Tor hidden service. And so it helped change the world in the war in Iraq. And the belief of Julian Assange was by releasing information into the world, people could decide what was true and what's false. And this would slowly eliminate the centralization of power and the conspiracy between the nation states to kind of maintain their domination. Now, the problem is, of course, the nation states weren't very happy with that. They obviously put Assange in jail. I just want to give a shout out to everyone who contributed to Assange Dow. I was good friends with Julian. And, you know, I said, Julian, don't you have tons of Bitcoin? He said, I sold it all to dollars. I was like, oh, Jesus, what a stupid thing to do. And then he was, like, kind of unsure about this ETH NFT stuff, but then it raised $16 million, if not more, to help him get out. Paid for his legal bills, and it's because of donations from everyone, particularly in Asia, that this happened. So that's absolutely wonderful, and it's a real use case of our technology. After WikiLeaks, there was, of course, the rise of Anonymous, which people may or may not remember from 2011. The first people that supported Arab Spring in Tunisia, of course, also came together because of Scientology. And some of you may not know this, and he may not be happy that I'm saying it, but Mustafa from Celestia, back in the day his name was T-Flow, and he was the youngest member of one of the kind of more prominent LulzSec anonymous crews. And even Vitalik himself was working at the kind of before Ethereum took off, he was living with Emir Taki and other people in Spain working on Dark Wallet, the first private kind of Bitcoin wallet, because it slowly occurred to people that Bitcoin wasn't private anonymous and we needed better technology, confidential transactions, so forth and so on. They did what was sort of the first, not ICO, but Bitcoin fundraise, and now Dark Wallet and all the cool stuff before it like Faircoin and Unsystem has evolved into Dark 5. I just want to give Rachel and Amir and everyone here shout outs and definitely come to Rachel's talk Lunar Punk Endgame to know what the future we're talking about the past but what the future of Cypherpunk holds and it will be on Wednesday at 4pm on stage 6. And at the same time as we're seeing this resurgence of the use of cryptography not to centralize power in the state but empower individuals through WikiLeaks and so forth and so on, anarchism itself is resurgent. There are now a large amount of interesting and wildly different anarchist books. I'm going to recommend a few here, but effectively they kind of argue that, you know, it's not just domination is not just a nation state, but domination is how we think of the world itself. That the world is not just something to be manipulated and controlled to satisfy our desires, but the world itself should be autonomous and free and This is there's also some newer questions in this book I would recommend there's the invisible committee and the tycoon a French collective of a book in 99 called the cybernetic Hypothesis and in this book they said capitalism based on the individual in a nation state is dying but actually it's being replaced by something worse a control society where computers are used to control and manipulate our behaviors and to make us completely transparent to various forms of power and domination but now the domination is not centralized in the palace, centralized in the king, but spread out and diffused through all society. And so I would just want to kind of end by discussing a little bit. We've covered a lot of history, and hopefully you got some cool screenshots of it, but what is actually the philosophy of cypherpunk? And I think it's actually a descendant of the philosophy of anarchism, which remember, happened at the same time the nation state itself started forming. And it's just the critique of anarchism, but given technological power through cryptography, which is ultimately a non-violent way to redistribute power relationships away from centralized power into individuals and smaller collectives, whatever they may be, communes, daos, so forth and so on. So the decentralization of power is the movement of sovereignty away from the nation state into the individual, and importantly, unlike all the rabid nonsense going on in politics today, it's universal to all humans, that we believe that all humans have the right to use strong cryptography, the right to transact freely, and to have freedom of speech. And that's like the fundamental, you can see how blockchain technology enables that. And also it's important that we, you know, we talk a lot about DAOs, but the fundamental structure is more deep. Voluntary association. That via contracts and market structures, we can create a society without domination and exploitation. By any form of ruling class or other kind of terrible self-inflicted domination. And then furthermore, that information itself, and this is where cryptography comes in quite useful, should be based on strong anonymity. You should be anonymous, first and foremost. And then you should, as Eric Hughes in the Cypherpunk Manifesto stated, which we kind of skipped over, but it's an excellent small text, I recommend reading it, that the real power of cryptography comes from the ability to selectively disclose yourself to the world. So you don't have a single identity. You can be a different person in different social spaces, at different points in your life, and amongst different crowds. And cryptography enables that universally using the internet. And this gives us agency over our flows of data, which more and more compose who we are. And the cypherpunk tech is still under development. Again, we have mixed nets. There's quite a few teams working on them. We at NIM are also working on one. Electronic cache, which, you know, of course, you have Zcache and Monero. But we decentralized fast private e-cash is still not a solved problem. And I think this has been incredibly neglected. We need anonymous credentials. We need ability to selectively disclose, I think ZK Passport and some other teams and Rarimo or whatever are working on this, the ability to selectively disclose arbitrary characteristics about ourselves but generalizable. We're also working on that a bit. And I guess the question we have is what are the consequences for Ethereum? Right? So we have, again, there are two paths of technology, as I think Amir Taki has said, looking at Lewis Mumford. And one path, we have the centralization of mega-machinic technology which sucks power away from the individual and two centralized power structures making us all slaves to the machine. And I think in the worst possible world, blockchain technology would make this worse, that we would be completely enslaved in some sort of libertarian nightmare where our movements and everything we do and our transactions are transparent to everyone and recorded. But the cypherpunk saying is transparency for the powerful, privacy for the weak. So we should have not identities, not soulbound tokens, not complete nonsense like dids or various authoritarian technology claiming to be self-sovereign like this self-sovereign identity nonsense but we should instead support zero knowledge proofs anonymous credentials that enable selective disclosure okay yeah i really wish people just not put the word self-sovereign in front of fascist technology and be like oh it makes it all better. It's so stupid. Privacy on chain is not succinctness. Everyone in Ethereum is obsessed with gas fees and making things succinct. But reality is we need private smart contracts, which DarkFi and Alejo and other folks are working on, private transactions, Aztec and Tornado Cash. And again, remember, we have to support our political prisoners Roman storm cement off and Alex support them and I'll just try to ending right now but we also we're now discussion of adding someone in the last session said what when should we add privacy to the network in aetherium I would say what better time than now and what better people than you all out there. We have mixed nets and NPC solutions which can help with network privacy and help with inclusion lists to make you know Ethereum not a censorship chain but a real chain open to the whole world and we need to defend validators from each other to prevent DDoS attacks and clients from malicious RPC nodes. And again, let's not forget another political prisoner who was the only person to support mixed nets when we started, but now is in jail or almost out, Virgil Griffith. So that's it. Yeah, that's it. Whoa. All right. You know If everyone had that level of passion I think we could change the world tomorrow But nevertheless Thank you For that very passionate speech And I believe privacy is an important thing Freedom is an important thing But let's go over to the Q&A section And we've got some interesting questions The top voted question, quite fun. Why does cypherpunk sound so religious? Would a religious fervor lead to cypherpunk being not that different from the future? It replaces. Very philosophical question. Some deep ideas there. How would you like to address this? Well, I would say religions generally start as movements against corruption and centralization wow i mean they do and then what happens is they're then incorporated into the nation state so for example buddhism i apologize i don't know too much about but like with christianity you have you know jesus throwing the people out the temple and then all of a sudden becoming merging with the roman empire right people do cypherpunk sounds religious because it's fundamentally an ethical and moral movement. That level is similar to religion, but rather than promising a pie in the sky, a happy afterlife, we want to create a better society now. And that will lead to passion. I would rather have people be passionate about building a better society now, right now, with the tools we have, than believe in something else. Well said. You want to add on? Yeah, if I could just add something as well. I mean, we've also been talking about, like, anarchy and a lot of anarchist political philosophy as well, which truly, I mean, all of that not solely relies on but is fully undergirded by the passion of believing in each other as human beings as well. So there's a crossover there with, let's say, like religious fervor, as you said in the question, but I think you can still distinguish those two things in a meaningful enough way, and it's still positive. Very much so. Thank you for answering that. Now, funny question at the top. Trump pumping our bags is good for funding cypherpunk's tech research. Cypherpunk. Cypherpunk. I'm just kidding. I mean, I would argue, look, more capital has been wasted in the pumping of bags than I've seen before. And there's a double side to the blockchain technology. All the interesting creative concepts come, at least from my perspective, from the cypherpunk movements. Blockchain, smart contracts, digital cash, anonymous cash. And then you have all this kind of, you know, other stuff coming from more traditional financial institutions, taking financial techniques. And, you know, I'm not against it, letting them be more widely accessible. And I would argue that what you're seeing now is you're seeing the movement, particularly with ETFs and what I was being, slowly more and more moving away from cypherpunk ideals and more towards just traditional financial pump-and-dump scams like whatever Trump is doing with DeFi, World Liberty, blah, blah. And so it's true that some percentage of that money is being spent for cypherpunk tooling, but very little, almost none. Tor Project, which has been providing anonymity for decades, their founder is here, Roger Dingledeen, but they don't have enough money. Very few people have donated Ethereum. So we have some good uses, like AssangeDAO, but most cypherpunk tech is incredibly underfunded. And now because of privacy, blah, blah, blah, and turn their cash, people are afraid of touching it and funding it. I know I raised money from A16 and whatnot. Some people throw down, but it's increasingly hard. Also, just be realistic with what amount of bandwidth you actually have when you're building. If you're optimizing for something to pump a bag, then you will build something that pumps a bag. That is it. So you also need to think about the amount of innovation tokens you have to spend on any of these projects, even though in theory, yeah, you could have your bags pumped by a bad thing happening. And just quickly, centralized power in general does not empower people. And cypherpunk is about empowering people, so that's why we push for decentralization. Voluntary associations do not necessarily evolve into nation states. Historically, they actually destroyed nation states from barbarians sacking Rome onwards. And I think that's not necessary. And I do recommend that people just basically throw down as much as they can on this tech yeah this is decentralization thanks everyone ladies and gentlemen fight against the mc and the mc state ladies and gentlemen let's give our two speakers a big big",
  "eventId": "devcon-7",
  "slot_start": 1731407400000,
  "slot_end": 1731409200000,
  "slot_roomId": "main-stage",
  "resources_presentation": "https://docs.google.com/presentation/d/1ovH3oyNrS_ZaZbKCeLkHxgPjrRCAzaWP7RVIf9TRkOo",
  "resources_slides": null,
  "speakers": [
    "max-hampshire",
    "harry-halpin",
    "iness-ben-guirat"
  ]
}