{
  "id": "the-challenges-of-leaving-laboratory-outbreaks-to-scientists",
  "sourceId": "TPLHFG",
  "title": "The challenges of leaving laboratory outbreaks to scientists",
  "description": "NA",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "Expert",
  "audience": "Academic",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 661,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "vwTDtUELw3g",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735abb99dbb7a90e1a6f0a9",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735abb99dbb7a90e1a6f0a9.vtt",
  "transcript_text": " Hi, thank you for inviting me to give a talk and thank you Vitalik for that perfect opening to my talk. So who am I and what am I doing here? In early 2020, I was pushing for the lab leak hypothesis to be taken very seriously. And as a scientist from a reputable institute, that gave me a lot of credibility. And once the lab leak hypothesis was taken seriously by experts broadly, that's when I went to the Bulletin of Atomic Scientists and asked them to please convene international experts to think of new frameworks around risky research that could cause pandemics. And so in the next 10 minutes, I'll tell you about ways that I think we should structure a future effective bio-risk and bio-safety approach. So as Vitalik mentioned, the number one takeaway that most of us had from the COVID-19 pandemic is that actually experts are not very reliable during times of crisis and that they themselves can be a source of misinformation. And we saw that in the COVID-19 pandemic, this ranged from human-to-human transmission, whether masks are protective, how the virus spreads, whether it's airborne, how to protect yourself, what is herd immunity, and whether the vaccines would prevent infection. And most of all, whether the pandemic might have started in a lab. And so what do you do about the situation, right, where the experts are not even able to tell you what is happening in real time? So fast forward five years since the pandemic began, we now know that experts broadly around the world agree that both natural and lab leak hypotheses are on the table. And briefly, this ranges all the way from an animal at the market infecting people to perhaps a villager getting infected and then traveling to Wuhan, or maybe a scientist was infected in the field while collecting samples and then went to Wuhan, or that there was an accident in a lab where this virus was being handled. Ultimately, everyone agrees that the original virus, the precursor of this virus, must have come from bats, but we just do not agree on how it made its way to Wuhan. And so all the evidence today remains circumstantial. No natural or lab source has been found or reported. And surprisingly, five years later, no external investigation has been conducted and what we know now is that there were influential scientists who sought to squash the theory calling it a conspiracy theory and this started all the way at the beginning of the pandemic. So I was really fortunate to publish my analysis of why I think the evidence strongly points towards ALAM origin in the New York Times this year. And just to sum this up, but if this is the first time you've heard of this, I really recommend you check out the article. Why do I think that COVID-19 likely starts in a lab? This pandemic, it really could have been caused by any of hundreds of different virus species and any of tens of thousands of wildlife markets in this region and in any of thousands of large cities and in any of thousands of large cities, and in any year. But it was a SARS-like coronavirus with a unique furin cleavage site. This is a gain-of-function feature that emerged in Wuhan less than two years after scientists there, sometimes working at low biosafety, proposed collecting and creating viruses of that very same design. And of the hundreds of other SARS-like viruses we know today, none of them have such a furin cleavage site. So this story, why haven't we found the origin of COVID-19? It's because an incredible amount of data continues to be withheld. So this concerns early cases, the transmission chain, the genome of the virus was withheld in the early days, including early sequences still being withheld. We still do not have access to the activities and catalogs at both the wildlife market in the city as well as the laboratories in the city. So all of these were not put out in the public. A lot of it was withheld in private communications, private databases, in scientific journals, and under peer review. Sometimes an editor would reject a paper and it would stay hidden for years. And private research documents as well as thesis and grant proposals, we only know about all of these data today because they were unearthed by mostly internet sleuths, so independent vigilante sleuths, as well as scientists and journalists. And some of these other documents were leaked by people inside the US government or others were sued for through the Freedom of Information Act. So these things had to be painstakingly pulled out of the sources. What the COVID-19 pandemic really showed us was this complete lack of interest in finding the origin of COVID-19. So if you look at the US collaborators of the Wuhan scientists, they admitted that their collaboration had never given them access to the pathogen samples. So these are samples from bats and even people collected and stored in Wuhan. They could not reproduce the database of the samples or virus sequences. And they did not have access to the database in real time that was in Wuhan. So they didn't even know about viruses collected after 2015, even though the funding covered their work through 2019. So that's a four-year gap. They do not know about the viruses collected after 2015 in Wuhan. They did not ask their collaborators in Wuhan if they had started on experiments proposed in 2018. So this included experiments where they were inserting furin cleavage sites and other gain of function features into SARS-like viruses in Wuhan. So some would say this is strategic ignorance, right? Maybe they didn't ask because they didn't want to have information that would then put them in a difficult spot. But I would actually argue that it was structural because they never structured their collaboration in a way that gave them full access in real time to the samples and even the sequences. And this problem really goes way beyond the EcoHealth Alliance to even upwards in government. Earlier this year, the Department of Defense in the U.S. said that they had not been closely tracking their funded projects. They could not even tell how much funding they had given to Chinese research that would enhance pathogens with pandemic potential. And unfortunately, the new US government policy on this sort of research that kicks in next May still leaves many loopholes open. In fact, the entire research pipeline that could have caused the COVID-19 pandemic remains not subject to oversight. So you can go anywhere, collect any novel pathogens, no oversight. You can serially passage them, so adapt them to human cells, even human avi cells, and even humanized animals still not subject to oversight. So really nothing has been done here to deal with this risk of pandemics coming from labs in this manner. So unlike other technologies, you know, like nuclear, chemical, even in transportation, even flying planes, where you have a serious accident, there's no independent body here for these sort of pandemic risk research to really conduct external oversight. So there's no independent external organization that will have oversight of this work around the U.S., let's say. And when that's an incident, there's no investigation to go in by this independent body. It's usually all self-investigation, self-reporting. So this is a real problem because we are now truly in an era of pandemics starting from laboratories. Unlike 20 years ago, today research for pandemic risk is proliferating due to many technological advances in gene sequencing and synthesis as well as dropping costs. So now more and more labs are gaining access to this ability to create viruses in the lab from scratch, just based on the sequences. It's not very expensive. And unfortunately, a lot of this is happening at low biosafety in ways that cannot contain airborne viruses like COVID-19, let's say. And it's importantly not being systematically tracked. So there's no one really systematically tracking it, even at a national level in the U.S. So why is the case? And I think that there are two problems here that really underlie this challenge. So the first is that there are many penalties and fear of retaliation for virologists to be calling out their peers. So imagine if you start pointing fingers at your colleagues for doing risky research, you could immediately find yourself alienated and shut off funding applications as well as publications. So this would essentially destroy your career. And those who are for gain of function, so they want gain of function to happen, they say that you can't put regulation on us, you can't put all this oversight on us, because then the US will lose the competitive edge. So the problem with this is that even these scientists, these leading experts, as seen in the case of COVID-19, cannot accurately predict the risk of their cutting-edge experiments. It's really hard for them to know what will happen when they're working with novel pathogens and putting in new features. So the second problem here is that we are kind of stuck in this 9-11 dichotomy of outbreaks being either natural or deliberate. And this is a problem because I think that the risk of pandemics coming from lab accidents is much higher than the risk of a pandemic coming from a deliberate bioterror incident. So unfortunately, this story of let's defeat the bad guys let's let's defeat the terrorists it gets much more interest and funding it's much more sexy than then telling people let's just stop people from having accidents let's protect the good guys from having accidents in their labs so that this whole field of accidental lab leaks has been really neglected in my opinion and and it is it's compounded by this fact that many many virologists are afraid to call out their peers. So very little is being done. And I have this quote that really exemplifies this problem. So early on in the pandemic, an influential virologist said, it really bothered me that this was some suggestion this was a lab construct. So the virus that was causing the pandemic. If it turned out to be true, it would really bother the hell out of me. Not just because of people dying and so forth. It's an indictment of the field, right? So these virologists, and not just him, they think that if COVID came from a lab, it would indict the entire field of virology. So this is a major conflict of interest. So where do we go from here? Clearly, we should investigate the origin of COVID-19 so that we can restore public trust. Imagine if, you know, a few decades down the road, it's found that this pandemic started in a lab. We need to be able to look back and see our public leaders, as well as our scientists, leading the charge on investigating and finding the lab origin. We don't want to look back and see them being complicit in the cover-up, suppressing an investigation. So there are three things that I think should inform a viable biosafety strategy. So the first thing is that OSINT is necessary, but during a crisis, as we have seen, is challenged by mis- and disinformation, a great amount of information is actually kept private, and not even for malicious reasons. We need a system to counter misinformation from experts, and journalists especially should be much more skeptical and seek diverse input so that they don't find themselves amplifying the misinformation. And finally, we really truly need an independent organization and regulation that focuses on reducing the risk of accidental pandemics. So thank you again for inviting me to give this talk.",
  "eventId": "devcon-7",
  "slot_start": 1731568200000,
  "slot_end": 1731568800000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1p9hSMYlq5ABHla4brR0sibxE7RLsOTyxT95WWe9_UTQ",
  "resources_slides": null,
  "speakers": [
    "alina-chan"
  ]
}