{
  "id": "the-chain-mail-gaze",
  "sourceId": "73SKE9",
  "title": "The Chain Mail Gaze",
  "description": "With their dreams of new ‘Network State’ empires, resource extraction, and colonial domination, today’s tech overlords are the descendants of Europe’s mediaeval Crusaders: well-financed, zealous fanatics remaking the world in the name of their greater good. Through a psycho-political reading of scarcity, chauvinism, and colonialism, The Chain Mail Gaze connects Crusader ideologues’ desire for blood, land, and booty, to emerging ‘frontiers’ mediated by contemporary technologies.",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Governance",
    "Network State",
    "decolonial",
    "Governance",
    "Network State"
  ],
  "keywords": [
    "decolonial"
  ],
  "duration": 502,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "pt2v-fk2KEE",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67381c6a1b0f83434d9c98b2",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67381c6a1b0f83434d9c98b2.vtt",
  "transcript_text": " Jane Male Gaze by Waseem Z. Alcindi. Please, give him a warm welcome. Hello everybody. It's slightly out of place to have such cheerful music introducing this talk, perhaps. So the title of it is called The Chainmail Gaze, and hopefully the reasons for that will become apparent as we go on. But I'm sure you've all heard of the mail gaze and the kind of externalities and, you know, unfavorable things that come with that but what about the chain mail gaze well hopefully we'll find out not got very long so I'll try to give you a survey of what's actually quite extensive anthropological and philosophical research project okay some pictures of big strong men and their swords looking into the distance perhaps thinking about lands to conquer. A short poetic refrain, the church and the network, zeal and time, death and money, all sides of the same coin. I want to talk to you about an interim project that led up to where we're going to, that's called Profit Motives, looking at the false divinity of capital and speculation have orbited manipulated and harnessed it as narrative feedback machines simultaneously reading and rewriting realities markets exist as a distributed conversation between uh among speculators driven by profit motives and appetite for divination and prophecy today new strains of techno-colonialism are emerging which are the latest of a series of echoes throughout Western history. An ascendant cabal of technology elites are attempting to reshape the world in their favor whilst hiding in plain sight behind the technologies that have enriched them. Theirs is a Promethean zealotry without faith, affecting an aura of divine sanction for the purposes of elevating the ego, enriching the chosen ones, and creating empires of various stripes. But was it not? Always so. I want to read you a short story, fictional speculation, about where we might be going in the future. It's called Seething Like a State. Decentralization has a cost, the price of anarchy. The price is always due, but the rewards weren't cheap to reap. So solid CCRU. What most did not expect was that payment would become due at the grandest scales of governance. The West failure state, forged under the fire of peer pressure, was ambushed by upstart modes of power, opening new vistas of communication, commodification, and communion. The orientations that nation-states had used to enshrine their power only made it easier to undermine them. The bigger they were, the harder they fell. Brextopia, the European Union, NATO's cave, the United State machine, all returned to dust. The decline of the nation state in the roaring 20s became a canon of canonicity for an entire generation of sole traders. It wasn't even just the bit leavers. In those days, there were many networks, many messiahs, many ideologics, all with their own profit motives. So, many of you have doubtless heard of this concept of the network state that has emerged in the last few years. Exit fantasies, arguably fueled by the failure or the shortcomings, the shortfall of the full promise and the dream of Web3. I'm going to read you a short section from Balaji Sreenivasan's self-titled book in 2022. A network state is a social network with a moral innovation, a sense of national consciousness, a recognized founder, a capacity for collective action, an in-person level of civility, an integrated cryptocurrency, a consensual government limited by a social smart contract, an archipelago of crowdfunded physical territories, a virtual capital, and an on-chain census that proves a large enough population, income, and real estate footprint to attain a measure of diplomatic recognition. The magic words in here are recognized founder and diplomatic recognition, and territory, I would say. So these projects carry echoes, in my mind at least, of some of the earliest expeditions set out from the West in search of new territories to conquer and subjugate. So many of you have doubtless heard of things like Liberland, Sealand, Seasteading Institutes. This is the Zahidi-designed metaverse HQ of Liberland on screen here. There's been so many attempts to make crypto islands, Bitcoin cruise ships, and they've all failed. It's quite interesting. But what seems to be different now is the level of capital on hand as a result of market success of these technologies to the people that want to reshape the map of the world in their own you know to their own preferences into their own cause, we know that leaders of nation states, we even have leaders of nation states that are cheerleading some of these technologies. Nayib Bukeri, the authoritarian strongman in El Salvador, would like to build a Bitcoin city financed by volcano bonds in his country. He's not done it yet. But meanwhile, he's removed the judiciary, removed term limits, and instituted one party rule. And most of the bitcoins are cheering this on. So I ask myself, are we still in this for the freedom? Now, you know, made possible by Ethereum, DAOs and all the rest of it, we have projects like Aleph, Urbit and even Praxis. Praxis on the left and Prospera on the right. So these projects are trying to build physical cities, private territories, network states, or at least what may develop into the Bellagio concept of the nation state. And it's at this point I want to introduce the chainmail gaze. Today's tech overlords are the descendants of europe's crusaders well-financed zealous fanatics wreaking destruction on the planetary other in the name of their greater good the vatican sponsored waves of levantine invasions that began in the late 11th century with the midwife of capitalism colonialism and technology as we know it today. With the network state organizational concept, a cadre of powerful ideologues blessed with tokenized wealth, a toying with the prospect of reshaping national frontiers, mirroring the desires of Frankish noblemen and their knightly orders in the Levant a thousand years ago. And that's all the time I have. Seven minutes for a thousand years of Western history. Thank you very much. Thank you, Waseem. That was awesome. Now we have the latest, but not least, talk of the day. We will have in just a few minutes the last conversation. I want to take this time also to invite you tomorrow to come to stage two. We will have several talks here the whole day and afternoon. And now with my coffee, my serial design patterns for Web3 and beyond, we have Jeff Emmett. Please give a warm welcome to Jeff. JEFF EMMETT.",
  "eventId": "devcon-7",
  "slot_start": 1731409800000,
  "slot_end": 1731410400000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/17RnVgqUzy-db9C_X4-QKgghgKSZ40O-5PtTPVJladMk",
  "resources_slides": null,
  "speakers": [
    "wassim-z-alsindi"
  ]
}