{
  "id": "the-end-of-self-custodial-wallets",
  "sourceId": "KDUNLM",
  "title": "The end of self-custodial wallets",
  "description": "This talk provides a quick overview of how countries worldwide restrict or plan to ban the self-custodial ownership model, which is the foundation of cryptocurrencies.\r\n\r\n- What kind of laws, regulations and guidance countries have passed to restrict self-custodial\r\n- What kind of areas are being targeted: ownership of cryptocurrencies, wallets, developers, interfaces\r\n- Who are the driving forces behind opposing self-custodial\r\n- How to counteract this development",
  "track": "Cypherpunk & Privacy",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Business",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Free Speech",
    "Censorship Resistance",
    "Regulation",
    "fatf",
    "Censorship Resistance",
    "Free Speech",
    "Regulation"
  ],
  "keywords": [
    "Self custodial",
    "FATF",
    "wallet"
  ],
  "duration": 594,
  "language": "en",
  "sources_swarmHash": "9a46ddf422d25723e072d0ee0fd70a3bb5735f6e1210c767aaa352e247b6d9ff",
  "sources_youtubeId": "Cwn42afQZ3k",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736db4874749a4b8945b981",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736db4874749a4b8945b981.vtt",
  "transcript_text": " Tämä video on tehty Yleisölle. Yleisölle on tehty Yleisölle. Yleisölle on tehty Yleisölle. Yleisölle on tehty Yleisölle. Yleisölle on tehty Yleisölle. Yleisölle on tehty Yleisölle. Yleisölle on tehty Yleisölle. Hyvä. Tänään olen täällä puhumaan selviämisestä ja miten hallitsevat ja ystävät yrittävät heitä pannaan. Tämä on järjestelmä, joten jos haluat nähdä täysin esityksen, niin seuraa minua Twitterissä, koska laitan lisää. Why does this matter? If and when the government are going to restrict the use of self-custodial wallets, it's so called bad ending. At that point it doesn't matter what you do there in the audience, because you can all go home and work in a bank or a McDonald's. So it should be obvious for you why this is important. pankissa tai McDonald'sissa. Se on tärkeää, että se on tärkeää. Ensimmäisenä omaa kastoria-korttia. Ensimmäinen on, että me olemme asettamme. Se on meidän kontroliimme. Ei ole riskejä, että pankissa tai keskusteluissa he rikkovat sen ja sinä menet. Jos menet, se on vain o screw it up and you lose. If you lose, it's only your own fault. The other important point is no vendor login, so you can change wallets. You are not locked in a single wallet provider, but you can have a competition between those, and it's very good for cost efficiency, because the cost will be very, very low for us, and you all know that we are not Kosko-efficiönsä, koska kosteus on hyvin vähäinen meille. Ja kaikki tiedätte, että emme palaa valitsemme. Ja valitsema on ei valitsema, vaan krypto, joka vahvistaa kryptovaluutteiden luonnon luonnon. Ja nyt ei ole vielä mahdollista syntyä kryptovaluutteita itse. It's no longer in this point feasible to ban the crypto themselves. Instead, what governments and regulators work is that they will restrict its use. And there are mainly three ways to do it. Don't allow to transfer in and out from wallets. Regulate developers or regulate interactions with the wallets like a front-end Uniswap. And this is how the regulation in the world is done. ja sillä voidaan säädellä interaktioita valitseihin, kuten Uniswap. Ja tällä tavalla maailman säädellä on tehty. Meidän huolimme USA-politiikasta on se, että kaikki ekonomiset rikot ovat menneet pysyvään, mutta tämä ei ole rahaa, vaan se on vitsi. Joten kaikki kansalliset säädellä jatkuvat, mitä FITF is doing and they are doing what the US says them to do. And there's also compliance industry who is making money out of this. So for them it's very beneficial that we will restrict the use of the wallets. So they will vote for more regulation every time. And the first case we have in Estonia. So 2021 it was already almost there that they banned this. Ja ensimmäinen tapauksena on Estonia. Eli vuonna 2021 se oli jo melkein siellä, että he pahasivat tämän. Siinä oli yksityiskumppani, joka lobaoi hallituksen, että me ei pitäisi oikeastaan pystyä pystyä pystyä pystyä pystyä pystyä pystyä pystyä pystyä pystyä pystyä pystyä pystyä pystyä. ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja aloittaa, ja Seuraava asia on Euroopan unionin. Suomalaisen antimainojen lausunnon edistämisessä sanotaan, että käsittelyt ja käsittelyt itse käsittelyt ovat edistettyä, mutta niiden määrä on vähentävä. Siinä on vain käsittelyt, joita on vähentävä, luulen, että se on 1iminnassa ensi vuonna tai vuonna 2026. Sitten Euroopan unionin kansalaiset eivät voi käyttää itsevastuullisia koneita, jos asetuksissa on enemmän kuin 1 000 euroa. Sitten on Seychelles. Se oli ensimmäinen maa, jossa ei ole edes ohjausta, vaan sen omaa lakia. Joku, en tiedä kuka, I don't know who, wrote in the law that non-custodial services, including wallets, should be regulated. And it means that the developers should sign up there with the local regulator if you are developing a wallet. It didn't make to the final law text, but it was explicitly also said that this request came from FATF. And they wanted to close this so-called loophole for the users. And then there's Denmark where they told that Uniswap and others can be identified, so that's why developers like these should be also registered in Denmark asen VASP-palveluun, koska ne voivat antaa palveluita danilaisille. Ja mitä voit tehdä? Organisaatioita, jotka ovat pro-kryptoita. Uskon, että Yhdysvalloissa on mennyt melko hyvin. Ja tärkeintä on, että puhut lokalaista mediasta oman maanasi. Ja yritetään saada luonnollisia ihmisiä siellä, jotka voivat lobbyoida privatiivisesta ja oikeuksista omaa asettasi. Kiitos. Ja seuraavat kysymykset. Kiitos paljon. and the next questions. Thank you very much. So again, if somebody has any questions, please raise your hand. I will toss the mic to you. Yep, we have one. Yeah, better. It's a bit far. So, of course, you can ban alcohol, as they tried to in the US, obviously, but it's an enforcement issue. Do you think that's going to give us any sort of ‑‑ that example, does that give us any reason to have hopium? I think your talk is great, by the way. I think it's so important. I'm not trying to dumb this down. It's really important. But is there hopium out there that this isn't going to be enforceable? I think we have to work a bit harder than that. I mean, it depends, because when they banned alcohol, it was like 100 years ago, and the serverless state didn't exist. Today, governments can follow your actions, and especially the actions of the software companies and developers very closely, so they can knock your door if you have a GitHub account. So that's why I'm quite pessimistic that this can fly under radar, so to speak. So there are bad people out there who do bad things. And while you can argue with how the regulations are laid out, there's not much argument that terrorist financing and money laundering shouldn't be allowed. So how do we, I think we all in this here, we believe in self-sovereignty, but we also, many of us probably think that zero knowledge is a potential solution. How do we get the governments to try it? Because it's not even in the Overton window of discussing these new technologies. How do we get them to actually approve a test case or some way of trying it? I mean, I think we already fixed it in one country by having our friends in the U.S. elect Trump. So that's a step forward. But also, I think the correct way to go about it is to talk with media, so that we have a proof, we have a real scientific research that for the anti-money laundering work, the current regulations restricting centralized exchanges is enough, and it's already stopping most of terrorist funding. We know that the terrorists, yes, they use USDT and Bitcoin and so on and especially North Korea is kind of a pain in the butt but it's not very significant still. Crypto has grown but still it's super small compared to you know all the other gas and oil and whatever there is going around. Yeah, we have one there. Last question. What do you think about companies like Chain Analysis and other days? Do you think they make a positive impact? Some yes, some no. Some of them are pro-crypto, but some of them are part of this compliance industry complex, and they only see how they could seek rents. nähdä, miten he voisivat saada lupaa. Ja usein voi tietää, onko yritys Pro Crypto tai onko se täällä vain rahaa, jos lukee raportteja. Ja jos he tekevät niin sanottua fear-saleja, kuten he tekevät raportteja, joissa sanotaan, että niin moni teröristi tulee ja blockchain on vain käyttöön rahallisuus ja rauhoja ja niin edelleen. chain is only used for money laundering and drugs and so on, and they show the curves like how it's bad usage is growing, which by the way is not anymore growing. It means that they are selling the fare to the governments who then buy their services. But some good companies, like I think chain analysis is one of the good ones. They create reports that are balanced and they show that yeah, some things are bad, but some things are actually very good. Thank you very much.",
  "eventId": "devcon-7",
  "slot_start": 1731647400000,
  "slot_end": 1731648000000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1Ap05BLrc25kR-WdwGvInSGF6oehwIIAg82A0vs0Krrg",
  "resources_slides": null,
  "speakers": [
    "mikko-ohtamaa"
  ]
}