{
  "id": "the-rise-of-appchains-from-l2s-to-rollup-clusters",
  "sourceId": "SEARYQ",
  "title": "The rise of Appchains: from L2s to Rollup Clusters",
  "description": "Ethereum's rollup-centric approach has led to the emergence of L2 Rollup Clusters reducing fees but creating fragmented liquidity and a less seamless user experience. Third-party bridges, though helpful, are cumbersome, vulnerable to hacks ($2B losses to date), and costly, leading to high fees. In this keynote, Alex will discuss how native interoperability, with ZK at its core, can resolve fragmentation, enabling Clusters to collaborate instead of competing for users and liquidity, ultimately dr",
  "track": "Layer 2",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Ethereum Roadmap",
    "Appchains",
    "Zero-Knowledge",
    "interoperability",
    "Appchains",
    "Ethereum Roadmap",
    "Zero-Knowledge"
  ],
  "keywords": [
    "Fragmentation",
    "UX",
    "interoperability",
    "Rollup Clusters",
    "L2"
  ],
  "duration": 1508,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673498739dbb7a90e1d3f53f",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673498739dbb7a90e1d3f53f.vtt",
  "transcript_text": " Hello everyone, my name is Alex, I'm the founder of ZK-Sync and CEO of Matterlabs, and today I'm going to talk about the app chains and how roll-up clusters work, what they are and what implications they have. And I will start with the, you know, it's probably obvious, roll-up centric roadmap has led to transformation of the Ethereum's original vision of the world computer into the Internet of Chains, which is not a coincidence. This is like we're in blockchain web 3.0. We're kind of following the evolution of computing in general and the evolution of the internet. It's the third wave where we're putting value and putting valuable state and global cooperation to the ultimate degree on the internet, on chain. And what it is going to lead to is that the apps will also transform uh just like the applications on the internet got their own servers and got their own functionality moving from shared co-located uh environments uh the same thing is going to happen with app chains, with applications on Ethereum. There are many reasons for this, but basically we're going to go from a world of every application is deploying on a separate chain, on all of the chains, to a world where you can deploy in one chain. It might be a chain you fully control as an application. And then all the other chains are interacting together and have access to what you're doing. And we see a lot of interest for this topic from the app builders because obviously developer experience of deploying many chains is not great. But more importantly, because you can customize your application and you can offer functions that are not possible on the uniform, like one-size-fits-all environment. And also, very importantly, you have the full ownership of what's happening there you can control the access rights you can control how you handle different policies and then you can control the value flow of the application to a much higher degree for example you can have validators who are receiving the the fees uh certain other value capturing mechanisms, and then delegating this to the token holders, to the larger community of this app. So there are many very, very strong incentives. And the main blocker, why we have not seen this happening so far, is the lack of native interop. It's not even the lack of infrastructure. The infrastructure is there. We have roll-up as a service provider. You see now hundreds of roll-ups being built, but many of them application-specific, kind of like in their infancy. Many of them are generalized, but the cost of running your own chain is approaching negligible thresholds and like you basically get a lot of services everything is is coming out of the box available for you to use but the lack of native interop is really preventing us to to live this vision through uh fully and i want to give you an intuition why and then i want to walk you through the technical trade-offs of different approaches of how we can actually make this work. So this talk is mostly for application builders and chain builders, and those application builders specifically who are considering doing their own app chain. What is the perfect world? Whenever we build a revolutionary technology, the best approach is to imagine the perfection, the perfect endgame, and then reverse engineer from there and see what steps we need to follow to get there. A perfect user experience, in our opinion, consists of three major pillars. Pillar number one is you want to have a single account. Just like today on the internet, we got to a maturity where you have your email and it's basically controlling everything you're doing on the internet, all of your accounts. And it's really easy to connect. You basically have Gmail connect, Apple connect, one click, unlocks everything. We need to get to the same experience on Ethereum. Your single wallet, you don't have to maintain a plethora of wallets on all different chains and manage their complexities. It should be very, very easy. The second thing is, from this one account, you should be able to interact with any app on all of these chains that comprise the internet of chains that is today ethereum which means no manual bridging no manual switching of networks uh and the confirmations are fast so the same user experiences you have on a single chain should happen across multiple chains. And finally, there should be no overhead involved with these interactions. When you interact, when you transact from one chain, from your account to one chain to some application, you should not be thinking about like, oh, that's going to cost me some percentage of the capital or assets that I'm sending there because there is some bridging involved and you should know that your security model should remain the same like if an app is deployed on the ZK roll-up and it's immutable smart contract you can firmly count on it because the theorem gives you this hardness and enforces its commitments and this should not be violated by some new intermediaries that are jumping in between and facilitating your bridging. So those three things must be held intact. And there are basically two ways to get there. As you probably know from the product world, we can try to come to a perfection at the Ethereum white level, like have endless conversations, think through, go through endless iterations and come with the perfect design and try to implement this, which will probably take 10 years. Or we can go through a gradual path and deliver incremental value as we go. And obviously, you can imagine which way I'm advocating for. Ethereum has always been pragmatic and embraced the second approach. So what would the second approach look like for Pan-Ethereum interop that can enable the rise of the AppChains? The first level,",
  "eventId": "devcon-7",
  "slot_start": 1731493800000,
  "slot_end": 1731495600000,
  "slot_roomId": "main-stage",
  "resources_presentation": "https://docs.google.com/presentation/d/1WOJXGXgVk5LDrCpMtULqypFYqyEzI5whhM4XbIRAcVA",
  "resources_slides": null,
  "speakers": [
    "alex-gluchowski"
  ]
}