{
  "id": "this-cursed-machine-onchain-game-post-mortem",
  "sourceId": "UBFQ9V",
  "title": "THIS CURSED MACHINE: Onchain Game Post-Mortem",
  "description": "“Live in the pod, fulfil orders, get bugs.”\r\n\r\nTHIS CURSED MACHINE is a fully onchain sci-fi body horror fulfilment center simulator by Moving Castles, a game studio for the tactical research and development of autonomous worlds.\r\n\r\nWe will speak about learnings of launching an autonomous world onchain (Redstone) and how we embraced the emergent chaos by making the bot attacks, exploits and player corporations part of the narrative of the world itself.",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Best Practices",
    "Gaming",
    "Autonomous World",
    "worldbuilding",
    "Autonomous World",
    "Best Practices",
    "Gaming"
  ],
  "keywords": [
    "Worldbuilding"
  ],
  "duration": 1202,
  "language": "en",
  "sources_swarmHash": "b4c4551ccb33d3795de7e41d4cb7cd97e5953ba31de85f1be90de8c82c4ba2cf",
  "sources_youtubeId": "vNIQeYXxmVw",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673470199dbb7a90e1ed9779",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673470199dbb7a90e1ed9779.vtt",
  "transcript_text": " Hello, hello everyone. Nice to be here. I'm Arb, also known as Arthur Rowing Bear. I will be talking about this Christmas machine. I work at a company called Moving Castles. We're a game studio for the research and development of autonomous worlds. I have a quick definition of autonomous worlds. If single player worlds emerge out of personal computing and multiplayer worlds emerge out of client server computing, then the definition of our organization is that autonomous worlds are the new games and worlds that are made possible by P2P computing. I also want to say that I'm fighting a fever, and if I'm not making sense, you can blame the bugs fighting against my immune system right now. Okay, so we started building this autonomous world called this cursed machine a while ago. It looked like this in the beginning. And I will show you the first minutes of gameplay now. Can you make it darker? Yeah, I skipped over this part because it's boring. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Bugs. Okay, I'm not going to show all of this. You're getting a kind of feel of what's going on. You're a stump trapped in a pod, and you need to produce different materials. It's a fully on-chain sci-fi body horror fulfillment center simulator, which is less important than you live in the pod, you fulfill your orders, and you get bugs. At some point you unlock a multiplayer market, you compete with other stumps to solve orders, and you can build new things on top extend the world. So, why? Why did we do all of this? But first I think there's a message from our sponsors. In the heart of industry, our machine's so grand. Transforms complex matter across the land Caffeine, MSG and plasma powder in hand Our cursed machine makes everything planned From waste to worth in our expert command Okay. Dear TCM, how did you do this and why? So the first thing we did was... The game is quite simple. It's a token in, push it through a circuit, token out game. We created a vast material map. And so if you take bugs, for example, token out game. We created a vast material map. And so if you take bugs, for example, you input bugs, you input them into the rat cage, you put the rats from the rat cage to the burner, you get dead rats. And there's a lot of them. Okay, composability, tokens. Second thing is narrative composability, which is even more important I would say. So what's great about building within a cursed corporate environment is that a Excel sheet is lore consistent. This has advantages over other worlds. It makes it really easy for people to contribute to it and it kind of blurs the barrier between user-generated content and what we do. It also makes our job really easy. The next is LARPing. So everything we did was in character, which means that... Oh, yeah, diaper is in order, just so you're not confused. We did everything in character, so the Telegram chats, the Twitter, everything was done in character as we are also employees at the same company. We're just the middle managers, and we are blaming other, you know, the corporate overlords, et cetera. The third thing that was important was to embrace, fourth thing, to embrace failure. Every issue is a narrative opportunity. Very simple one is we're building an on-chain game, which means we're dealing with this vast broken machine. So the game is about being trapped in a vast dysfunctional broken machine. But also this applies to more things, as you will see. being trapped in a vast dysfunctional broken machine. But also this applies to more things as you will see. So what happened? A lot of things happened. We launched and players started building different things. This is a kind of overview of the different organizations, the different stump initiatives that emerged. Someone found out that the orders for stumps to create different materials, the smart contracts were open, so they created a site called Stumpfmakler where you can buy materials from the stumps. Different companies started emerging that sold and cornered parts of the market. We had a first issue. Evil hackers started stealing the bugs we had wanted to give to the good stumps who were joining the game. Very bad evil hackers. So we gave a grant to two new insurance companies, which were player-led, which gave predatory loans to new stumps so they could now play the game. Of course, this would bite them in the ass later. There's a second company. We also, at some point, the medical records of the stumps got leaked. Oh yeah, Frolic built an answering machine. I don't know if the sound works. Thank you for calling the SEUMP unemployment hotline. Your call may be recorded for quality and training purposes. Please hold while we connect you with books. Order fulfillment center. So this was built by a player. And it reads the smart contracts and reads you the current orders. You can actually call it now. There are six jobs available. Job order number eight, 6461. We need 79. Okay, then we not going to do all of this. Okay, then we had another hack. Someone stole all the bugs. So we went out with an official statement. We started telling the stumps that they need to get ready for the war against the hackers. And we didn't. We beat the hackers. Actually, it was me DMing the hacker and asking him to return all the funds which he did also we had a corporate partnership with TSMC and this is a Can you turn up the music? I got a scat on that back on them corns She cut it for me, she want me in that corns She ice and mail it with no stop at corns Every time I suck it, it was all learned I ain't take sides, I ain't rock with no terms You can get hit with that fire, it's a burn Slow out the pulse, but I feel like a worm Bitch, I be deep, you can cut me in thirds I got a ease in me and I opened that part Yeah, bitch, I ran over the curb Bitch, I'ma pull out your toes and I turn them You knew what I said, bitch, you know that you heard me 24-7, we get just seven and eleven, double, till my face ain't been blurred My money's hard, my money fast My money thick, my money sturdy My tooth is gon' pull if I'm long-range, hit up thirty times, yeah, you callin' them crud Okay. So that worked, kind of. We are really happy with the outcome. We saw a lot of things emerge and we think that happened because of the different methods we used and I think that there is a lot of unexplored potential for leaning into issues, especially in the game space. As people come from the protocol space, they're kind of clinging to this idea of security and I think it doesn't matter. If you're actually creating a thing which is supposed to be fun, the most fun about crypto is all the hacks, all the drama, all the on-chain shenanigans and why not embrace that and make it into the narrative of the game itself? And I think that that is really how you get a decentralized narrative where the actions of the players and the different participants shape what the world is. We're working on a next game. This is an artist rendering. I'm not going to tell you more than that. If you want to follow what we're up to, you can scan this QR code. I'm going to give you a little bit of time. Since not many people are doing it, it must be because you don't have a lot of time. So I'm going to give you more time. Okay. Since not many people are doing it, it must be because you don't have a lot of time. So I'm going to give you more time. Okay. Are you all done? Great. And then the last thing is we slash Rasmus, one person from Moving Castles. Oh, yeah, I want to credit GVN and Rasmus, my two co-founders, and then also Agnes Cameron and Manus Niehoff, who worked on TCM. And this one was made by Bunker and Rasmus. And you can... It's shulgen.engineering, and you can upload your frogs and synthesize new materials. It's available now. And it integrates with ZooPass. Okay. The URL is shulgin.engineering. Wait. I don't know how to go back. Wait, wait. Okay, here. You have to read it quickly at the top. Here, shulgin. Okay, wait. Okay, one more time. You see it? Okay, here. You have to read it quickly at the top. Here, Shulgin. Okay, wait. Okay, one more time. You see it? Okay, I'll do... Okay, I have a lot of time left, so I'm kind of... But I think that maybe it's time for questions. Did we get questions? There are questions? Good. Because we have a lot of time left. How do I do this? Alright. A big applause for Arb. Who, despite being sick, came here and presented all of this. Don't be shy. Please bring more questions. Because the first one is not really a question. It's just like, thank you. And then the second one would be what's your favorite material from the map? I think the first question is really important. And I like it a lot, I must say. Thank you whoever asked that. I agree. I am persevering. Persevering. My favorite material from the map? I don't know. There's a lot of good ones. I will think about it a little bit. Does anyone in the audience have any favorite materials? Adrenochrome is pretty good. Neuralink is good, yeah. Yeah, the mold stuff is also pretty good. There's a whole, like, I like the whole oil, what's it called, material map unlock. That was great. Petrochemicals. Electronics was great. Petrochemicals. Electronics was good. Why Redstone? Yes, of course. I didn't mention that. We worked together with the beautiful Lattice company, and this was built on mud. And we used their chain called Redstone as well, which worked really well. I mean, we like working in mud, and Redstone worked well for, you know, it came with the thing and it was good. I'm not super opinionated about chains. I think it worked really well and we like working with the Lattice team. Who's the best player? I think that this is an interesting question. We had a leaderboard, but I think the best players were the ones that started creating their own stuff. I think Frolic built in the API, which was cool. That was a great player achievement. And I think that the players who extended the game and extended Logix were the best players. Are there other projects? Okay, here's a lot of stuff here. How did you build it? Mud. So the ones on the top are the ones with the most upvotes. So what percentage in character are you still in right now? That's a very good question. I don't know. I think the fever is pushing me more into character. Here, obviously, blockchain constraint options for game loops as well as developer resources independent of these two. Is there a central mechanic game loop you find interesting from a narrative perspective? I think that it's really hard to build game loops or games on chain. I think you can do a lot of classical games when you start doing obfuscation or ZK stuff. Otherwise, it really limits the game space. I think that TCM worked for the time we ran it, but it also was basically a capture with a faucet at the end. And then we did a bunch of wheeling and dealing around that to extend the game life of that. I'm currently, I find like games that have optimal strategies but that change based on player behavior really interesting. And I also like social oracle games like the beautiful Dress to Impress game on Roblox, which is a game where you dress up and you perform a fashion show and then people rate you for it. That's a great game. The next would be, are there any other projects that are along the same lines of a merchant blockchain narrative? I don't know. Are there? Does anyone know? Do you know any, Jibian? Are there any more? All of them trying? Yeah, we're all trying. I think that maybe games are too afraid to lean into the failures. I think that maybe is a unique thing about our game. And I think if more people were able to do that, we could have more emergent narratives. I think that's basically the somewhat chaotic kind of core message of my talk is that, you know, the people feel like they have agency over worlds that they can break them. If you don't allow that, you're just creating a little sandbox that people can play in, but you don't allow them to change or break the sandbox. Really, the most interesting narratives are the ones that subvert the expectations of the game makers, and then become part of the narrative. All right. Then the one that actually interests me a lot is like, how did you build it, the whole thing? Yeah, it was built using MUD by a great team, us at Moving Castles, and together with the support of the MUD team. And I think it looks good because we leaned into the kind of limitations of the medium. Yeah. Thank you so much. So what was the funniest hack then that happened? Yeah, I think the faucet hack, the, I mean, yeah, there was all kinds kinds it was like a lot of people like trying to break the game and then me kind of begging in dms for them to return the funds that happened a bunch of times the good thing is we we just were the central bank for the token anyway so when someone like hacked or tried to speculate on something we just increased inflation so it was worthless so like we did a bunch of stuff like this and uh that was fun uh we basically the the the trick is just to just demotivate so much that they give back them the tokens",
  "eventId": "devcon-7",
  "slot_start": 1731486600000,
  "slot_end": 1731488400000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1cXPZD6cWdMNr2QSeVuUQ8-WSQ_YhrCRA6-l3ClLl2n0",
  "resources_slides": "https://drive.google.com/file/d/1JqJ4gKILsbR7oAM4Z6wVL0u5iDi-uDgZ/view",
  "speakers": [
    "arb"
  ]
}