{
  "id": "transforming-systems-lessons-from-taiwans-movements",
  "sourceId": "B9EDKY",
  "title": "Transforming Systems: Lessons from Taiwan's Movements",
  "description": "I will talk about the most recent struggles of open source communities in Taiwan, g0v specifically, how da0 has been trying to help in the past year or so, the conclusions we had and what is still missing. g0v has been running bi-monthly hackathons for 10 years now, which has been the key foundation for the community. April this year they stopped due to lack of funding support, we use this as a point of reference and how a web3 oriented subgroup like da0 could have done better, and the future.",
  "track": "Coordination",
  "type": "Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Civil Resistance",
    "Coordination",
    "Public good"
  ],
  "keywords": [
    "Ecosystem",
    "Funding",
    "Mainstream"
  ],
  "duration": 924,
  "language": "en",
  "sources_swarmHash": "2b9dfee773cde09da38f0a590cb1a7dbf70bfd70506a4361cbd19409fbeea5ef",
  "sources_youtubeId": "2cuicY646Jo",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6736ef6274749a4b891853e7",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6736ef6274749a4b891853e7.vtt",
  "transcript_text": " Thuy Nguyen Reviewer Reviewer 1 Can you guys hear me? OK. Hi guys, my name is Noah. So today I'm going to talk about the strategies of making changes and our reflections from Taiwan. So, 10 years ago, this community called GovZero started in Taiwan. It started from having a bunch of hackers trying to open up government data. And later in the years, it become a beacon of digital democracy globally in the world, a leader of digital democracy in the world. And in recent years, the momentum has slowed down a little bit. So two years ago, me and my partner Vivian here basically started this initiative called DAO Zero. And the mission was to supercharge Gov Zero, to supercharge the digital democracy movement. And we did a bunch of things. This includes the decentralized ID pilots in Taiwan, these include various retroactive funding experiments, these include a lot of research funding the Commerce Taipei, Dao Taipei, Plurality Taipei, a bunch of different things. But at a certain point, I started asking myself, what has really changed? Were we really able to help? At a certain point, despite the relative success of all the experiments, this year in April, GovZero basically posted this picture saying that, okay, so we're running out of funding, please donate to GovZero so it can keep running its bimonthly hackathons continuously, which the bimonthly hackathons for 10 years, it has never paused once. So this is a signal that maybe despite all the experiments that we've done, maybe we need to go deeper on how we can make systemic change in the future. So if we are to initiate something new, if we really want to change system to the better, positively, sustainably, what are the strategies we are to adopt, what are the potential tools",
  "eventId": "devcon-7",
  "slot_start": 1731638700000,
  "slot_end": 1731639900000,
  "slot_roomId": "stage-5",
  "resources_presentation": "https://docs.google.com/presentation/d/1mKMsPFBtVYtAcJOczCaTR2Ssw6fiQ86zw-Jz3zyGmFk",
  "resources_slides": "https://api.devcon.org/data/slides/devcon-7/transforming-systems-lessons-from-taiwans-movements.pdf",
  "speakers": [
    "noah-yeh"
  ]
}