{
  "id": "trust-zones-why-daos-will-be-the-best-organizations-ever-created",
  "sourceId": "R9ENCP",
  "title": "Trust Zones: Why DAOs will be the best organizations ever created",
  "description": "This talk introduces the theory of Trust Zones. Every Trust Zone is a unique blend of constraints,  reputation requirements, and accountability measures, within which an agent can operate on behalf of an organization to further its goals.\r\n\r\nI will contend that the operational management of all organizations can be described as creating new Trust Zones and adjusting their parameters. And further, that DAOs and other onchain organizations can do this better than any other organizational form.",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DAO",
    "Governance",
    "trusted",
    "DAO",
    "Governance"
  ],
  "keywords": [
    "Trust"
  ],
  "duration": 505,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "tu6t6GdLyCg",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67346f1e9dbb7a90e1e41835.vtt",
  "transcript_text": " Thank you. I'm super excited to share this with you. I actually have like 40 emails that I want to get through in 20 minutes, so we're going to have to keep moving. This is mostly not about me. It's going to be about the cypherpunks. But I will have one slide for ZK Sync. A quote from the ZK Credo. The unwavering long-term vision remains advancing personal freedom for all. Let us remain resolute in championing digital self-ownership onward. You can read the full ZK Sync mission statement in Credo online. We believe in it a lot. All right. Moving on. This talk started because I got annoyed. There were too many people on, like, crypto Twitter who were discussing cypherpunks and had clearly, like, no idea what they were talking about. And so instead of badgering them, I'm just politely informing everyone now of what the cypherpunks were really like. So I read every cypherpunk email. I will now pick the best emails and highlight the cypherpunk ideas, culture and worldview so you can see it for yourself. And we're going to read them and learn them together what the cypherpunks were really like. So here's the format for my talk. First of all, shout out to CryptoAnarchyWiki. You can read all of the archived history there if you'd like. The subject line will be at the top, author, day, month, year at the bottom, and then in the middle will be a screenshot. I'll try to narrate it over it if you can't read all of the text if it's too small. So let's begin. First email. How to make an automated remailer in your copious spare time with easy to find and inexpensive software tools you may have lying around. And then the e-mail goes, it's actually, this is just a clip of it, but part way through it says the Perl script in summary strips off the mail header, saving the subject line, rewrites the new header, here's the script and then just puts the Perl script in the e-mail. So when cypherpunks say, like, cypherpunks write code, they, like, from the first email, were already just sharing with each other tools on, like, how to build this stuff. Like, this literally was, like, one of the first emails. Because the next email I have, like, a week later, is I've had a bunch of people ask me about this group and what it's up to. Accordingly, I drafted a small statement of purpose. Please comment, Eric. And the full thing you've probably seen before, this is like the first draft of what becomes the Cypherpunk manifesto. There's like eight different slight variations of all of this. You've probably seen it a bunch of times. In fact, this is probably the only Cypherpunk email you've ever actually seen that wasn't email. The line I like the most from this one is, Cypherpunks know that a widely dispersed system can't be shut down. Very true. Now, so, the lid of this talk is just me highlighting a bunch of emails, so they're gonna kind of be random, but it's gonna overall get across all of the points. So, let's go. We appear to be entering a long-awaited crypto singularity. Tim C. May, in November 1992 1992 listed a bunch of reasons why he thought a crypto singularity was imminent. There was incredible excitement at these topics at hacker conferences. There were several journalists. There were articles in Scientific American on digital cash and quantum cryptography. There's a firestorm of over 500 comments about cryptographic keys. And all of these points are accelerating situation. Things may get very interesting and very sticky in the next several months. So 1992, maybe there wasn't quite a crypto singularity yet, but now today, I think it's funny because we have all the same topics. Thoughts on digital cash from Mark Horowitz about a month later. Said I'd really like to see some sort of digital cash system set up. Three days after that, Carl Barris replied with digital banking file formats, et cetera, here's what I envision a digital bank working like. And how's the bank protocol. And then just starts going through the math. Alice chooses X and R. Alice computes B equals R cubed times F of X mod N. Like three days later, they're just going straight to building digital money right away. They're not messing around. Electronic money legality. The question came up whether it would be legal to issue electronic money or regular money for that matter. Hal Finney says he got a couple history books out of the library to try to learn something on the history of private banknotes. And then the email is like him doing like seven different book reviews that he clearly like all read over the weekend. One of them is George Selgin's book, The Theory of Free Banking, is called The Return to Situation Competitive Note, where each bank would print its own money, and people would use all these different monies freely according to their preferences. I just think it's funny how he read a bunch of books and emailed everyone his thoughts in the summary. White House letter, they were discussing whether they should, like, contact the government at all or just, like, keep building on their own. There's a suggestion from Dr. Zapod that we should simply send our stance on encryption and why it shouldn't be regulated. I think this is a common goal among all cypherpunks on this list. That is, except the NSA folks who are listening in. Timothy C. May, nonetheless, I will never desire censorship for its own sake, and I will always fight to remove conditions which make censorship exigent in the first place. Yeah, the problem is, like, who decides, like, who gets to be censored? And so, very against it from the beginning of the mailing list. Another email about a White House encryption idea. They are not passing out the algorithm. I don't trust anyone to tell me it's secure. Sent from treason at GNU. I'm not a cryptographer, so it wouldn't help me if they gave me the code, but open source adds more trust. So, is Rush Limbaugh giving Clinton shit about wiretap chip? So, someone sent an email to the Cypherpunk mailing list that said, well, I work for a major airline and would be happy to get you his home address if he has a frequent flyer number. And Mark replied, excuse me, are you completely missing the point here? We're fighting for privacy. Misusing your position in whatever airline you work at for broadcasting someone's home address is completely unethetical to what we're trying to do. So I'm showing you the best of the best e-mails, but there's also people sending emails who have, like, almost no alignment with what the cypherpunks, like, you would think of today. Like, somebody's, like, working in an airline company trying to dox people and, like, mailing the cypherpunk mailing list for some reason. Reply on digital cash. I thought this email was super funny. So someone sent a question, what's to keep someone from opening a digital bank and taking the money and running? And Duncan Frisco replied, nothing. So I think this is the first example of cryptocurrency rugging. But yeah, good luck. Radical paranoia. This one just kind of felt relatable. The end question, am I being paranoid or is there a valid issue here? It's about cryptographic key signing and with PGP back in the 90s you would physically meet someone in person and then sign that their public key actually belongs to them and then he has a problem with doing this online because you can't be completely sure you're talking to the right other person and so I kind of appreciate the thought analysis here of being super paranoid about how these things are going to work. Secure software, secure voice software issues. There are problems yet to be solved. I'm rapidly coming to the conclusion that the only way around the SLIP slash PPP modem buffer delay problems is to speak raw synchronous data to any of the modems, even to the point of implementing v.42bis and HDLC in the host computer instead of using the modem's implementation. I have no idea what most of that means, but it kind of sounds like a lot of core devs when they talk about stuff. And so, yeah, I just thought that was like a fun parallel to today of like, yeah, I'm coming to this conclusion, guys. I think everyone agrees on here, right? Digital warfare. L. Detweiler sent an email that we may see the creation of virtual governments in which geographical location of an individual is irrelevant to the choice of government and perhaps for the first time in history, the individual can choose freely among all that exist to that which best suits his preferences, and the so-called social contract between the citizen and his government is actually made explicit for the first time. This will happen on all levels. And we're beginning to realize what communication truly entails. Now, L. Detweiler is kind of a bit of a character. He's going to come back in a few seconds. Paul Ferguson sent first, Don Henson, I guess, sent an email and said if there's no cypherpunks cause or movement please let me know. Being able to interact with people who believe in the cypherpunks cause is the only reason I subscribe to this list and if there is no cause I'd like to unsubscribe and spend my time elsewhere. And the reply is just what the hell are you talking about? Because imagine being in peak cypherpunk mailing list. Tim May and Hal Finney and Nick Szabo are sending emails every single week. And there's somebody in here who's just like, is there a cause? Does anyone know? Is there a movement? And the reply is just like, what are you talking about? Because some people just can't get the point. I don't know. This is LD. It is LDettweiler. Just a reply to LDettweiler's last flame of me. I won't say that he's insane or deranged since I know that does no good. I won't say that he is raving or frothing at the mouth since that does no good either. So some of the emails kind of get a little bit heated. And Detweiler is basically mad that everyone starts thinking that everyone hates him and curses him. And I continually sent out some of my most masterful and brilliant postings when I still have respectable reputation. Despite that, P. Metzger was continually attacking and dogging me in the most vicious way a human being, at least I think he's a human being. So they're really like, it sounds like crypto Twitter. It's ridiculous. It's hilarious. And Anon replied, but this is probably L. Detweiler again, to Nick Szabo, who Nick Szabo nicely wrote, no, Mr. Detweiler, I'm not pseudo-spoofing. It's not clear what this term means. Detweiler just kind of made it up and got paranoid. But Detweiler replied and said that to Nick Szabo, frankly, I think you're a bald-faced liar. Are you intellectually challenged, or am I going to have to root up all the archives to prove it? I think this is very entertaining to ask Nick Szabo himself if he's intellectually challenged. So all of this drama with Detweiler kind of came to a bit of a conclusion with Timothy C. May writing a summary email of who is L. Detweiler. He joined the cypherpunks list about a year ago, showed great enthusiasm and energy, volunteering to write an FAQ on anonymity and the internet and privacy and anonymity. He put this out very quickly. Email goes on. By the end of it, he has to be removed from the Cypherpunks list and was. He created his own group, the Cypher wonks list, with fascist rules and regulations about true identities, the evils of pseudo spoofing, et cetera. I gather from reports that's now moribund, I didn't join for obvious reasons. And so this was almost the end of Eldette Weiler, except three days later he responded with who is Timothy C. May. And he says, first, reports of my insanity are greatly exaggerated. And I think that's one of the funniest opening lines to an email I've ever seen. And then he has some shots back at Timothy C. Mays, incapable of understanding the distinction between truth and satire. So the drama goes on within the email list. Here, black net is probably what we would call a darknet today. The darknet could remove most of the risk with near perfect anonymity and digital cache. A tidy side income could be created for anyone with access to classified information. This is from Hal Finney. Digital cache, anonymity at the same time. Hal Finney sent a lot of emails about this. Another reply, Hal Finney wrote more, the other issue which I know less about is the possibility of cryptographically strong obfuscated code. For the cryptographers in the audience, you know that's like something we're still kind of working on today but is potentially possible. But the fun part is that Timothy C. May replied that the similarities with zero knowledge work are apparent. In zero knowledge interactive proof systems, one knows something without actually showing what one knows. So sent in March 1994, cyberpunks were already talking about zero-knowledge proofs. NSA digital cash. Yeah, this brings up some serious issues. I doubt it will be long before there are some official government agencies developing official U.S. digital cash system. In fact, it wouldn't surprise me if there are divisions in the NSA dedicated to doing it this moment in April 1994. Cypherpunk's goals. Bad debate drives out good debate. Timothy C. May, he was kind of like almost a moderator for the list a little bit. I mean, the list is unmoderated, but he'd just send like kind of polite rants every once in a while like this. Where he said, we have to stop the slide into inconsequential chatter and paranoid speculation. There's work to be done. I know of no other group even one-tenth as prepared as we are to do this work. Let's get on with it. Tim May. Tim. Delayed self decrypting messages. Paul asked is there a way I can send out a file and perhaps a tool such that the file can be decrypted only after a given date. Now we call this time lock encryption. It barely exists now. It's still a very cool technology that I don't see used very much. But it's another part of cool cryptography that the cypherpunks were trying to think about and discuss, but they didn't quite have all of the cryptography we have now. So, fun to see all of the ideas that are now relevant. I've been showing a lot of highlights of the more chatty stuff, but the whole time there's also very technical conversations always happening. This person has optimized counting bits on a uniprocessor machine and has shared the three opcodes that you need for whichever systems those are. So the technical work did continue. I'm just not showing you lines of code in every single slide. Remailer chaining results. How Phinney sent an email in August 1994. I've done some calculations on the mixing properties of CHOM-style networks and gotten some interesting results, and then wrote, like, four pages straight of computations on, like, mixed nets and the privacy properties and trade-offs between different parameters. And then he ends his email with, now, how many people have read this far. Not me. I didn't even read it for this talk. Okay. Social punishment reputation systems. I think actually there's an interesting point in the first paragraph where it says the decentralized system makes it very difficult for someone to rejoin society to have his or her reformation recognized. The channels in traditional societies include good work and being a good citizen. The other is just starting a new identity. And the mixed proposal is a strong case for universal pseudonymity. Ban true names. Maybe a little aggressive. Which together with a strong voluntary reputation and social punishment systems can form the basis for the cyberspatial order. Kind of ambitious. I like the banning true names idea. Bruce Schneier is a famous cryptographer a lot of you might recognize. He wrote the book that a lot of the cypherpunks were studying at the time. He was also sending emails on how to help design cryptography systems, including on Faisal networks, S boxes, and block cipher design. Good S box design, not an easy task, and he outlines four different ways of choosing randomly, testing, man made, math made. They're all kind of teaching each other how cryptography works at the same time. I think this was nice because this was literally like his published paper. Academia used to be much easier to read back then, and I wish we would have more papers that are like this level of explanation, please. Cell phone security, Conrad Walton. I feel like this is just a very on brand of what you imagine like a cypherpunk anarchist email would sound like. As one who owns an AOR 1000 radio frequency scanner that can receive any and all cell phone conversations, I would have to say that you have no security unless you have some kind of voice encryption. Later on, I bought guns with high capacity magazines this year after they were banned also. I wish I had enough money to buy a good assault rifle before they're all overpriced. Parentheses, they'll never be gone, just overpriced. Conrad Walton. So, yeah, super on-brand. Timothy May is right. This is, there ends up being, like, more drama in the mailing list. Eric Hughes and Timothy May were kind of two of, like, the big founders originally. They're the ones, like, you see on the magazine cover of Wired. But basically, like, there's kind of a falling out. Eric Hughes is maybe embodying the dictatorial approach he claims to defy via cypherpunk philosophy, hypocritical and egomaniacal. And so even people who maybe started out as cypherpunks end up getting accused of, like, yeah, being dictators? So maybe it's hard to get along for a long time. Value of anonymity. It's easy to imagine the sort of panopticon which will soon arise in the internet and its descendants unless the strongest possible protections are adopted. And I thought this e-mail was funny because it's from Wadeye. And he's like talking about a new encryption system and says, I can try, but I've never done real crypto programming before. But if you know now, like, Wei Dai is a legend in cryptography. And so, like, even legends started out, you know, at simple things. Here's a list of attempts to ban encryption in 1997, 1981, 1984, 1986, 1987, 1989, 1990. In 1991, there's one I want to highlight. The FBI asked Senator Joe Biden to introduce a sense of Congress to recommend backdoors in all encryption telephone systems, and the provision was removed after public outcry. 1992, 1993, and the email sent in 1995. So it's like almost every single year they were introducing new proposals in Congress to ban cryptography or install backdoors. This was a real large threat at the time. And I think we haven't needed to worry about it too much recently, but hopefully this never seriously comes back. Crypto could be the next wave of IPOs. Timothy May, 1995. It seems that anything involving the internet, the web, and digital commerce is really, really hot. I thought this was fun just because we're talking about Fiat-Shemir. So I like the cryptography part. If you're into ZK still, this is not the same Z this is not the same paper, but still the same cryptographers on how to prove themselves. Crypto hardware summary. Douglas Barnes in 1995 pointed out that using coprocessors to achieve speed in cryptography operations is probably not justifiable for end users. It is almost always justified for servers with high volume. And then people, though, running cryptography-based transaction clients on their PCs are going to learn, one way or another, that having valuable secret keys on their hard disks is not a great idea. This, not speed, is the primary motivation for consumer-oriented cryptography hardware. Yeah, so they already thought of everything, like back in 1995. Cypherpunk FAQ, we're almost done. I downloaded the Cypherpunk FAQ from the Cypherpunk mailing list. When I decompressed it, all it contained were the words, Yoo-hoo, anybody home? Has the FAQ been corrupted, or is this an inside joke? Yeah, so apparently it was from L.Weiler. Yeah, it was a joke. And then this is the last e-mail that I'll share is someone invited the entire Cypherpunks mailing list to their birthday party, which is a great idea in the first place. And Julian Assange pointed out that if the party ends at 10 p.m., that's not a party, that's an after school Tupperware get together. Cool. So now you've seen the Cypherpunk emails, what you do with this information. Really whatever you want. I just wanted people to be informed on, like, sort of what it was like. And with that, we'll go to Q&A. So thank you. Ooh. Big applause for Porter. Yeah. For the Q&A, you know how it goes. You can scan that QR code and then register. We have some questions already. What are some ideas early cypherpunks had that have yet to be implemented or maybe are implemented but less popular than P2P cache or Tor? Yeah, so I think one thing is the cypherpunks were even more paranoid than we are now and they were very concerned about verifiable hardware and building hardware that you could actually know that the code is running correctly. I think that's one of the things. Besides that, there were just a bunch of the cryptography ideas that are now called time lock encryption and witness encryption and super advanced stuff that's not even quite here today. But yeah, it was cool. Alright, next questions. What are some yet-to-be mainstream Extropian prophecies? I'm not sure. I mean, they talk, there's just a lot of stuff in the emails. I don't know if I have any good prophecies that they were predicting. Most of their prophecies were that there's all the ways the Doomers who think everything's going to get banned and we're going to need to build BunkerCoin and this is our only hope is to build cryptography and surprisingly like governments have somewhat gotten on board probably a little more than they expected. Right then the top one it seems like people are very interested in those slides so how do can they get those slides? Yeah I'll post all of the slides afterwards also yeah the slides don't have like every email so maybe I'll include some extras. All right. And then I like that one on the bottom also. That was very interesting to see what these early people discussed. So where are these conversations... Where did that go? Yeah, here. Where are those good conversations happening nowadays? I mean, probably like crypto Twitter, like ETH research forums, like places like this conference actually. If you want to be discussing these topics, there are tons of people, probably literally right here, who are happy to talk about these with you. Okay, now we go to the bottom, the good questions. So what everybody wants to know, reading through all these emails, any guess who is Satoshi? So actually, I'm going to cop out, but I'm super against Satoshi guessing. I'm very adamant that we should just leave Satoshi as anonymous and not try and figure out who it is. There's probably text analysis you could start doing on his emails versus some of the Cypherpunk emails and things, but I'd rather not know.",
  "eventId": "devcon-7",
  "slot_start": 1731488400000,
  "slot_end": 1731489000000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/11gK41qto_r77F_waBaxEdW2JoYIgXHs4mVHzUzI_OaU",
  "resources_slides": null,
  "speakers": [
    "spencer-graham"
  ]
}