{
  "id": "txmonster-mud-day-demo",
  "sourceId": "3GSMUH",
  "title": "TxMonster - MUD Day Demo",
  "description": "This is a project demo as part of the MUD Day CLS: autonomous worlds, onchain games, and non-financial applications\r\n\r\nUsing MUD Dev to build \"Eat Sleep & Survive\" TxMonster on RedStone Chain",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [
    "N/A"
  ],
  "duration": 288,
  "language": "en",
  "sources_swarmHash": "d78526fb87c5a752ac399b532bc16e395f7ee7caf593f8ae3c03e5b78e07e201",
  "sources_youtubeId": "P3x5UV39CCA",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673587ef9dbb7a90e1311702",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673587ef9dbb7a90e1311702.vtt",
  "transcript_text": " What are you doing? You guys find here it's like Pokemon Go here? Okay, so this is a chance for us to play the game similar to Pokemon Go. Capture mantras on the text studio and then with the mat app. So, can I have a clicker? Where is it? No, here. Okay. Just a little bit. So I need a clicker here. So that's to be great today so I can show up in here and talk with you guys like a transfer to share the game. And how grateful is the MUD team and the Lattice and the rest of the supporters to build the game. Thanks again. So, please, I need a clicker like you. Okay. So we can do it. Okay, so you can just skip into the next slide. This is the game loop. So the next one. The next one. Okay. The text monitor is like the monster capturing. So that is the 3D web browser and we're doing with the Unity. So we are coming from the web tools like studio games. So we want to bring like the gaming experience inspired into the web free and the fully on chain games blockchain. So uh this one we bring like the whole new diversity like monster system so we can try to use and discovery with the like the sandbox and open world. Uh please next slide. Okay the game look will be very like simple. We see in here we build the characters, we explore the world, we just like taming the monster and then we like taking battle work and we gain access and then we can like build the character again. That's very simple game look so we're just following it. Okay, next one. Okay, we have like a lot of features in ecosystem but the most important thing here I want to emphasize is the FOMC mechanism. The first thing is like we talk about the game files, it's the ownership of the assets. But talking about the fully on-chain game, we need like all the logic on-chain. And lastly, and most important, is decentralized world bringing contribution with the community. Okay, please for the next one. Okay that is the gaming NFT contributing because we need to make sure that the people and the user need to play the game by the game itself not only about the finance thing. So we have it here the NFT the monster activities cosmetic and all of the things the user needs to contribute by the finance or by gaming experience, by goal for the game itself. Okay. And of course, uh, blockchain people own value not only for the game and also for like finance thing so we also have the further value. So looking for it and we need the next one. OK, this is our emphasize things that you see in the future. We have the user-generated content. It means, for example, we have our own project with access. And then the community, they can create their own access, make this one, and then put it into the game. But in extra, you can own your sub-client. And you just use access, and then you can bring the sub contract into the game. But in Extra, you can own your sub-client. And you just like use access and then you can bring the sub-contract into the game. And then you also have like all other features in the game and go along with us. But most and important thing is like if you have the better team and you can build the client with our access, you can do that. So the UDC is the most important thing when you play the game. If you, anyone in here plays Steam community, you have",
  "eventId": "devcon-7",
  "slot_start": 1731558000000,
  "slot_end": 1731558300000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/10U4OcgkMv_HGXoZzHe-sIP9e08AcMp-G142YBiu1DUM",
  "resources_slides": "",
  "speakers": [
    "buidltxgames"
  ]
}