{
  "id": "ultimate-dominion-mud-day-demo",
  "sourceId": "GPQVMW",
  "title": "Ultimate Dominion - MUD Day Demo",
  "description": "This is a project demo as part of the MUD Day CLS: autonomous worlds, onchain games, and non-financial applications.\r\n\r\nUltimate Dominion is a fully onchain text-based RPG. Explore the world, defeat monsters, collect, buy, and sell items.",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Gaming",
    "Autonomous World",
    "Autonomous World",
    "Gaming"
  ],
  "keywords": [],
  "duration": 329,
  "language": "en",
  "sources_swarmHash": "342168451b143f531922ea9d08f6e99c010b5fe7b227fa112be1f90f564d43c0",
  "sources_youtubeId": "yILE0MO7B2M",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735907b9dbb7a90e1cac2fd",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735907b9dbb7a90e1cac2fd.vtt",
  "transcript_text": " Ritz Raspba Reviewer 1 Hello everybody, my name is Ritz Raspba. This is my first time at DevCon 19, and I'm really excited to show you what me and my team have worked up for you guys. We've been working on this game called Ultimate Dominion for the past six months. It's a fully on-chain text-based MMORPG. Now, I've been growing up a real fan of Skyrim, those types of games, and that really inspired my art going into this. I've been drawing knights and dragons since I was a kid, and I'm glad I'm able to have the same assets as the things I've been drawing and growing up with. Narrative is a really big part in this. I mean, I feel a lot of games in the last decade just haven't been, haven't really been focusing on that world building, haven't had a world that felt like we should fight for and narrative that we would want to push forward. A lot of games focus on building a game that feels like it's going to outlive the players, but we want to work on a game that feels like it's lived for and has had a history long before they've arrived. Now heading into that game, this is what we have. My character name is going to be Mr. Slay's lot. This is beta and I'm going to be doing this live for you guys. That's my profile picture. Deal with it. Moving forward, I'm going to be rolling my stats next. The stats determine what you're good at and what you're bad at. If you have high HP, then you're harder to kill. Higher strength means you swing your sword heavier. Agility, you're faster and better at running away from me. And intelligence gives you access to the strongest magic in the game. Let me actually roll my stats a little bit. Rolling into here, this world is going to be in a 10 by 10 grid. You're going to be moving about it more. Think of it like you're moving a piece in a chess board. Loading into it here, you're going to see to the right here, we're going to have several points of interest and a yellow border. This yellow border is going to be the player, the safe area. Your character is depicted as a dragon icon. And as you see as I move through here, the middle screen is going to be updating with whatever, with the players and the monsters that are currently there. This getting into the combat here. I'm going to be going up against a kobold scout. Oh. Apologies. So the items in this game are the main way that you're going to pack things and dealing damage. These individual items, as I equip them, and even these low-level items, they don't do a lot. They're mostly numbers and have small effects. However, when you couple them up with... when you have multiplayer and multiple people using several attacks, like think of a rogue with a smoke bomb and then your wizard casts Fireball and lights up the smoke bomb and does extra damage. We want to incentivize players and empower them to have cool interactions like that that we really can't anticipate. This sort of story building is really the... It's what we want to push. Here we have the chance to do some really lovely cooperative storytelling. We as developers want to empower players to have a narrative to push forward and to attack with. And that's the main dream. Right now with this beta, we're focusing on this main loop where you attack monsters, get their items, and sell them. And with that comes, well, that progression. But this is the meat and bones of the game. All this narrative stuff that we want to do, all this ambition, this crazy world that we want to build is great, but we want to have a good game that goes with it. I mean, I think it's really important. Getting into it, now I'm going to be getting into the combat here. Going up against a... There we go, I apologize for that. Getting into the combat shortly here, you're going to see that as I get into it, we're going to have these actionable items here are what I have to attack with. As I was saying, when you mix and match with multiplayer, you have a lot of combination and a lot of things that you can do. But ultimately, this is the game. If you want to support it and you want to see it live through, you can join the demo with the code we're going to have back here. And I can't wait to see you there, guys. My name is Ritz Rospa, and this was Ultimate Dominion. Thank you. Thank you, Ritz.",
  "eventId": "devcon-7",
  "slot_start": 1731558300000,
  "slot_end": 1731558600000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/13Uil3sm_cj9Qi6g5Yd7Wn1eUVWbT6tRsAAUDqNmNTmU",
  "resources_slides": "",
  "speakers": [
    "ritz-raspa"
  ]
}