{
  "id": "verifiable-open-source-vaccines-to-save-millions-of-lives-from-the-developing-world-up",
  "sourceId": "S7LEHK",
  "title": "Verifiable Open Source Vaccines to Save Millions of Lives from the Developing World Up",
  "description": "Viruses & bacteria like HCV, Strep A, and TB cumulatively take millions of lives each year – effective vaccines against them would considerably reduce that death toll. Unfortunately, big pharma isn’t interested in investing in developing these vaccines, and even if they did exist, rising vaccine hesitancy may prevent many from benefitting. PopVax is pioneering a new model of developing first-in-the-world verifiable vaccines at dramatically lower cost in India with radically greater transparency.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "DeSci",
    "Effective Altruism",
    "Public good"
  ],
  "keywords": [
    "vaccines",
    "biotech",
    "public health"
  ],
  "duration": 1022,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "c4upJlvW_fE",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735ba4a9dbb7a90e18ca9f7",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735ba4a9dbb7a90e18ca9f7.vtt",
  "transcript_text": " Hey folks, I'm Soham Sankaran, I'm the founder of a company called Popfax, which works on verifiable open source vaccines, intended to save millions of lives from the developing world up. And I'll explain what all of that means. First, let me say something that I think has unfortunately become controversial of recent times. Vaccines are one of the most effective public health interventions known to man. Over the last 50 years, they're estimated, and this is just childhood vaccines, are estimated to have saved over 150 million lives across key pathogens that attack younger children and adolescents. And when you add adult vaccinations, they're likely tens of millions more. But there are pathogens, important pathogens that are quite prevalent for which there are no existing vaccines. These include tuberculosis, strep A, and HCV in particular. So just these three pathogens, and here I'm talking about tuberculosis in adults, not tuberculosis in children, kill over 1.8 million people per year across the world, and there are no effective vaccines for them today. Unfortunately, instead of speeding up, vaccine development is slowing down. It took the malaria vaccine, which is one of the more recent infectious disease vaccines to be licensed, 35 years to go from concept to licensure. And these programs now routinely cost $1 billion plus, which is a very large amount of money to invest in a single drug. And then because they're only dosed, let's say, between one and three times usually, unlike GLP-1 agonists like Ozempic, which are dosed considerably more frequently, pharma companies do not see them as a particularly high return on investment. And so they have pulled back, especially in the post-COVID era, from investing in new infectious disease vaccine programs, in particular for pathogens like TB, which they see as being only relevant in developing countries which are poorer. But there's a potential solution here. So this is a sort of graphic of the top 10 vaccine manufacturers in the world by volume in 2021 during COVID, but excluding the COVID-19 vaccines. And what you can see here is that Indian vaccine manufacturers, including the Serum Institute of India, are very substantial in their presence. They account for almost 40% of the volume of vaccine doses shipped globally. And so why don't we V-ACK, so to speak? Why don't we accelerate vaccine development by relying on this capacity that we have in India and other developing countries? And also the fact that you know you can do things cheaper in countries like India, right? We can do this, we think, 10x faster and 10x cheaper. And you might ask why aren't people doing this already? There are already these big vaccine companies in India. Surely they must be thinking on these lines. Unfortunately, India as a country spends almost nothing on research and development. It is a joke how little we spend on R&D across government and across private industry. And Indian companies, including vaccine companies, are not particularly interested in taking technical risks, such as developing new vaccines for pathogens where vaccines have been hard to develop. And so PopFax is trying to solve this problem. We are trying to solve long-standing problems in vaccine design, including the three pathogens that I mentioned, where people have made attempts but no success. Using mRNA and computational protein design, tools that have just reached the point where we can actually use them to make novel vaccines that couldn't have been made before. As I'm sure many of you are aware, Demis Hassabis, John Jumper, and David Baker just won the Nobel Prize in Chemistry recently for their work in protein structure prediction and protein design. And so these tools are just now reaching the maturity where we can actually use them productively. And we want to leverage, as I said, the talent, cost, and speed advantages of operating in India, which is to say we are the only company or one of the only companies doing this kind of novel vaccine development in India, and so the best talent in the country, folks who want to work on these world-changing problems but don't have the opportunity, essentially come to us. Unfortunately, no one wanted to fund PopFacts. When I started this three years ago, VCs and non-profits essentially didn't believe that the talent pool existed in India to do this. The Gates Foundation gave us an early 100K check, but that was not enough to build a vaccine platform or take anything to clinic. As I said, these vaccine programs, they routinely cost a billion dollars. Even if you can do it for 10x cheaper, that's still hundreds of millions of dollars, right? And we had some good early data about, you know, two and a half years ago, but it had rendered both me and the company bankrupt. Then there was a massive pump in Shiba Inu coin, which I'm given to understand is a meme coin of a meme coin. And Vitalik founded the biosecurity and public health organization, Balvi, and one of their investments was us. And so they've now funded us a cumulative $15-plus million. And I think it's interesting that it took Vitalik, somebody who is outside of the sort of general hierarchy of public health funding, to see what I think is obvious, which is that the talent is there. It was really a resource constraint that meant that folks in India had not had the opportunity to go after these problems. So let me talk a bit about what we've actually done with that money and what that means for the future. So this is extremely dense, and I apologize in advance, but I'll explain what's going on here. That green thing that you see there is the receptor binding domain or RBD of the SARS-CoV-2 virus. It is the immunodominant antigen of SARS-CoV-2. Antibodies against that particular protein are the key drivers of neutralization and protection in the COVID vaccines. So it's a subset of the spike protein that I'm sure all of you have heard of. It's not the entire spike, it's just a part of it, right? What we've done is we've pioneered an approach where within mRNA, we can encode a self-assembling virus-like particle, which is what is in the blue, that basically displays a whole bunch of copies of this RBD protein. And in doing so, we've achieved two things. One is we've achieved considerably more potency. So what that, if you look at our sort of highlighted, you know, bolded bar here, two micrograms of our RBD-VLP display mRNA, which uses this approach, provides 22x greater neutralizing antibody response, which correlates quite highly with protection, compared with two micrograms of the full spike mRNA sequence from one of the U.S. approved COVID vaccines. And this is all in mice. And what's particularly interesting about this is, you know, we can use it to make a vaccine that's more potent. We can also use it to make a vaccine that's potentially safer. Because we can achieve with 95% less dose, as you can see at the top, with just 0.1 micrograms, we can achieve the same result as you would without using our strategy with two micrograms. And so I can inject much less mRNA, much less lipid nanoparticle, and have potentially a much safer product overall. And the kinds of things that Philip was talking about, you know, all get worse as you increase the dose of whatever your vaccine product or drug product is. The other interesting thing that we got here is breadth. So if you think about COVID-19 and why the vaccines were less effective as we got later into the pandemic, the reason isn't that they didn't have a durable response. The reason is that the pathogen evolved. Variants of the pathogen that were no longer susceptible to the antibodies elicited by the original vaccines became prevalent. And as a result of that, we ended up with a situation where what were very effective vaccines at even preventing transmission became relatively ineffective as new variants evolved. However, using this mRNA-encoded VLP strategy, what we've been able to do actually is elicit antibodies that neutralize a whole breadth of variants. So our construct is the red line, which is able to potently neutralize, you know, even as it's diluted, a whole bunch of these other variants, wild type, gamma, lambda, Omicron, BA1, whereas the US approved COVID vaccines, the original ones in blue, are not able to neutralize those other variants. So this approach, which we are, you know, among the first to pioneer in mRNA and protein design, has potential substantial gains for COVID and for other pathogens like influenza. Now, let me talk a little bit more broadly about what strategies like this are actually trying to do, right? If you think about any pathogen, you know, it has a whole bunch of antigens, which are, in the case of a virus, those are going to be proteins that elicit certain kinds of immune responses, certain types of antibodies, right? And then some of those antibodies are going to be functional. You know, they might sort of neutralize the pathogen, right? Some of the antibodies are going to be non-functional. They might bind but not neutralize or not bind at all, right? And then within the context of these functional antibodies, there's some subset of antibodies that you might consider broadly functional. And what that means is even as the pathogen evolves, even as there are additional variants that come up, those antibodies, which are some subset of the original antibodies, remain effective. So the intention of our vaccine design approach is basically to move the distribution of antibodies listed, whether it's in an animal or a human, towards these broadly functional antibodies, which have a chance of providing durable protection against even new variants that might emerge. And this is relevant in the context of COVID for this variant evolution story. In the case of some of the other pathogens that I mentioned, for example, HCV, it is absolutely essential. Because HCV as a pathogen like HIV evolves within its own host. And so, you know, if you were to be infected with HCV, you might have thousands of different variants of the HCV pathogen within your own body. And so, an antibody response that is effective against just one of them is not going to be effective at clearing the pathogen. So, we've used this, you know, we've used a variant of what's called an epitope scaffolding approach to basically attempt to elicit specific types of antibodies that provide this kind of broad functionality and broad protection. And what we've been able to do in just three years is to run these processes of designing and testing in animals these novel immunogens, which can elicit these antibodies, much faster than anybody typically does in vaccine R&D programs. Again, as I said, leveraging the fact that we can do this research much more cheaply and much more quickly in India. And what we found is mRNA in particular gives us an advantage here. mRNA is, of course, not the actual immunogen. What you're injecting in mRNA is almost code that encodes a specific design of immunogen that's intended to elicit some antibody response. And so because we're using mRNA, which is a standardized process, we can test thousands of different immunogens and then when we alight upon one that that actually gives us the response we want, we can translate it not just into a sort of lab environment but into an actual GMP manufacturing environment. Apologies. We can translate not just new a lab environment but into an actual clinical environment, into a clinical study very quickly, which is not something that you can do with conventional vaccines as easily, which is why you get these extremely long timelines, right? And so what we know so far is basically this VAC approach in India, it works, right? We've been able to do this at 20x cheaper than you would usually spend on a preclinical vaccine program to build a new platform and get to phase one. We've 10x the testing throughput of a normal vaccine program. We've tested, you know, thousands and thousands of novel LNP formulations of novel designed immunogens, which are basically vaccine designs. We've tested them know thousands and thousands of novel LNP formulations of novel designed immunogens which are basically vaccine designs we've tested them in vitro but we've also tested them in vivo 500 plus and we've been able to achieve the results you saw in the beginning which is that our vaccine appears to be much much better than the existing COVID-19 vaccines so what that means is I can take 10x the number of shots on goal for the same amount of funding as a company in Boston or San Francisco and potentially save 10x the number of shots on goal for the same amount of funding as a company in Boston or San Francisco and potentially save 10x the number of lives in the long run. Right? If somebody gives me $300 million, a company in Boston, and this is all based on a real comparison with a biotech company that's developing vaccines and doing quite well doing so, they might take one candidate through a phase one clinical trial and be getting ready for a phase two clinical trial and be getting ready for a phase two clinical trial with a new platform. For us, we've been able to build a new platform and with that amount of money, with $300 million, we would be able to take 10 new candidates to phase one and two and potentially bring multiple products to licensure. And again, in the long run, that saves a lot of lives, right? Because every year we wait to develop these vaccines, millions of people are dying. Another key piece of this is that we've built our own GMP manufacturing facility. So what that means is we have the ability within our own facility to make clinical doses in a way that's safe to inject in humans, such that we can very quickly take these new candidates and advance them to clinical studies. And here I'll reference what Philip was talking about a little bit, right? I think it's critical to ensure that we build a process that is not only, you know, safe by the standards of existing regulatory norms, but is legible enough and is understandable by the general public that they trust what comes out of our work, right? And so the good news here is, and in fact, I'm announcing this today, we just announced it via press release this morning, is that NIAID, which is part of the US National Institutes of Health, has selected our next generation COVID-19 vaccine as part of the US government's project NextGen for a phase one trial, which will happen in the US early next year, which to my knowledge is one of the first clinical trials of an Indian design vaccine in the U.S. In fact, no Indian vaccine or Indian design vaccine has ever been approved in the U.S. No Indian company's vaccine has ever been approved in the U.S. And our intention is to have our vaccines available all over the world, right, not just in rich countries, not just in poor countries, but to everybody. And so this is very exciting news, because I think what this means is our approach, which, as I said up top, is an approach that at the beginning, nobody supported, right? Nobody believed that we had the talent in India to do this. Nobody was certain, you know, or people, in fact, were quite certain that we wouldn't be able to do this, right? And it took an early bet from Gates and a substantial bet from Vitalik and his team this has now been essentially co-signed by one of the most credible organizations in public health, right? So NIAID thinks that this vaccine works very well, at least pre-clinically, and they think it's worth evaluating in humans. The COVID vaccines have, you know, have been somewhat maligned, but best estimates suggest they saved tens of millions of lives. We can quibble about specific numbers, but it's likely a very large number. But again, as Philip was talking about, there's been a lot of questions about whether the process followed in approving these vaccines were processes that are appropriate for human health. And at the same time, on the other side of the coin, the reality is that a lot of people who wanted these vaccines in developing countries didn't get them, because Pfizer and Moderna were not that interested in selling their vaccines at knockdown prices in developing countries didn't get them because Pfizer and Moderna were not that interested in selling their vaccines at knockdown prices in poor countries, right? And so what we've done is we've worked with Balvi to come up with a model where we will be open sourcing our COVID-19 vaccine. We will not be enforcing our intellectual property on that vaccine for a number of years. And what we'll be allowing people to do is to verify not just the R&D processes that led to that vaccine, but also the manufacturing processes. So that manufacturers across the rest of the world can not only make copies of this vaccine themselves, they can distribute at low cost, but also that people can understand whether the processes that we've used in developing and manufacturing this vaccine are compatible with what we say out in public and are safe for them, right? They can have independent scientists evaluate these processes in a way that existing vaccine companies don't make enough information available to do. And that's something that we can do because we are comfortable releasing far more information than anybody has ever done for a vaccine development or manufacturing program before. Let me just briefly talk about what we call the Popvax Million Lives Mission. As I said, there are these three pathogens that collectively kill 1.8 million plus people per year. We want to develop effective vaccines against all three of them that we think can save over a million lives per year. We want to do this using a new sustainable model for funding for public health vaccines, similar to what we've done with Vitalik and his team, where, you know, we will provide full details needed for vaccine verification, R&D improvement, and manufacturing openly. We'll cap profits in developing countries and allow for open licensing on transparent terms of this intellectual property, and we will have uncapped profits in rich countries. And this is a model that we want to advance, that we think could be the future of sustainable vaccine development. Yeah, I'm happy to take your questions outside. And please feel free to email me if you're interested in working with us, funding us, or collaborating with us. Thank you so much. Thank you so much. That was great.",
  "eventId": "devcon-7",
  "slot_start": 1731572400000,
  "slot_end": 1731573300000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1sK71lOtl_9Q8SbWOBVtDNhLVBhc--pIc-AxaYE2toIM",
  "resources_slides": null,
  "speakers": [
    "soham-sankaran"
  ]
}