{
  "id": "viruses-and-chronic-aging-building-a-research-community",
  "sourceId": "FX8UQF",
  "title": "Viruses and Chronic Aging: Building a Research Community",
  "description": "Did you know that mitochondrial dysfunction, inflammation, and cognitive decline are directly accelerated by viruses? In fact, the viruses that infect us over a lifetime are technically not even alive, and therefore must “hack” our human cellular metabolism machinery to do anything at all. This talk will overview the first-ever global collaborative network studying & treating chronic viruses as drivers of aging, including how certain lifespan-promoting drugs may help combat viral activity.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 996,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735bc959dbb7a90e1a2fe20",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735bc959dbb7a90e1a2fe20.vtt",
  "transcript_text": " Hi, I'm Amy Prowal. I'm the President and Research Director of PolyBioResearch Foundation, and today I'm truly excited to talk to you about viruses and chronic aging, building a research community. So where am I going with this? First, what I want to talk about is viruses as drivers of aging processes. This is really not discussed as understood as it should be. And there's so many compelling examples of how viruses can contribute to chronic aging processes. This is really important for the longevity community and for people who are just dealing with many forms of chronic disease. If we understand these interactions, we can better figure out how to combat them and how to best create strategies to mitigate viral effects on aging. So let me give you some examples of viruses and how they contribute to aging processes. So there's definitely many drivers of human aging, but here are some of the three main factors. Mitochondrial dysfunction, these are the just energy powerhouses of our cells, and they become dysfunctional as we age, often. Inflammating, which is basically just the fact that over time, as people get older, tend to have more chronic inflammation, more immune cells that are just activated in an unproductive way. That's called inflammation. And cognitive decline, obviously. People who are getting older and aging have memory problems. They have brain, you know, dementia, even post-Alzheimer's type phenomenon even sometimes. So one thing to understand is that as we age, and in fact, as we are born and across the scopes of our lives, we inherit viruses from our parents, chronic viruses sometimes. They're passed, in some cases, in the womb. Plus, we also, over the course of our lives, and this happens with exposures with other people, it happens from our environment, and sometimes the foods and other things that we consume, we accumulate different viruses, and they become part of what is known as our human virome, the viruses in us. And there are many viruses that become a burden in our systems as we just live. These are the herpes viruses, the papillomaviruses, and increasingly a growing number of RNA viruses are also understood to be persistent viruses that are with us for life. Now, what does this virome then do to aging? Well, consider just some of these virome components. This is, you know, sometimes when people are, let's say, in college, they get mono. And people understand that people get sick, they get a sore throat, they don't feel well, they're feverish, they try to avoid people for a while. What really means when you get mono is that you get the Epstein-Barr virus. It's a herpes virus. And that virus stays with you. Again, this is a persistent virus. Once you have it, it does not clear your system. It stays with you for the rest of your life. This is the thing. If someone's immune system is robust, if it's in a good shape, if it's active, what the immune system does technically is keep these chronic viruses like the Epstein-Barr virus, if you get it, and over 90% of people in the world, by the way, harbor Epstein-Barr virus, keeps these viruses in check. It keeps them in a dormant form. The immune system keeps them in a latent form. And that way they technically cannot activate and create more proteins or things that can actually drive disease or potentially aging processes. Now, however, if viruses do become active, if they are moving out of a state of dormancy because something happens to the immune system, and this could be many things, it could be another infection, it could be just exposure to pollutants, to chemicals, to many things that wear down our immune systems over time, viruses can become more active. And one of the things that viruses do when they activate is that they affect our mitochondria directly. In fact, this is one of the key things to understand about viruses, our health and aging, is that viruses are actually obligate intracellular pathogens. And what that means is by definition, they are not even alive. They must, in order to replicate and create new versions of their cells, they must pull the substrates, the backbones to do that, to create new versions of themselves from our human cells, from our mitochondria. So they do this. Every single virus hijacks our mitochondria in order to create new versions of itself and do basically anything that it does. This is a paper that I wrote about this phenomenon with my colleague, neuroscientist at Polybio, Mike Van Elzucker, who also is a neuroscientist at Harvard, we wrote about how pathogens, bacteria, viral, fungal, parasite pathogens even, hijack the metabolism or the mitochondria of the host cells they infect to just gain those basic substrates again to just create new versions of themselves. This is core to what they do. This is a diagram from our paper. This is basically a human mitochondria in the diagram. At the intermediate of that paper, of the figure, you can see the TCA cycle. That's a very important part of just gaining substrates for our own energy metabolism so that we can function, burn glucose, burn other fuels that allow our mitochondria to make us energy producers in a good way. The blue boxes contain different human viruses that are part or can be part of the human viral persistent chronic viruses. And those are just the different parts of metabolic pathways that they hack or hijack as part of their ability to just create new versions of themselves or replicate. Okay, so I mentioned before that inflammation, just chronic inflammation often accelerating over time is also strongly associated with human aging and issues with longevity, for example, in this paper. Now, what inflammation often results from is the activation of immune cells, including cytokines, which become active, and one of the questions is why, but we certainly know that especially cytokine immune which become active. And one of the questions is why, but we certainly know that especially cytokine amine cells become active. Now, IL-11 is an example of a cytokine. So it's an inflammatory molecule in the human body that can become more active when things become inflamed. Now, this doesn't seem too surprising then. In this paper, this team showed that inhibiting this inflammatory molecule, the cytokine IL-11, extended mammalian healthspan and lifespan, suggesting that inhibition of some forms of inflammation is helpful in that regard. Now, what though, in the first place, was causing that cytokine IL-11 or interleukin-11 to be active, to be more active than it should be. Well, one of the biggest driving factors, again, that so many viruses and other bacteria or pathogens or parasites do is they activate immune cells as part of their persistence. What happens is the immune system recognizes them, tries to target them or to keep them in check, and in the process becomes more active, more perpetually active. So here is a study showing that that cytokine IL-11 or interleukin-11 is actually stimulated both in animals and in the lab by viruses including respiratory viruses. So these are drivers of inflammation. Most pathogens can be direct drivers of inflammation. Okay now we just have the ability, the viruses and bacteria, but I'm going to focus on viruses here, can basically just hack the signaling pathways that are the heart of our longevity health networks. For example, there are pathways in the human body that control processes associated with cellular senescence. For example, that's the ability of a cell to correctly divide, to correctly grow, not overdo that, not sort of underdo that process, but to do it robustly. There are networks in the human body that scientists have calculated as mattering in terms of human signaling associated with longevity. Well, this team did a network-based analysis, and they uncovered dozens of viruses that encode proteins experimentally demonstrated to interact with proteins associated with these human aging networks, including senescence. So just dozens of viruses and thousands of interactions between these viral proteins to the point where they ended up calling dozens of viruses in the study that they identified age distorters because of the study that they identified age disorders because of the fact that their proteins could have such detrimental or modulatory effects on these aging networks. In other words, their reproduction and their ability to replicate benefits directly from interference with their host's aging processes. And here on this chart are just some of the top viruses that were basically shown to have proteins that interfered with human cellular senescence pathways. There are the herpes viruses, which most of us acquire over the course of our lives, the papillomaviruses. Interestingly, influenza A virus was one of the top drivers of aging. And we never even think about the flu type viruses, which is influenza in an aging capacity, but we probably should a little bit more. So with that in mind, then, this is a final takeaway from that paper. This is what the team concluded. Owing to the considerable number of human viruses, this evolutionary-minded view encourages a reconceptualization of the locus of aging, no longer exclusively focused on our own genetic material, but expanded towards a larger set of genetic entities interacting with our species, such as viruses. So boom, the heart of aging. All right, now what about cognitive decline? What about just direct mechanisms by which viruses or other pathogens can drive cognitive decline? Here is one. This is the team that we work with at Harvard Medical School. They're really cool. They've been using models of a brain in a dish where they actually recreate the neuron structures of a brain in a model or just experiments in mice to show that the Alzheimer's plaque, the amyloid beta plaque that is the plaque that forms in the brains of patients with Alzheimer's disease that defines the disease, actually acts as an antimicrobial peptide or part of the immune response that forms in response to pathogens directly in order to combat them. So basically what happens is there's a virus that gets into the brain tissue model, and then the plaque forms around it as part of the response to the virus. That's what they were showing in this study in response to the herpes viruses. But this team has also shown the same phenomenon with bacterial pathogens and with fungal pathogens. This places infection at the heart of the driving of amyloid plaque in the Alzheimer's brain. Here's another example of a team who's working on the same phenomenon. Van Riesheids' group at Arizona State University. This is an image of cytomegalovirus, which is another herpes virus that many of us just carry with us for life. It's look in the image here, it's concentrated in the microglial immune cells of the brain around the plaques of these cells along with the axons and dendrites of neurons, again, that are inflamed and directly part of the Alzheimer's disease process. So there are a growing number of teams connecting viruses directly to neurodegeneration. Now, this is an interesting study. Okay, what do we do? Well, there's some really low-hanging fruit. No one's even doing anything about this. And this is an example of just easy measures we could take to control the impact of viruses on aging if we made it a priority. This is a team in Taiwan. And what they did is they tracked people over time, some of whom were given just affordable herpes virus existing generic medications. So for example, let's say someone gets genital herpes, they're given Valchex. It's just an over-the-counter herpes, anti-herpes virus drug. So some of the people in the study were given more of those anti-herpes virus drugs and some weren't. When they looked at the group that was given these anti-herpetic medications, they had a much lower risk of dementia than the people who didn't. In fact, up to a 10 times lower risk of dementia. So really, it's extremely low hanging fruit to maybe start to use some of the drugs that we have to inhibit viral activity in the context of human aging. Now, what about in COVID, long COVID? Now, I know we're all a little burned out on COVID, but really, part of what our group does is study still the chronic consequences of SARS-CoV-2. We have to. It's because it's one more virus that is one of these players that can contribute to chronic disease and unfortunately aging processes. And you'll hear about long COVID and it sounds like a vague phenomenon when you hear about it in the news often. Really, it's not though. A lot of us that are directly studying long COVID realize that the persistence of the SARS-CoV-2 virus in tissue in the human body over time, in other words, SARS-CoV-2 potentially becoming just another member of the human virome, is happening in at least a decent number of people with long COVID. And here's a paper that a group of us of long COVID researchers wrote about SARS-CoV-2 persistence as a driver of post-COVID symptoms. Here's an example of a team that we work with. This is in the bottom right, gut tissue from the lining of the gut collected from someone almost in one case over two years after they got COVID. And in this case, the person did have symptoms. They had chronic symptoms. But still, what you're seeing there in the purple, that pink part is the SARS-CoV-2 virus still there in the gut tissue after over two years, sort of embedded there with immune cells around it, clustered, preventing it potentially from being cleared. So it's there in a persistent capacity, which means that at least in some people, SARS-CoV-2 may be acting or seems to be acting as a persistent virus that can also contribute to chronic disease and aging processes. In fact, this is a table from one of our papers that just, this is just some, there's some other studies that have shown persistent SARS-CoV-2 up to then over two years or more after initial infection in at least a subset of people. Okay, so then what do we do about this? Well, one of the drugs we're actually looking about in the long COVID world is called CORE, which is treating people with conditions initiated or exacerbated by infection, is we're actually running a trial of rapamycin in patients with long COVID. Rapamycin is an mTOR inhibitor that has, you know, different properties on the immune system. Now, one of the things that's really interesting about rapamycin is that in some studies, at least rapalogs or analogs of rapamycin, drugs similar to it, have been shown to, in a low once a week dose, not in a high dose, in a lower dose, to enhance parts of the immune response that can better control viral infection. So for example, that trial that I showed you gave patients two rapalogs over the course of six weeks, and a couple couple things happened. First, they showed the people taking rapamycin an increase in interferon-induced antiviral gene expression, with interferons being one of the primary molecules or parts of the human response that combats viruses and keeps them down. Also, the people in the rapamycin group, everyone in the trial was given the influenza vaccine, but those who took rapamycin group, everyone in the trial was given the influenza vaccine, but those who took rapamycin had a more robust response to the vaccine. In other words, their immune system seemed to activate more and create more antibodies in response to that vaccine. Also, the participants on rapamycin, even though they just took the drugs for six weeks, reported a lower rate of infection for a full year after being on the rapamycin. This includes respiratory infections, UTIs, though, multiple types of infections, suggesting, again, that rapamycin was helping to control viral activity. And in a related study, the team found that rapamycin in some patients improved T-cell exhaustion. And again, when viruses persist, they tend to knock down T-cell cells and their activity, which are parts of our immune system, making them literally exhausted. And rapamycin was shown to potentially improve that. Again, so rapamycin, we're trialing now to see if it might help patients who have persistent SARS-CoV-2 or other virus problems in long COVID better control those infections. And what this means is there's a you know, a use of rapamycin in terms of potential viral control that is also probably relevant to human aging.",
  "eventId": "devcon-7",
  "slot_start": 1731573300000,
  "slot_end": 1731574200000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/17eofu9OtkjONNHPpAdEmPg8MIz7E8ahPAxLdRwJsfNY",
  "resources_slides": null,
  "speakers": [
    "amy-proal"
  ]
}