{
  "id": "visions-of-a-viable-dacc-biosafety-strategy",
  "sourceId": "7VDGQM",
  "title": "Visions of a Viable d/acc Biosafety Strategy",
  "description": "A one-day summit focusing on the theme of d/acc: emphasizing the values of decentralization, democracy, differential accelerated progress, and defensive tech including crypto security, public epistemics, bio defense,  neurotech/longevity, decentralized ai and physical resilience.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [],
  "duration": 610,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "oOsKEwKD-jE",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735ab179dbb7a90e1a340ab",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735ab179dbb7a90e1a340ab.vtt",
  "transcript_text": " Okay, so welcome to DEAC Biodefense. So I think I'll start off by just briefly recapping how the hell I even got here. Because basically, I started off being the Ethereum guy, and I'm historically not a bio person and more of a math and computer and economics person. I was definitely interested in longevity almost since the beginning. I read Aubrey de Grey's book, Ending Aging, back when I was 13, and that just really impressed me, both the sheer importance of solving aging, but also the fact that there is a roadmap to actually get us there. And so I was excited about longevity the whole time ever since. But then for DEAC Biodefense in particular, in 2021, there was this big meme coin mania that I'm sure you guys all remember. So first in 2016, there was Dogecoin, and Dogecoin went up really high. And then during the 2020-21 bubble, a bunch of people basically started like copycatting Dogecoin and making their own dog-themed coins and hoping that they'll go up to. And so some of these people decided as a strategy that they would put a large portion of their supply into my wallet balance and then publicly say Vitalik Buterin supports this coin, even though I never touched it. And some of these coins just like went up way higher than they should. And so one of those big coins was called Chiba Inu. There were also others. And I sold a bunch of them. And I donated some to a couple of organizations, one of which is Crypto Relief India. So at the time in India, there was this big COVID crisis that was happening. Lots of people were getting sick. It looked very bad from outside. It looked like no one was really caring about the situation, so I came in and donated to this group that originally Baljie introduced me to. First I donated a little bit, and I donated a amount of Shiba tokens that I thought would be worth a few million dollars at most, but then they ended up managing to cash out like literally $470 million dollars and so after that we yeah so 470 million ended up being like more than crypto and relief india needs for its whole roadmap and i was also started researching and understanding COVID and pandemic-related topics more heavily. And Balvi, between myself and some of my science advisors, basically slowly formed and ended up spending a significant chunk of that meme coin funding on basically moonshot topics that deal with all kinds of anti-pandemic related efforts in general. So biodefense is important, right? So compared to the natural environment, population density is way higher than before. Urbanization continues to increase. We have very easy worldwide air travel. In the best case scenarios, we might even have like rockets that will take us from New York to Bangkok in one hour but I mean Eli Dorado told me that like that's probably not going to be commercialized anytime soon because rockets are a little too dangerous but we have supersonic jets they might take us there in like four or five hours and so I expect air travel to just to be even more ubiquitous. Factory farming creates lots of pandemics, man-made pandemics so gain-of-function research",
  "eventId": "devcon-7",
  "slot_start": 1731567600000,
  "slot_end": 1731568200000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1yGQBHJnRzdZfi9mog9ipmc0zYrZB2nzXpEG4mGwCGko",
  "resources_slides": null,
  "speakers": [
    "vitalik-buterin"
  ]
}