{
  "id": "visual-code-of-cypherpunk-and-lessons-from-subcultural-aesthetics-we-should-remember-on-the-road-to-mass-adoption",
  "sourceId": "ZAYEXK",
  "title": "Visual code of cypherpunk, and lessons from subcultural aesthetics we should remember on the road to mass adoption",
  "description": "I want to take builders on the turbulent ride through how subcultural and social movements used their visual codes when spreading globally, and what design tasks are still ahead of us on the way to making Ethereum cypherpunk again and onboarding the next billion users to Web3 at the same time.\r\n\r\nThis ride will include three stops:\r\n1. waving one's emotional state into the collective identity\r\n2. using shared aesthetics as a signal of belonging\r\n3. coordinating a collective design process.",
  "track": "Cypherpunk & Privacy",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Coordination",
    "Identity",
    "Design",
    "communication",
    "Coordination",
    "Design",
    "Identity"
  ],
  "keywords": [
    "culture",
    "aesthetics",
    "communication"
  ],
  "duration": 758,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "aUkVqsDW6t4",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "67388bae1b0f83434d2b7c95",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67388bae1b0f83434d2b7c95.vtt",
  "transcript_text": " Let's see in the wipe. So we all want mass adoption for our products and we want this products to be loved and used by many. And yet we have one heavy anchor that will always hold us back from mass adoption – a visual language or cypherpunk. Let me show you what's happening. Visual language consists of two core layers. The symbols – they carry meaning and cultural baggage. And the styles – Styles evoke emotions. They always go together when it comes to how we respond to visual messaging. A positive symbol in a positive style evokes joy. A positive symbol in a negative style makes rather negative impact. Think about toys in the horror movies. A negative symbol in a positive style can cause confusion, but rather it brings amusement. And think about Halloween. And a negative symbol in a negative style evokes nothing like fear and disgust. People try to distance themselves from everything that lives in this quarter. Well, adoption lives there. How do you think where cyberpunk is? Let's see. The first symbol, an anonymity mask, traces back to guy folks who earned a reputation of a failed terrorist and actually never fought for democracy. Well, Alan Moore tried to recover this image in the comics V for Vendetta, making it a symbol of vigilantism, but later Hollywood successfully shifted the message, adding a narrative with a fear, creating taglines, and a lot of blood. Today, it's a symbol of cypher funks. Now, here you already see a second symbol, hoods, that was originally associated with monks, the knowledge keepers, which is a good beginning. But later, they became a symbol of secret societies, many of which practice ritual murder and dark magic, if such a thing exists. And recently Hollywood dressed all the assassins in hoods, adding a nice layer of death and blood to the overall image. Today hoods is a symbol of cypherpunks. Well, here you already see the next symbol, which is a common line romance, which again by Hollywood, in a form of digital reign, together with the techno style, presented technology as a global threat to everyday life. And the last style I would like to mention is glitch effect, which was a way for early internet artists to present, to visualize a system vulnerability and the beauty of breaking it. But for normal people, the glitch effect evokes the same feeling as breaking glass. Now, how do you think where on this matrix cipherfunks are? Well, fortunately, we have a century of subcultural movements that can teach us how to ease this tension between our heritage and the past and the mass adoption needs. So here are three main lessons I want cypherpunks to hear. First, choose joy as a strategy. Cypherpunk looked like it was designed for post-apocalypse. But privacy should not look like paranoia. It should look like freedom. Just look how pride movement turned the protest into a celebration. They didn't promote a better hiding spaces. They made visibility powerful and joyful itself. And you may say, meh, rainbows. But people love rainbows. Ethereum love rainbows. So we already want this joy. Next lesson, aim for simplicity. Cyberpunk visuals require technical tools to reproduce them. But if your grandma and even you cannot draw the symbol with anything that you have in your hands right now, it will not spread. Extinction Rebellion teaches us how to do. They created a symbol which a child could draw in seconds and every human could reproduce with anything they have around. They later gave this symbol to communities and communities style it with their own wipes to represent their emotions around the movement and the movement went global. And last example, embrace evolution. Black panthers used powerful yet very aggressive imagery, usually containing weapons. Because of this aggression, the movement didn't achieve the reach they hoped for, but the movement did not die. The new generation learned from the past and took over and moved from displaying weapons to displaying words, from we protect ourselves to we deserve to be here. And they reached millions and more. So if I were here, an incarnation of all the subcultural movements from the past, I would ask our ecosystem to not make Ethereum cypherpunk again, but to make it a new cypherpunk. And maybe, just maybe, it will also have a different name. Thank you. Thank you very much. So we have a bit of time to ask a few questions. Raise your hand if you have any questions. Over here. Who's doing it right? Who can you call out or are there any examples that you've seen this week of different ways to evoke this sentiment in our ecosystem visually? I mean, who is doing the right cypher form style or who is doing the right in general? The visual styling that you've described and the evolution of that expression, have you seen any of it in person? We are here right now. So we have some more questions over there. Hello. Thank you for the talk. So my question is, from the negative examples that you presented, it seems like a lot of them were kind of, you know, serious, tough, masculinity focused. And crypto as an industry is also quite masculine in terms of just people who tend to, you know, run the companies. If we gather up everyone who works in crypto, mostly it's men. uh one of the positive examples that he had was you know the pride flag for example which is something that is quite challenging to traditional masculinity so how much do you think that plays into the current branding issues that crypto experiences thanks well I'm so glad you asked this because like maybe 20 minutes before the talk I just cut off one slide because I needed to fit in five minutes. But after the glitch effect, what I wanted to say is the cypher fund imagery has a very heavy gender coding and is all white male narrative, which is exactly what you tell about. Well, all those movements that I showed, they actually show the equality of everyone. And what I really love in Ethereum here right now in DEF CON is we have more of non-white people. So it's really good that white people are not dominating here. Also, if you study cyberpunk movement itself, there were a lot of regional directions who actually didn't go for this american uh white narrative cyberpunk and actually uh for the original cyberpunk movement hollywood did a lot of bad job for us because as much as we were trying to narrate uh well developers don't do a lot of good job for the visual communication so they did a lot of good job for the visual communication, so they did a lot of good stuff for vision building, but Hollywood knows how to show masses what exactly the government wants to see, and in general, nothing goes on the screen which can harm the government. So even V for Vendetta, the author of V for Vendetta wasn't involved in the movies because he didn't agree with the flatness and bloodness of the movie creation. The original comics had a very deep narrative that you actually need to see where he comes from. Did I answer your question? Thank you. So there's a last question over there. Okay if I may I would like to have like a very small comment. I absolutely do agree with you that the imagery we are using is holding us back and this is like spot-on well job, but the job well done. But none of the images that you showed are actually connected to the original cypherpunk movement because they didn't have any image. It was just a mailing list, a very traditional mailing list that didn't even allow to attach any imagery. The closest they were getting to having any visual identity is when three of the people from the original cypherpunk movement were featured on the cover of Wire magazine and they were wearing masks, but they were very different masks. They have nothing to do with Guy Fawkes and it was not their idea to wear the mask. That's one thing. Second, they used one pretty cool image that became really associated with them, but not with the movement, but one of the campaigns that they were running. In the early 90s, there was this danger that U.S. government will impose a surveillance mechanism on a communication with, like, Clipper project. And what cypherpunks did was, like, basically they hijacked Intel logo, and instead of Intel inside, they put Clipper inside. And this became, like, a sticker that they were distributing in many, many places. And so this was, like, quite successful. But everything else that you showed has absolutely nothing to do with cyberpunks. And one last thing, cyberpunks, the name itself, it's not that they created. They were not considering themselves to be a counter-cultural movement. It was basically a joke from someone who was looking at them and commenting how they are like approaching things. But they were not punkish at all. Absolutely. Yes. And that's how branding works. It's not what you say about you. It's what others say about you. So I encourage you, open your laptop and Google hacker icon and see what you have in dance just google cypher funks and see what google gives you and it's yeah that's the whole point there the world and we know which powers are engineering the reputation of cypher funks which is going to the minds and hearts of people outside of crypto bubble. And the call is not being passive around this, but actually do actions to create the image that we want to have, not what happens because some other very...",
  "eventId": "devcon-7",
  "slot_start": 1731495000000,
  "slot_end": 1731495600000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1JfZtSjos8JrMCOBp9B9xIaU5dMAfVMzayGYW7eA5F7Q",
  "resources_slides": null,
  "speakers": [
    "ira-nezhynska"
  ]
}