{
  "id": "wen-p2p-electronic-cash-system",
  "sourceId": "ZFX3ZF",
  "title": "Wen p2p Electronic Cash System?",
  "description": "16 years have passed since Bitcoin whitepaper came out. Bitcoin was created as cypherpunk cash replacement. Cash means easy payments. But bitcoin found its PMF as 'digital gold', not as 'digital cash'. What happened to cash? What needs to happen for mass adoption of crypto payments?\r\nWe will go through the history of failed attempts. We'll end up with a hopeful analysis of why it's different in 2024 (spoiler alert: stablecoin adoption, cheap L2s, AA).",
  "track": "Real World Ethereum",
  "type": "Talk",
  "expertise": "Intermediate",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Conviction",
    "Payment",
    "Account Abstraction",
    "stablecoin",
    "Account Abstraction",
    "Conviction",
    "Payment"
  ],
  "keywords": [
    "payments",
    "cash",
    "stablecoins"
  ],
  "duration": 1549,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "Kw3rxKFUEKc",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673321cc3a168eb53554b6fe",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673321cc3a168eb53554b6fe.vtt",
  "transcript_text": " Hello. Hello. Cool. Who knows in which year the peer-to-peer electronic cash system paper came out? Anyone else? I'm sure you know. Just three people? Four people? Okay, which year was it? 2008, right? So we're still waiting for that peer-to-peer electronic cash. I think it's fair to say that we've not taken over the peer-to-peer payments world. Bitcoin has definitely found PMF product market fit with store of value. And I don't want to argue that there are no payments on Bitcoin. But clearly, the last payments you've made to come here, maybe with your Grab or Bolt or Uber were probably not Bitcoin or on-chain payments at all. Just to show how ancient this paper is, this is 2008, right? So in 2008, GTA 4 came out. That's how long ago this was. The iPhone just came out a year earlier. People dressed like this. I think it's cool, but also very, very ancient. Bitcoin was largely, well, came out right in time as a perfect reaction to the financial crisis of 2007-2008. This is how long ago it was. a perfect reaction to the financial crisis of 2007-8. This is how long ago it was. I think we all here know what peer-to-peer means, but let's briefly talk about the cash part, because I think it's very easy to think of cash as payments. But payments are not exactly cash. I would say that cash payments are a subset of all payments. And usually when we talk about payments, we talk about something that's much, much more complicated. So last time you ordered your Grab to get here, you made probably a credit card payment. With that there was a very big bundle of services that enabled things like chargebacks, maybe you were using a credit card and definitely there are some points and rewards so I'm still waiting for the visa and MasterCard airdrop. But I would just want to talk about the simplest of payments like this very raw payment which just goes payer to payee without all of these bundled services. So this is what we usually mean by cash payment, right? Like if I give 100 baht to a taxi driver, there's no way to charge back unless I hunt him down somehow. There are also no points and there's definitely not a credit system. So for today, I'd briefly like to talk about why we haven't taken over the world yet and what's needed to take over the world with on-chain payments. So I'll give a mini intro about myself and then we'll go through a mini history just to honor our ancestors. And then I'll talk through five narratives that were popular, or that are popular, to answer, like, this is the blocker. Like, we can't have payments because of, I don't know, scalability, let's say, right? So these will be the five Topics that we'll analyze So about me. I'm the peanut brain at peanut protocol. You can look me up Here and also DM me here So, let's go and honor our ancestors I think I think it's really important to realize the first wave of blockchains and categorize these very briefly. So we had Bitcoin, which I already mentioned, and then we had a bunch of payments projects that were strictly about this cash element, strictly about making payments happen. So I think Litecoin fits that category very well, and Dash definitely does. Stellar, I would say, too. Then we have private payments, Monero and Zcash. The only ones with smart contracts are Nex and Ethereum, by the way. So despite all of these huge ecosystems, well, some of them huge ecosystems, we haven't yet moved cash or payments on-chain. Despite all of these huge ecosystems, well, some of them huge ecosystems, we haven't yet moved cash or payments on-chain. So when I was prepping for this talk, I had the honor to talk to some of these ancestors and people who are working on these very ancient projects. And I asked them, like, how are you going about trying to bootstrap your payment network? And one of the guys I talked to, he was running a campaign in 2017 trying to convince parking garages and, like, very local shops in one local city in the US to adopt their coin as one of the payment methods. As you might guess, it's quite a hopeless endeavor endeavor because you not only have to convince the garages, but also you have to convince all the drivers to adopt your thing in an ecosystem where there is the dollar already and people are used to coins and dollar notes. So what's the advantage of bootstrapping that one token, one chain thing? I think quite similarly, we have... Who's been at ECC this year? Nice. Cool. You might have seen the payments cafe by base. They were selling cappuccinos where you could just take your Coinbase wallet and just make a payment for a cappuccino. And there I wondered, well, isn't it the same case? What's my reason to switch over from that? Like opening up my wallet and so on when I'm so used to just tapping my card, right? Especially that was just USDC on base with which you could pay. So here are the candidates. One common narrative will be scalability. So we need fast and cheap for transactions I'll kind of argue against that then another one is privacy I think highly important in a world where we have full adoption and most payments happen On chain, but I will also argue that we can have a world where settlement happens on chain butts And stuff is still reasonably private. Then another argument that is very common is, well, payments are not on chain yet, or haven't captured a whole payments market in TratFi because stablecoins are relatively new. I'll also argue against that. And then finally, for the 4337 mafia, one common argument is, hey, we need better account management. We have to have account abstraction, all these nice UX improvements. I will also say, well, that's not the main blocker here. And then finally, we'll go into the interrupt thesis. So let's start. I think this is a very common thing, especially in the early days of blockchains. This was a very, very common thing to hear when people were pitching L1s, but also still L2s, right? So the pitch goes something like this. In order to compete with TradFi payments, we have to be similarly cheap and fast. we're pitching L1s, but also still L2s, right? So the pitch goes something like this. In order to compete with TradFi payments, we have to be similarly cheap and fast. So Visa has 24,000 TPS, and my blockchain is so much faster. It has 69,000 TPS, right? I think, again, this kind of, it's a bad comparison because you're comparing these very raw payments of just transferring value from A to B with Visa, which is this very, very complex, very bundled payment solution. And then also, perhaps more importantly for the argument here, is there should be a subset of payments where this doesn't matter right so if i do a one million dollar transaction and there are hundreds of thousands of these happening every day or millions maybe even well definitely millions then it shouldn't matter whether i'm you know using bitcoin um which is slow and relatively expensive. But by the way, what do you think, what are current Bitcoin fees today? If I want to send $1 million to another country, what's the fee on Bitcoin in dollars? Any guesses? Yeah, $1. Yeah, that's not much. You can't do that in Tratva. You can't send $1 million to another country with one buck. You can't do that. Not in that order of magnitude, right? So clearly there should be some subset of payments where it would be more efficient to already use Bitcoin, something as simple as Bitcoin, as the kind of international settlement thing. This is especially true for rare international pairs where normally you would be doing many hops between banks, so the way a TradFi international payment works is you're sending it kind of they're exchanging these IOUs and they have these very custom agreements between each other to trust each other with these IOUs. So when you're sending, let's say, money from Armenia to Chile, it might very well be the case that this payment is going to do five or six hops across the world. So first to a more local bank, and then to another one, maybe then to some US bank, and then finally to some Latin bank, and then finally to Chile. In the meantime, you don't know where the payment is and the fees you don't know how much each intermediary is going to collect. So already this should be more, even with Bitcoin, something as primitive as Bitcoin, like V1 of blockchains, it should be more efficient. But guess what? Here's my startup idea. Why don't we do a TransferWise but with Bitcoin rails? So the way TransferWise works is you have these bank accounts in different countries, and then they kind of just internally settle the payment. So they front it for you. They receive it in one country, then they front it to you in the other country. Well, here's the problem. For that to happen, you would need two banks to agree not to ban you for your Bitcoin payments. So if you can convince two banks not to ban you because you're not fitting their AML requirements or they don't know what you're doing or they're just scared of Bitcoin or they think it's like some shady thing, then you might as well just have a normal, very classical IOU-type contract with these guys to just do a normal settlement. So if you've identified this pair where there's a lot of sudden trade happening, and it's not been captured yet, let's say, I don't know, Chileans suddenly get obsessed about Ethiopian coffee, if suddenly there's a lot of trade happening, immediately there will be someone who will try to capture those flows to avoid all these inefficiencies with these hops, right? And you can do so with IOUs for these large transactions. So this very convincing narrative, like when you hear it for the first time, oh yeah, sure, let's use crypto rails just for the international part, is actually maybe not as strong for these larger B2B transactions, especially when it comes to global supply chains. Cool. Another narrative, privacy. Well, we can't penetrate the whole market unless we have privacy. Obviously, if I go somewhere and I buy my coffee, I don't want to broadcast that to literally the entire world that I just bought a pumpkin spice latte. That's extremely embarrassing, and I don't want other people to know. I think, well, again, that does not much for the just Rails thesis, because you could have some kind of company that wraps Monero or Zcash or some other solution and makes it into a nice payment thing. But also you could just obfuscate using centralized means, right? And that hasn't popped up yet. We've not truly challenged payments that way. So I don't think that's the main blocker. Okay, another very, very common one. So stablecoins. Very, very hot topic right now. Stablecoins have found PMF, product market fit, mostly as collateral for DeFi stuff, right? They haven't necessarily, or at least early on, they haven't found PMF for payments. We haven't seen that much action in terms of stablecoin payments. It's changing now. I think there's this emerging, very nascent stable coin payments market, which is extremely exciting. But that's also not the main blocker for the crypto rail thesis, because, I mean, if I'm just using it for one hop, so I'm selling my whatever, Polo Slotties here, and then sending them over to Brazil, then it's just one hop over Bitcoin. The next block, I'm already selling it. So the fluctuation of the value doesn't matter too much. And also, it's just false that you can't make payments with a highly volatile currency, right? Like hundreds of countries have, or dozens of countries have highly volatile currencies, and yet somehow people get paid and have salaries and so on. So another thesis, accounts, right? So here the idea is that we need something like account abstraction for mass adoption, better onboarding, stuff like account recovery, more granular permissions. If you think about it, it's kind of crazy that I need exactly the same level of permissions to send $1 and to send $1 million. But again, there should be some subset of payments where all of this doesn't matter because we do have these professionalised custodians we can have like for larger B2b payments we could have all of that so What's needed to unlock? these Payments for everyone to have this peer-to-peer cash that is fully on chain. So I'd like to argue that it's As simple as interoperability with everything else. So I Mentioned early on this guy who was going around garages trying to convince them, hey, adopt our coin for parking fees, and unfortunately they weren't very successful. Well, because it wasn't interoperable with standard ways of paying for parking. So here's the thesis. Interoperability is a necessary condition for interchangeability, which makes money, right? Like, money has to be spendable, which in turn is a necessary condition for any new payment network. So essentially, the idea of bootstrapping a whole payment network from scratch is kind of like that won't work right so what does this mean in practice so in practice this means that we need to slightly defragment parts of our current ecosystem so this is an example from I think a year ago blog post by Vitalik he posed the problem, hey, I have coins on Scrawl, but I want to pay on Tyco. What do I do? Super annoying. If I want USDC, 10 USDC on Optimism, you want 10 USDT on Arbitrum. Super annoying. Another one is, maybe I have some stable coins, but you want fiat. That's a problem we recently asked how we could solve that. And this is what I mean by interoperability. So making it such that it's not one chain, one token, but any chain, any token, and even fiat crypto. So we have a November challenge, which is the no-sex challenge to avoid using centralized exchanges for a whole month. If you want to hit me up, I can share the details later. But back to this idea, how can we achieve this interoperability? Well, it's really, really hard because not all blockchains talk to each other very well. And also fiat and crypto doesn't talk to each other very well. So there needs to be some layers of abstraction that let all of this get routed correctly. And I think one approach is to lock up the funds and then let them be routed where they need to go. And this is something we've been researching for the past one and a half years. But also, I'd like to very briefly mention that it might be the case that payments are currently being eaten by Visa and MasterCard. Crypto payments are being eaten by that because there's this huge emergence of cards, of crypto cards, which I'm using too, by the way. I think they're extremely convenient and a great tool. But we also need to ask ourselves, well, maybe we can skip that step, right? Maybe we can somehow be interoperable in such a way that the merchant receives this raw, simple payment without all of these extra things like the rewards, points, chargebacks, because not for all payment types they're needed, right? So maybe we need to unbundle the payment a little bit. As one of the final notes, I'd like to, this is a quote I found when I was researching for this presentation and it's from 2014. And this was from someone from the Bitcoin Foundation and essentially she said that you can send money over the internet, which is super useful for especially the unbanked, right? So maybe the, it's really interesting for me to see that this was the narrative 10 years ago, and still it's a really, really important part of what we're doing. So, to summarize, we have briefly discussed scalability, where we discovered that for some subset of payments, it shouldn't matter. But if it doesn't matter for these payments, you need these banks to anyway agree, then you might as well go directly through the banks and not use the crypto rails. We've discovered the benefits of account abstraction and easy onboarding for like a mass payment. We briefly discussed stablecoins and what role they could play in the payment space. Then we briefly discussed privacy and the needs there, and, like, is it going to happen? And then, finally, we discussed what interoperability means on a technical level, but I'd also like to briefly touch on the regulatory level, where, essentially, by having regulatory clarity, we can convince more and more of these stratify institutions to be, well, interoperable with our payment systems. So, yeah, long story short, I strongly believe that the next generation of banks will simply skip the neobank stage. So if you think about the Western world, we had traditional banks, then we had Revolut, Monzo, and so on. I think in a lot of emergent economies, we'll simply skip that stage, and the next generation of banks will be partially on-chain banks that are interoperable with TradFi. Yeah. If you want to talk payments, if you want to exchange memes, please DM me. These are my details. Yeah. Open to questions. Alright. Okay. And now we come to the Q&A session. You guys see the QR code on the screen? Any questions for the speaker? Please scan. Okay. Here we go, man. The first one coming. All right. What are your thoughts on agents using stable coins for online purchases? And agents, agent to agents, that's the dead thing, I guess, human payments. Let's go. Yes. Let's do it. I mean, I think, you know, the idea of Intents is much, much broader than just Intents for a swap or a cross-chain swap. Intents can be, you know, just orders for something, and I can just express something like, hey, I want a pizza for so and so many Bitcoin, and someone should be able to go around the world, whether that's a human or an autonomous, well, a bot or AI agent, and solve that for me, right? I think that's clearly something that will happen where all these searches will be done by bots. All right, we have a second question. Second question. Is privacy a blocker for widespread adoption? Yes, but also we don't have widespread adoption yet. So if you think about your payments that you've made, probably this week you've made several dozen payments for coffees, Ubers, maybe to your landlord, maybe you've received a salary that were not on chain. And privacy, yeah, simply, it's too small of a percentage of payments to matter in a big way. So I think it will be a huge problem and will be a blocker, but just not yet. And we have a path forward, right? Like we know how to at least have soft privacy without getting jailed. More questions coming. All right, there's a third one right there. How important is financial literacy? I think hugely important in emergent economies, right? So if you think about emergent economies, the financial products that they have access to, that normal people have access to, are extremely primitive. A lot of people are still saving their salaries in dollars rather than, I don't know, something like the S&P 500 or Ethereum. And they simply don't have access to more sophisticated financial products. All of this will need a lot of education. But for now, I think also we can make more sophisticated financial products accessible to emerging economies through crypto. And we have the fourth question. Can monopolies do anything? Well, yeah, that's a very, very good question. I think the main challenge right now is that Visa and Mastercard have a very, very lucrative reward system, which the merchants pay for, right? So if you think about a credit card payment versus a debit card payment, if you're using a credit card and you're getting some cash back or some other rewards, you're essentially getting subsidized by all the people who paid in cash or with a debit card. I think that's a cycle that's very, very hard to break. And that's why I think the first widespread on-chain payment system will emerge in emerging economies where penetration of Visa and MasterCard isn't that high, and we will have to build our own similar reward system, maybe some crypto-native distribution methods that high and we will have to build our own similar reward system, maybe some crypto native distribution methods like future airdrops and stuff like that might be a very good way to bootstrap a payments network. We have one minute left for the Q&A so maybe we can get this two or three questions. What specific domains or use cases for payments do you think are most promising in the near term? I think we have this incredible explosion of remote work and global work and global teams in crypto. Almost, well, the majority of teams is somehow globally distributed. Payments are frankly a pain in the butt to manage. I think we will see a huge emergence of on-chain payments that then use some kind of localized off-ramps. Yeah. Let's do the last question. Yeah. At what level is adoption? Oh, super low. I mean, we don't know, right? Well, we don't know, because it's very hard to estimate, but I mean, it's definitely sub 1%, and if you account for all payments, and probably sub 0.1%. All right, all right. Thank you, you guys. A big applause to the Urban, please.",
  "eventId": "devcon-7",
  "slot_start": 1731402000000,
  "slot_end": 1731403800000,
  "slot_roomId": "stage-6",
  "resources_presentation": "https://docs.google.com/presentation/d/1JImpxFx5TF-6ESwxVVo3QOw9b3RrwbHwCF5idb0IZDY",
  "resources_slides": null,
  "speakers": [
    "konrad-urban"
  ]
}