{
  "id": "what-defi-founders-can-learn-from-web2",
  "sourceId": "QB8CGR",
  "title": "What DeFi Founders Can Learn From Web2",
  "description": "Most DeFi founders come from crypto native backgrounds, but there is much to learn from the operational mechanics and metrics of web2 companies. \r\n\r\nThis talk will be a brief tutorial about web2 business mechanics, specifically SaaS. Concepts like unit economics, CAC, LTV, ARPU and the science of building and growing scalable companies.",
  "track": "Real World Ethereum",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Business",
  "featured": false,
  "doNotRecord": false,
  "tags": [],
  "keywords": [
    "Metrics",
    "Unit economics",
    "Growth"
  ],
  "duration": 551,
  "language": "en",
  "sources_swarmHash": "2a6da17012439090d0f3e3a01b43f095606ddc22b273ee597298003c1d4338d5",
  "sources_youtubeId": "BYAUg-nibMs",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673456ff9dbb7a90e114e68a.vtt",
  "transcript_text": " Hello. Hello. All right, so this is going to be a quick one. So I'll try to go fast, but hopefully keep it comprehensible. So yeah, my name is Mike Seligadze. I'm founder and CEO of EtherFi. And my lens on the crypto space is that I come from a Web2 background. And so one of the things that I want to talk about is what are some of the lessons that Web3 founders can learn from the Web2 universe? So just to give you a little bit about my background, I got into crypto super early, bought some Bitcoin back in 2011. That's like the actual confirmation email. It was about a dollar per Bitcoin at that time. There weren't even exchanges. I had to just PayPal some money to a random guy on an internet forum, which was fun. Then around the same time, I started a company called Top Hat, which was a web two company in B2B SaaS. So specifically, we were doing education software for universities, which is a very challenging market to be in. I spent about 10 years growing that company. It ended up being pretty successful. We got it up to around 450 employees, about 65 million revenue, and then sold it in 2021. It was a great, great outcome. And so then I decided to do pretty much the exact opposite, as far as you can get from education software, which was my first passion, crypto, and started Etherfy around 2022. And that's gone remarkably well. We've been humbled at all our success. We're the number four DeFi protocol by TVL, at least about $8 billion in TVL given current ETH price. And, yeah, around $30 million in revenue and growing super fast. You know, couldn't be more excited about it. One of the reasons I would say that EtherFi has been successful is because we've taken sort of the discipline and mechanics of operation of the business and brought it to the DeFi world. And so what I want to do is just talk about, you know, what are some of those lessons. You know, the curse of crypto is that there's way too much money in the space. You know, there's just a ton of gambling money coming from the great, you know, cas curse of crypto is that there's way too much money in the space. You know, there's just a ton of gambling money coming from the great, you know, casinos in the sky. And that actually, the effect that ends up having is crowding out real product development because it basically eliminates the need in many cases for getting product market fit. If you're doing, you know, a Web2, more traditional SaaS type of business, the cycle of that business looks roughly like this. You acquire a customer. You get the customer to give you dollars. You then keep that customer by providing a good service. Then you reinvest that back into R&D, and then the customer is happy, and there's a nice positive feedback loop. In Web 3.0, it looks a little bit different. Usually, you find a project that's really cool, maybe a nice DEX. You launch a token, you vest your tokens, you cash out, and then you're done. It's a great business model, super easy to make really shocking amounts of money doing it that way. But when the main business model is basically printing casino chips and then taking a rake, you know, this is why we can't have nice things. So what I'd like to do is talk about, like, what are some of the principles that.",
  "eventId": "devcon-7",
  "slot_start": 1731480600000,
  "slot_end": 1731481200000,
  "slot_roomId": "stage-4",
  "resources_presentation": "https://docs.google.com/presentation/d/1Gix77PnI2mYDQXanQIb49GstVRHx_-5qwgYKGNsIxzs",
  "resources_slides": null,
  "speakers": [
    "mike-silagadze"
  ]
}