{
  "id": "whats-in-your-dose",
  "sourceId": "BRUGUL",
  "title": "What's In Your Dose?",
  "description": "Pandemic responses require robust technical tools such as molecular diagnostic tests, novel immunization reagents, and recovery surveillance tools.  Pandemic responses depend on public trust in these tools and their good faith deployment.  Verification strategies to enhance public trust and cooperation will improve the performance of molecular tools in future pandemics.",
  "track": "[CLS] d/acc Discovery Day: Building Towards a Resilient Utopia",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Research",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Decentralization",
    "Public good"
  ],
  "keywords": [
    "Molecular",
    "Biology.",
    "",
    "Public",
    "Health.",
    "",
    "Public",
    "Trust."
  ],
  "duration": 907,
  "language": "en",
  "sources_swarmHash": "be8d4b2923608f8527fd4ad82d690569c33c76afabc4fce1d2968e8cd0993e26",
  "sources_youtubeId": "F_SxA6W5hzQ",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "6735b9069dbb7a90e1872a41",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/6735b9069dbb7a90e1872a41.vtt",
  "transcript_text": " So thank you all for inviting me to come and speak to you. I want to talk to you a little bit about some of the molecular biology work that's going on in my lab at the University of South Carolina, but I'm going to talk a little bit about the philosophical implications of how pandemics do more than just harm individuals. They actually harm the social trust that exists between individuals, and a proper pandemic preparedness plan has to have in place widgets that can deal with the virus, but also information management schemes so that we can prevent the social harm that happens to societies by the loss of trust that naturally occurs between people when a virus is creeping through and harming people and you don't know what is happening. So you're going to see that this is a tour through some molecular biology work, but I want you to notice ways that information management and blockchain kind of technologies can make our societies more robust to future pandemics. So early on, I and several other people noticed that the SARS-CoV-2 virus had some really weird characteristics. If you do an alignment of this virus against its most recent common ancestors, you find out that it has a lot of mutations that are what are called non-synonymous mutations that cluster in the receptor binding domain. It looks very engineered. It's a circumstantial evidence, but it looks like it had help. If it didn't have help, it's a remarkable coincidence. Nonetheless, we made a bunch of PCR primers. Regardless of where it came from, we made PCR primers and started developing a test in our laboratory just so that we could figure out who had it and who didn't and maybe keep the University of South Carolina functioning properly. We made this kind of a PCR test with our own primers and protocols and proved that the PCR really will detect the virus and it'll detect it down to single molecules in the well. This PCR assay does not have a false positive problem. You can cycle forever on a negative sample and it will never fire, but it can accurately determine how much virus is in any sample. We then kind of accidentally discovered that raw saliva works better than the nasal swabs. We discovered this for a funny reason during the pandemic lockdowns. We ran out of nasal swabs and ran out of RNA purification reagents. So we just tried it on raw saliva and it turned out that it worked fine. It worked even better than the standard procedures. And it's kind of funny given all the gatekeeping that has gone on about nasal swabs and the type of swabs that you have to use and all that sort of stuff. You don't even need any of that stuff. I tracked the virus as it went through lots of individuals, students at the University of South Carolina, and families. And I could prove to myself that the virus was real and that the PCR protocol was actually predicting illness. This is a family here where some of the people got it and some of them didn't. And the PCR signal predicted perfectly who was going to get sick and who never did. This family on the right, that's me. And the blue curve is me whenever I brought it home and gave it to my wife and two daughters, and then they got sick later. So I had access to validating, verifiable information that the PCR results were tracking with symptomology. Most people didn't have access to this kind of verifying information, and after a while, they kind of became suspicious of, hey, is this thing really telling me the truth or not? And they didn't know anybody like me that they could ask to see, is this real or not? Another kind of interesting phenomenon about this virus, which probably we'll see this again, is the asymptomatic super spreader phenomenon. Now, you may have heard about this. I know it's real. This guy here was the brother of one of my students that was working in the lab. And we were testing everybody every day as we were developing this test. And we were using all of our friends and family members as negative controls. This guy blew a positive and he had more virus in his saliva than there are people in China. But he had zero symptoms. And on day three, he went on a seven-mile run and clocked his normal time. But this guy could infect the whole world if he tried, and he would never have known about it. So this phenomenon is actually real. There are silent super spreaders that are walking among us, and reasonable people grew suspicious about, hey, maybe this PCR is bogus. Maybe this is lying to us or something like that. Because it's not really working when we're trying to just quarantine people based on being sick. And again, future pandemics need to respond to this kind of situation in a way that preserves social trust. We need to plan on this as being a real thing. And I think that the information blockchain might be one solution to this problem. Here's a result of a whole bunch of positives that I'm showing you from just one month of testing. We did like 300,000 tests over a two-year period, and this is one month of positives. And I want you to notice the distribution of CT values. In PCR space, it's minus the log of the CT value is kind of related to the log of how much starting material there is. So these very low CT values down here at 10, they have a lot of virus. And these higher CT values around 30 or 32, they have a small amount of virus. Those people at the bottom in that circle have a billion times more, it's a log scale, they got a billion times more virus than the average. Those are our super spreaders. And that's probably what happened in the Wuhan market. Someone was infected and didn't know it because they were an asymptomatic super spreader, but they had enough virus that they could infect everybody that was shopping that day or that week. This happens. It's a very sneaky virus and it causes mistrust to develop because people are getting sick, and you don't know who they were exposed to. Are they somehow worshiping the wrong god, or are they in the wrong political party, or are they guilty of wrong think? And then the natural human brain's tendency to turn on each other takes over and it fractures social trust and society begins to deteriorate. This is what this really, really happened during the pandemic and we're still dealing with the consequences of it now. Okay, a few words about the mRNA vaccine. The mRNA vaccines came on the scene. They were deployed under an emergency situation. We didn't have time for public trust to develop organically. We had to go for broke because it was a dire situation. Initially, it was reported that these vaccines were 90-something percent effective at preventing infection. That only lasted for about a month. And then they became very effective at preventing infection. That only lasted for about a month, and then they became very ineffective at preventing transmission. They do have what appears to be durable protection from death about 80% of the time. It does reduce the probability of dying. This is still hotly debated because people don't trust the information that they're getting from various sources. We need ways of having raw data being uploaded to some sort of an information blockchain so that people can see how the data is accumulating and not be suspicious of whoever is gathering the data so that they can come to their own decision about whether this is real or not. Anyway, there's a lot of side effects that are unexplained and they tend to be flippantly dismissed, and this causes more distrust. I use a lot of sequencing technology in my lab. We're gene jocks. We're cancer gene jocks. We sequence things all the time, and we can discover mutations or DNA sequences that we didn't know we were looking for. I did this on vials at a vaccine, okay? This is basically an internet dare that somebody put me up to. Somebody else had done this, and I said, ah, this is crazy. So I did it myself, and lo and behold, I discovered a bunch of DNA pieces in the mRNA vaccines. I thought, well, this might be the explanation for some of these side effects that people are seeing. We should check into this and see if these little bits of DNA are getting into the human genome of vaccinated people. The public deserves to know what they're taking. If it's a vaccine or anything else, the public deserves to know what's in it. And molecular biology tools can do this for you. This is kind of the sequencing result that came out of my lab using a modern, very cheap, deployable sequencing platform. I'll tell you about it later if you ask me about it. This technology, you can use it in the field if you want to. You could sequence something in the jungle on your laptop. It really does work. Anyway, these little pieces here, all the little pieces of DNA we discovered in the vaccine, there's a lot of them. And using this technology, you don't have to know what you're looking for and you can see what's in your saliva, what's in your vaccine, what's in your food, what's in your environment. All these things can be answered by sequencing, but public trust can only be generated by making this data on some sort of a public ledger and it be collected by multiple sources, and everybody can just inspect it to see what's there. Think of this kind of data as a form of a contract, you know, or some sort of a blockchain of currency that you might want to generate public confidence in. So we are doing some studies now where we're monitoring the genome integrity of vaccinated people just to see if this stuff is ever getting in there. I made some PCR primers against the DNA sequence that I found. This is what real-time PCR looks like. In case you want to know, the cycle number here at the bottom is how many cycles of the machine does it take before you start seeing product. And the more target was in the well to begin with, the fewer cycles it takes before you start seeing stuff. And the less product is there, the more cycles it takes. So that's why it's backwards and it's a log scale. But we can quantify down to the molecule number. We can literally count molecules in any sample with this kind of technology. And it doesn't suffer from a false positive from too many cycles. It's reliable. So we did an experiment. Can the little pieces of DNA that are in the vaccine ever get into the human genome and modify it? I know this was theoretically possible, and I said this publicly about a year ago. Well, we did an experiment to prove it. We took some normal human colon organoids. These are normal cells, and we vaccinated them in the lab by just putting the vaccine in the media and let it incubate for a little while and then washed them and then grew them and washed them over a month and kept washing them and passaging them. And then we did the PCR on the genomic DNA. And lo and behold, there's stuff there. And it's the exact same frequency that I predicted about a year ago. About 1 in 1,000 to 1 in 10,000 cells have taken up different pieces of this vaccine and it's a permanent fixture of their genomes now. This is not surprising based on molecular biology first principles. We've been doing this for years in the laboratory. This proves that it happens with this contaminating DNA, which is why I was so weirded out about this stuff when I first discovered it. We've been looking at a bunch of tumors from cancers that have shown up since the vaccine rolled out, and we just looked at like 50 tumors so far that were not really selected for anything other than the fact that they developed in the last three years and we've got a couple of them that appear to be positive for bits of this DNA. Now we don't know if this is a driver event or if it's a passenger event and we're doing more investigations to try to figure out where it landed and if it has anything to do with the tumor or not but it does happen so this is what we need to the public needs a careful accounting of this so that their confidence can be, or lack thereof, can be appropriate and based on data, not based on marketing or anything like that. So a final couple of words about another kind of genome modification. It's called DNA methylation. So your genome has methyl groups added to cytosine residues that's CpG loci in your genome and these modifications are part of a developmental program that's been going on since you were first conceived and continues until you die where you slowly change the methylation landscape of stem cell genes and eventually those stem cell genes begin to be silenced, and you lose stem cells as you grow older. Aging is just a natural extension of the developmental process that goes on in utero, and you eventually just run out of stem cells, and you die. We can tell how old you are by looking at the methyl groups on lots of loci in your genome. We've known for a little while now that when your DNA methylation age is disconnected from your physical age, especially if your DNA age is too old, you're at high risk for all-cause mortality. This is really a thing. And there's a lot of interest in finding out what kind of things or interventions can I do that will make me younger, right? That will delay aging. And we can have surrogate markers for this with this DNA methylation aging. The same sequencing platform that I was telling you about earlier will measure methylation on the fly at the same time we're figuring out sequence alterations. So, you know, sequence analysis of normal blood cells can agnostically monitor for sequence changes and methylation changes and figure out if some sort of an intervention has altered the methylation age. All right, so I did this on a sample that was just available to me. This is me pre- and post-vaccination, and there are spots in the genome that the methylation age changed. This is a real thing. This is one sample, so it's scientifically meaningless right now, but it's to prove that this is something that is worth doing, in my view, to monitor what happens to people pre- and post-COVID and pre- and post-methylation to see are these interventions helping our methyl age? Are they harming our methyl age? Once you know what you're looking for, it's very cheap and easy to do it. Final thoughts. Pandemics stress test the trust that people have in each other. Low-trust societies fare worse than high trust societies. Molecular biology tools can measure these things, but molecular biology tools can best increase public trust and future pandemic preparedness if we make the information available to the public so that anyone can see it. We should do this now. And I'll stop there. Thank you for your attention. Thank you so much, Philip, for one.",
  "eventId": "devcon-7",
  "slot_start": 1731571500000,
  "slot_end": 1731572400000,
  "slot_roomId": "breakout-3",
  "resources_presentation": "https://docs.google.com/presentation/d/1RgW3g8Dx3KqmsQIkx6vtDH-Q1Sykokl4An1TOH01ltI",
  "resources_slides": "https://api.devcon.org/data/slides/devcon-7/whats-in-your-dose.pdf",
  "speakers": [
    "phillip-j-buckhaults"
  ]
}