{
  "id": "who-needs-a-wallet-anyway",
  "sourceId": "ZZKKRZ",
  "title": "Who needs a wallet anyway?",
  "description": "This talk confronts the community’s obsession with decentralization purity at the cost of usability. This session explores how to hide the complexities of crypto, enabling seamless integration for users who may not even realize they are using a wallet. We’ll cover simplifying user interactions, making wallets function invisibly, maintaining benefits like permissionless innovation, managing thousands of wallets, and real-world applications. It’s time to push for real, user-friendly innovation.",
  "track": "Usability",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Engineering",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Permissionless",
    "Developer Infrastructure",
    "Decentralization",
    "Environment",
    "User Experience",
    "trusted",
    "wallet",
    "execution",
    "Developer Infrastructure",
    "Permissionless",
    "User Experience"
  ],
  "keywords": [
    "Trusted",
    "Execution",
    "Environments"
  ],
  "duration": 555,
  "language": "en",
  "sources_swarmHash": "",
  "sources_youtubeId": "iNLHWc5toYo",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67330c253a168eb535efb410.vtt",
  "transcript_text": " Hey, everyone. How's it going? Good? Bad? Terrible? Everything good? Okay. So I'm Itai, co-founder of Dynamic. And what I want to talk to you guys today about is pretty much who needs a wallet anyway. Just a raise of hands, who has heard a wallet talk today before my talk? Or is this the first talk of wallets anyway? No? Okay. So let's start. So a little bit about me and Shameless Plug. So I'm the co-founder and CEO of Dynamic. We essentially do everything that has to do with email login, social login, wallet login on a site. So when you click login, if you go to Magic Eden today or Doodles or Pudgy Penguin and you click login, that's probably powered by Dynamic. We help you build crypto-enabled experiences. But that's pretty much all I'll kind of shamelessly plug about Dynamic. Again, we're powering a bunch of these popular apps. That's just context for why I'm talking about this topic, which is the topic of wallets or abstraction of those wallets. So let's get to it. So at the very basic level, the web is moving to a wallet-based world, right? If you open your phone in five years and look at every app on your phone, it's likely going to have a wallet component to it. It's a very effective way to transfer money, to transfer assets, to kind of control it. It's a very effective way to transfer money, to transfer assets, to kind of control identity. It's a really, really cool way. And what we're seeing is that we're starting to see apps on your phone, not new apps, but existing apps, have wallet components to them. But users don't really care about wallets. No one wakes up in the morning and says, I really want a wallet, right? You want these like magical experiences. And when they're crypto enabled, you kind of need a wallet to enable them. Wallets are not the star of the show. It pains me to say as a wallet company, but we are not the stars of the show. We're pretty much kind of in the background infrastructure. And so the way to think about wallets is really in an analogy of thinking about crypto as the electric grid, as power. And everyone wants to kind of hook up to power. Wallets are really outlets in your wall. We're in the business of selling outlets to you. And those, no one kind of cares about outlets. Outlets are not kind of the thing you buy for the sake of buying outlets. You buy them because you want to plug in your TV and watch TV or you want to plug in your laptop and kind of play games. Right? So wallets aren't the main part of the show. So why are we putting wallets front and center today? Why are there so many branded wallets? Why are we even talking about them? And the answer is we shouldn't. Right? People don't care. Maybe folks in this room do, but anyone else doesn't really care about wallets, right? And that's exactly what we're seeing in this market. And so what I want to show you is two examples of companies that are abstracting away wallets and deferring that to later on in the process and focusing on building these magical consumer experiences where wallets don't kind of come up front and center, where you don't log in with a wallet first. And one example, let's see if this video works. Oh, I actually did. Okay, that's, uh, that's great. Uh, so this is a company called Dflow and, uh, it lets you trade pretty much anything you want. You log in with email, you enter your passcode, and at that point you're done, right? So we'll see whether this enters it. Bear with me for a second. Oh, okay, great. The video actually works. So I entered an email, I logged in and I'm done. At this point, I have a wallet. I can kind of export my private key. It's a non-custodial wallet. I can trade, but I really don't need to care about the fact that I have a wallet. It's my way of accessing crypto without really knowing it's crypto. In the same example, there's a really cool app out there. Let's see if this works. Bear with me for a second. It actually did. Called Bags. Who's used Bags before? Love it. Okay, so it's a really cool app. The idea is, again, it's a't really care about the fact that you have a wallet. It's just a means to an end, right? But the challenge with that and the challenge of what I've shown is that while we're seeing this daily across everything, whether it's Deepin or RWA, et cetera, the challenge is that it kind of optimizes for local maxima, right? It optimizes for we're going to have hundreds of wallets, right? We solve the new user onboarding problem, but we don't solve the interoperability problem, right? We optimize kind of each one of these app optimizes for them. It doesn't optimize for kind of a global, really nice, hey, everything is in a single wallet. But we can actually optimize. And this is the only technical slide, apologies. But my point here is to say that everything we're seeing in this market, everything that we're seeing with hundreds of these wallets be generated across these apps, that's totally fine. Because what will happen is providers like us and others will start thinking about ways to let you aggregate those across different kind of apps. So you start with a local maxima. You start by kind of letting someone accomplish what they want to accomplish, and then you start building tools to let them aggregate these magical wallets. And so I'm actually good on time, which is surprising, but my main takeaway from this talk, and I know it's a very quick talk, but my main takeaway, if you take nothing else away, is as you see these embedded wallets, as you see these hundreds of apps or thousands of new social apps or DeFi apps or DePay apps come up and they don't talk about wallets and you're worried about, hey, I'm going to start having these hundreds of wallets with all my assets distributed across them in my pocket, know that it's fine. It's a step in the path to kind of these global decentralization type standards. And not all hope is lost. So what we'll see in a couple years is we'll see these kind of apps, excuse me, consolidate into this kind of magical branded wallets that let you kind of connect these small accounts that you generated into bigger ones. So the future is not lost. Hopefully everyone comes out of this kind of encouraged that it's a step abstracting away wallets is a step towards kind of a really nice crypto future without jeopardizing onboarding experience in the short term. And with that, if anyone wants to talk to me about it, if anyone wants to tell me, I have no idea what I'm talking about, just here's my telegram. It's ping me. You can email me at Itai at dynamic.xyz and I would love to take questions. Awesome. Thank you so much man. Who's got a question? Who's got a question for Itai at this moment? We have just room for one question so who's going to be the lucky one? Going once. Here please. Go for it. What are the security concerns with this parent-child wallet relationship? Yeah, the short answer is a bunch, right? The longer answer is that not all your wallets actually need to be connected over time, right? We think about this connection of parent-child and kind of a general account and sub-account as required to create the over time, right? We think about this connection of parent-child and kind of a general account and sub-account as required to create the single identity, but we're actually creatures of multiple identities, right? I have my identity at home with my kids, I have my identity at work, I have my gaming identity, I have my social identity, and they're different. And you might actually not have this one parent-child, but you might have multiple parents depending on your identity. So that's one way to de-risk it. The second is about controls, just like everything else here. It's about the beauty of optionality, which is at times you can one-click unlink, you can one-click link, you can consolidate your assets, you can break them up. And so it's about optionality and kind of the ability for you to create multiple identities that kind of lower the security risk. But the short answer to your question is, just like anything else, when you combine multiple wallets into a single place, you create some security risk. And I think that's all the time we had, right? How am I doing? One more question. One quick question. Do quick question. There's one in the thing. Oh, yeah, go for it. Do you pass key integrations? Okay. I'm going to make a bet on what this question means. Do we offer pass key integrations? The answer is yes, we do. Whether that was the question or not, I don't care. The answer I want to give is yes, we do. We actually offer passASC integrations. PASCs are, in general, this really magical thing because they're a private public key on your phone and they inherit some really cool properties with companies like Google and Apple that while we sometimes don't like, they kind of have to deal with security, to your point, at the state actor level. And so they really have to think about this stuff at really massive scale, and PASCIs are one of the outputs of that thinking. And so, yes, we specifically offer PASCI integrations. I'm sure others within our industry do as well. They're a really powerful tool to actually get to this both non-custody or self-custody as well as create this experience that at least on mobile, feels very native, which is a face ID type experience. So yes, short answer is yes. Thank you so much, Itayi. That was fantastic. Please give him a great applause. Thanks, everyone. Appreciate it.",
  "eventId": "devcon-7",
  "slot_start": 1731393600000,
  "slot_end": 1731394200000,
  "slot_roomId": "stage-2",
  "resources_presentation": "https://docs.google.com/presentation/d/1pVk3HgI3jY_eVj3C7F4jVkcdwrwbVFi9NzWDCgBBUFg",
  "resources_slides": null,
  "speakers": [
    "itai-turbahn"
  ]
}