{
  "id": "yeomenai-mud-day-demo",
  "sourceId": "7DGLCG",
  "title": "Yeomen.ai - MUD Day Demo",
  "description": "This is a project demo for MUD Day CLS: onchain games and non-financial applications. \r\n\r\nYeomen.ai is building dashboards, automation tools, marketplaces, and platforms for autonomous worlds and onchain games built with MUD. Rohan will showcase some of these tools in this demo session.",
  "track": "[CLS] MUD Community-Led Session, by 0xPARC",
  "type": "Lightning Talk",
  "expertise": "Beginner",
  "audience": "Product",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "Tooling",
    "Gaming",
    "Autonomous World",
    "analytics",
    "Autonomous World",
    "Gaming",
    "Tooling"
  ],
  "keywords": [],
  "duration": 289,
  "language": "en",
  "sources_swarmHash": "9609159b76f8b938655bcfa12a870a0cd47ee7b167a065e54b727047328c4b6e",
  "sources_youtubeId": "qWTamrBBH2E",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": "673585b79dbb7a90e106bdd7",
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/673585b79dbb7a90e106bdd7.vtt",
  "transcript_text": " Hey, hello. My name is Rohan. I'm from Yeoman. How many people here are game developers? You build games. Okay, and how many play games? Great. I have something here for every one of you, gamers and developers. So what I want to show this morning is my email. Yes, so we have dashboards. We built dashboards. So all of the data is on-chain. All of our game data data everything you play is on chain we wanted to visualize it and this is useful for both developers and gamers so let me jump into one of the games biomes so we what we do yeoman is we index all this data we then create charts and graphs that's helpful for both the developers and the gamers. So here we have biomes. We have like a million transactions indexed, and we create these charts. For example, here what we show is like most of the actions in biomes is mining actions. You have move, quite a few things. As you scroll down, you get to see activity over the lifetime. It surged in the beginning of the launch. It was quiet for some time, and we see a huge spike now. And, yeah, that's in biomes. Pretty cool these days. And as you scroll down, you get to see a lot of data. Again, all of this data is on-chain, but then we make it presentable. We make it visualized. When you visualize it, you quickly get an idea of how all this data looks. It's pretty cool. And as you scroll down, you get to see lots of charts, graphs. We have all this data indexed on chains. So you just can create all these chains. So you can chess. If you are a gamer on biomes, if you're looking at mining, for example, it's pretty early days. We have about 6% of the Neptunium mined at the moment. And as you scroll down, you get to see lots of charts. This is interesting. Biomes is a 3D world. We have a 2D representation of what is mind and what's not. So the red represents all the ores, and the white is all the ones that are mind. So this is useful for gamers and developers. And let me scroll down to the last chart. So this is all the movement within biomes. Everybody that's moved on, it's all plotted on a single 2D graph. You can see the high traffic areas in the middle and then it's quieter at the sides. As a developer, if you were to visualize your game, you get to see things like, hey, there's a hot spot here. You can probably design, you can probably build a bazaar somewhere farther, or if you want to build, be a gamer, and if you want to see, hey, where to position your wonder that you're building, you could be like, go on to a high-traffic area or something like that. So all of this data is on-chain, and this helps you quite a bit. So that's that. Okay, let me switch on to another game. So, okay, I've got two minutes. So this is a game called Drawtech, which was built by Smallbrain a while ago. What I showed you now is all the data that we've indexed. We then were able to query it, plot it into charts and graphs and all of that. I want to show you something else interesting. So what we did was we built a time travel feature for mud indexer. So basically what you see here is the canvas on DrawTech when it was launched. So this was the first block. This is probably small brain. Somebody went in and tested this. They put a tree in there. If you click on next, what it'll do is it'll fetch the very next block. This is all using a mud indexer. It goes to what it was at the point in time, or rather point in block. It gets all that. Click on next. You can see how the whole game developed. As you click on next, it goes to every subsequent block. It fetches the canvas, the colors. You can see who it was and all of that. So you can see the whole development of the game. You can go to the very last one. This is how it looks at the moment. And then if you go back in time, you can rewind from where it is. You can go back and all of that. So all of this data is on-chain. We're making it presentable, pretty, accessible, and all of that for developers and gamers. And if you... If a project's not listed here, please reach out. You just fill out this form. Send us your ABI. Send us all the information. We can get it indexed. This afternoon, we are talking about our cool new project called Command. It's pretty interesting, but I need more time to talk about it. And we'll be presenting it then",
  "eventId": "devcon-7",
  "slot_start": 1731558600000,
  "slot_end": 1731558900000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1D2DHsWzGk1OOmOYP0VkdpHHHgEYGIOx9nMKOiTdQw-Y",
  "resources_slides": "",
  "speakers": [
    "rohan-abraham"
  ]
}