{
  "id": "you-know-whats-going-to-get-us-from-web2-to-web3-therapy",
  "sourceId": "LUKWAM",
  "title": "You know what’s going to get us from web2 to web3? Therapy",
  "description": "2024 has been about thinking how we avoid recreating the same systems just \"over here\". And it has to start with our intentions and our ability to make decisions from a better place vs continuing to be influenced by scarcity mindsets, disregulated nervous systems and a burntout collective. \r\n\r\nI delve deeper into this here https://pop.mirror.xyz/JoTHH4cSRw967mphJqur6hWS6vQx0q89ee0WnO1o63g",
  "track": "Coordination",
  "type": "Lightning Talk",
  "expertise": "Intermediate",
  "audience": "Community",
  "featured": false,
  "doNotRecord": false,
  "tags": [
    "future"
  ],
  "keywords": [
    "thriving",
    "mental health",
    "future"
  ],
  "duration": 531,
  "language": "en",
  "sources_swarmHash": "b56e50859f10264bce39a4458b8d038188b99b991e4359c0f173ef425205fdfe",
  "sources_youtubeId": "mKDf6mBemhg",
  "sources_ipfsHash": "",
  "sources_livepeerId": "",
  "sources_streamethId": null,
  "transcript_vtt": "https://streameth-develop.ams3.digitaloceanspaces.com/transcriptions/67346f749dbb7a90e1e77b65.vtt",
  "transcript_text": " I have a very special speaker, Simona Pop. She's going to give us a talk on, you know what's going to get us from Web 2 to Web 3? Therapy. Let's welcome Simona. Hi. Hello. Hi. Okay, so this is a super sped up version of the talk that I gave at ECC this year with slight improvements, obviously, because I wasn't going to talk to you about the same thing. These are my socials so we can continue this conversation because this is going to be a marathon. I talk a lot. So we're going to go a little bit over. Sorry. Okay, so what's going to get us from Web 2 to Web 3? It's clearly therapy. Here's the agenda. These are all slides that you can take photos of and then read later because I'm going to go real fast. So I tweeted this pretty much a year and a bit ago because I very, very deeply felt it at the time. This is after I burnt myself out and had to, like the end of 2022 at DEF CON in Bogota, somebody asked me, Simona, what are you excited about next year? And I said, nothing. And so I was like, oh, damn, that's not good. And so I realized, and i used to like fool myself and say oh yeah i was on the brink of burnout no it's probably burnout for like a year and a half um i have been in this ecosystem for seven years it is very intense as we know and we kind of need to be mindful of how we're treating the humans behind the protocols and the humans behind the tech, I say this with personal interest in mind because therapy has benefited me greatly. We're in a space of all of the innovation. And the thing is, we have all of these ingredients that are prime for innovation. We're free to think, experiment and speculate. However, the technology isn't the only thing that's going to help us innovate. We need a shift in the values and the thinking and the way we approach things. And I genuinely believe that we need that in order to build better things or build things differently. Why? Because, as Maslow, we know him, he loves pyramids, he said, you can continuously go towards growth or fall back into safety. What keeps us into safety? Even when it is very, very bad for us, our nervous system is designed to keep us safe, even if it is, again, bad. Think of it from, bless you, think of it from the perspective of WIP2 going into WIP3. Some people and a lot of people actually would rather remain where they are because they're afraid to grow. Let us not be in that space and have and facilitate within ourselves and within our collective the opportunity and the way for us to continue towards growth again not just technological but also in terms of human thriving. Because I firmly believe that the societies and economies we build are a reflection of our conscious and unconscious conditioning. We have been conditioned and bastardized into intense scarcity mindsets, intense, just, combative and extractive ways of behaving and being that I genuinely think if we are going to build something different with this technology because of this technology we need to shift out of that and we need to be aware enough to know what we are doing in order to do that until you make the unconscious conscious it will direct your life and you will call it fate. We have the opportunity because of this incredible technology that we're all working on. If we're aware enough, we can actually not just repeat the stuff that we have built just over here. We have the ability and the opportunity to genuinely change things and redesign things at many, many different levels that get to benefit us personally, that get to benefit us as a collective, that get to benefit us hopefully for generations to come. A lot of responsibility. But what it also does, when you're self-aware and when, and we're leading into this. Oh, my God, I'm going so slow. Okay. You can access like higher core needs, right? Those take a photo of that because those are important. When you're stressed, you do not think about those things. You think about how can I get mine? How can I satisfy my base, base needs? And you make bad decisions when you're stressed. You make decisions out of survival. Now, if we think people are in charge of billions of dollars and building technology that can genuinely change lives, we don't want them making bad decisions because they're stressed. We don't want them making bad decisions because they're not aware that they have some sort of child-based wound that makes them want to extract money versus build something that is better. So this is important. So like, yeah, read it later. This was a poll that I did for ACC where it gives you some stats about where our community is. If you see most people are feeling not great, anxious, meh, tired. Some people are feeling good, which is good. But also these are some of the challenges that are incredible stressors for our nervous systems. And these are very, very real elements of our ecosystem. Like that can put you into intense stress. And we need to be mindful of that. And we need to make sure that the people building in this ecosystem have ways of dealing with these things or we as an ecosystem are dealing with those things and are aware of those things. Burnout, that was also me. So 70% said they burnt out at least once. So that's not good. Anxiety is on the daily most of the time, so again, a very, very important factor, especially when we want this to be something that the talented humans are building in this ecosystem, kind of do it more than a year or two. You get the gist. Okay, sorry, do you want to take a photo? I mean, do it quick. But you get it. So again, this was something that I did at ECC, and this would be the practical thing that I'm suggesting. So a human protocol that's like, puts the focus on the humans behind the tech. Because I think there should be a base protocol, a base layer protocol that focuses on the humans. If we want all of us here to continue being creative, to continue having energy to do this, to continue making decisions from a higher value place, we need to have regulated nervous systems. And we need to be aware of what it is that we're doing, why we're driving certain things, why we're making certain decisions, how we're making those decisions. And I think this needs to be implemented the same way as we talk about tech protocols. A human protocol is as important as far as I'm concerned. These are the benefits and the purpose and the vision, obviously. And here, just because when you talk about therapy or talk about anything like this, it's very scary. I'm not saying that people are crazy, although a lot of us are. But these are kind of the stages. You don't have to go full ham on like get everybody on the team therapy. You can start very small, like a pilot, and then implement it, and then grow from there in stages, which I think is, again, a very, very important thing to do something gradual because, again, not everybody is comfortable with a lot of things when it comes to therapy, when it comes to stress management, when it comes to, again, regulating a nervous system. Most people don't know how to do that, and it's an important, very important tool to have. And then, yeah, this is a great meme. I made it. And then, yeah, thank you. How much older was I?",
  "eventId": "devcon-7",
  "slot_start": 1731487800000,
  "slot_end": 1731488400000,
  "slot_roomId": "classroom-a",
  "resources_presentation": "https://docs.google.com/presentation/d/1gUdSnWcxJdTYFT1JrkVP_VWgSxrlBCcEuwRk8pzgBSA",
  "resources_slides": null,
  "speakers": [
    "simona-pop"
  ]
}